{
  "sourceUrl": "https://www.partselect.com/PS16542496-GE-WE03X29897-Drive-Belt.htm?SourceCode=18",
  "title": "Drive Belt Specifications",
  "partSelectNumber": "PS16542496",
  "manufacturerPartNumber": "WE03X29897",
  "price": "36.10",
  "stockStatus": "",
  "description": "This Drive Belt is 89.5\" long and comes in black, featuring four ribs on the inside for a better grip. This is a long belt that wraps all the way around the dryer drum, around a tension pulley, and then around the drive motor pulley, allowing all the parts to work together, spinning the drum as the motor rotates. If the drum will not turn when the dryer is turned on the belt is likely broken. It is common for belts to stretch or become brittle over time, which is what leads to the breakage. If broken, it should be replaced; the drum simply cannot spin without this belt. Refer to your model number and user manual to check if this part is right for you. Ensure you use work gloves to protect your hands from sharp internal parts during this repair. Please note: When comparing the length of your old belt to the length of the belt as stated here, remember that a small amount of stretching and contortion may occur with belts over time for a range of different reasons. Unless your belt is drastically different in length, this belt is what you are looking for despite any small inaccuracies. You will need to remove power to your appliance, remove the main panel, and access the motor drive to slip your new belt back into place.",
  "installationInstructions": "",
  "reviews": [
    {
      "author": "Summary",
      "rating": "4.8",
      "count": 174,
      "text": "This product has 174 reviews with an average rating of 4.8 out of 5 stars."
    }
  ],
  "compatibleModels": [
    "Dryer",
    "Washer Dryer Combo",
    "Washer."
  ],
  "relatedParts": [],
  "symptoms": [
    "This part fixes the following symptoms:\n                Noisy | Drum Not Spinning | Won’t Start | Heat stays on after drum has stopped"
  ],
  "replacementParts": [
    "WE12M0022",
    "WE12M22",
    "WE12M29",
    "WE12M33",
    "WE12X21574"
  ]
}