{
  "brands": [
    {
      "name": "Admiral",
      "url": "/Admiral-Parts.htm"
    },
    {
      "name": "Frigidaire",
      "url": "/Frigidaire-Parts.htm"
    },
    {
      "name": "General Electric",
      "url": "/GE-Parts.htm"
    },
    {
      "name": "Jenn-Air",
      "url": "/Jenn-Air-Parts.htm"
    },
    {
      "name": "KitchenAid",
      "url": "/KitchenAid-Parts.htm"
    },
    {
      "name": "LG",
      "url": "/LG-Parts.htm"
    },
    {
      "name": "Maytag",
      "url": "/Maytag-Parts.htm"
    },
    {
      "name": "Whirlpool",
      "url": "/Whirlpool-Parts.htm"
    },
    {
      "name": "White-Westinghouse",
      "url": "/White-Westinghouse-Parts.htm"
    },
    {
      "name": "See all Appliance Brands",
      "url": "/Brands/"
    },
    {
      "name": "Ariens",
      "url": "/Ariens-Parts.htm"
    },
    {
      "name": "Briggs and Stratton",
      "url": "/Briggs-Stratton-Parts.htm"
    },
    {
      "name": "Echo",
      "url": "/Echo-Parts.htm"
    },
    {
      "name": "Husqvarna",
      "url": "/Husqvarna-Parts.htm"
    },
    {
      "name": "MTD",
      "url": "/MTD-Parts.htm"
    },
    {
      "name": "Murray",
      "url": "/Murray-Parts.htm"
    },
    {
      "name": "Poulan",
      "url": "/Poulan-Parts.htm"
    },
    {
      "name": "Troy-Bilt",
      "url": "/Troy-Bilt-Parts.htm"
    },
    {
      "name": "See all Lawn Equipment Brands",
      "url": "/Brands/#LawnEquipment"
    },
    {
      "name": "Dishwasher",
      "url": "/Dishwasher-Parts.htm"
    },
    {
      "name": "Dryer",
      "url": "/Dryer-Parts.htm"
    },
    {
      "name": "Stove",
      "url": "/Range-Parts.htm"
    },
    {
      "name": "Refrigerator",
      "url": "/Refrigerator-Parts.htm"
    },
    {
      "name": "Washer",
      "url": "/Washer-Parts.htm"
    },
    {
      "name": "See all Appliances",
      "url": "/Products/"
    },
    {
      "name": "Lawn Mower",
      "url": "/Lawn-Mower-Parts.htm"
    },
    {
      "name": "Snow Blower",
      "url": "/Snow-Blower-Parts.htm"
    },
    {
      "name": "Lawn Tractor",
      "url": "/Lawn-Tractor-Parts.htm"
    },
    {
      "name": "Chainsaw",
      "url": "/Chainsaw-Parts.htm"
    },
    {
      "name": "Tiller",
      "url": "/Tiller-Parts.htm"
    },
    {
      "name": "Generator",
      "url": "/Generator-Parts.htm"
    },
    {
      "name": "See all Lawn Equipment",
      "url": "/Products/#LawnEquipment"
    },
    {
      "name": "Same-day Shipping",
      "url": "/Same-Day-Shipping.htm"
    },
    {
      "name": "All Original Manufacturer Parts\n                            Genuine Quality",
      "url": "/oem/"
    },
    {
      "name": "1 Year Warranty",
      "url": "/One-Year-Warranty.htm"
    }
  ],
  "parts": [
    {
      "title": "GE Drive Belt",
      "partSelectNumber": "PS16542496WE03X29897",
      "manufacturerPartNumber": "WE03X29897",
      "price": "36.10",
      "description": "This Drive Belt is 89.5\" long and comes in black, featuring four ribs on the inside for a better grip. This is a long belt that wraps all the way around the dryer drum, around a tension pulley, and then around the drive motor pulley, allowing all the parts to work together, spinning the drum as the motor rotates. If the drum will not turn when the dryer is turned on the belt is likely broken. It is common for belts to stretch or become brittle over time, which is what leads to the breakage. If broken, it should be replaced; the drum simply cannot spin without this belt. Refer to your model number and user manual to check if this part is right for you. Ensure you use work gloves to protect your hands from sharp internal parts during this repair. Please note: When comparing the length of your old belt to the length of the belt as stated here, remember that a small amount of stretching and contortion may occur with belts over time for a range of different reasons. Unless your belt is drastically different in length, this belt is what you are looking for despite any small inaccuracies. You will need to remove power to your appliance, remove the main panel, and access the motor drive to slip your new belt back into place.",
      "symptoms": [
        "Drum Not Spinning",
        "Heat stays on after drum has stopped",
        "Noisy"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS16542496-GE-WE03X29897-Drive-Belt.htm?SourceCode=18"
    },
    {
      "title": "GE Drum Bearing Slide - Green (Sold individually)",
      "partSelectNumber": "PS6447706WE1M1067",
      "manufacturerPartNumber": "WE1M1067",
      "price": "14.40",
      "description": "This original equipment manufacturer Drum Bearing Slide is a plastic, green, easy-to-install part for your dryer. It replaces the dryer's front drum slide to allow for easier movement. You'll know if this part is an issue if your dryer is unable to tumble properly or is very noisy. Damage can come from regular use. As the slides start to break down it may cause your dryer to make noise or not dry clothes in the usual amount of time. You will need to purchase two for both sides of your dryer. They attach to the outer-most sides of the bearing. The manufacturer recommends replacing both slides at the same time. Take this opportunity to clean out the lint and dust in the dryer, to keep it running smoothly. This is a genuine replacement part that comes directly from the manufacturer. This item is sold individually. The part attaches to the outermost side of the bearing. Although this part is denoted as being \"Green\" in its title, many users and technicians have noted that its true colour is closer to a dark gray or black.",
      "symptoms": [
        "Drum Not Spinning",
        "Marks left on clothes",
        "Noisy"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS6447706-GE-WE1M1067-Drum-Bearing-Slide-Green-Sold-individually.htm?SourceCode=18"
    },
    {
      "title": "GE Drum Bearing Slide - White (Sold individually)",
      "partSelectNumber": "PS755842WE1M504",
      "manufacturerPartNumber": "WE1M504",
      "price": "18.57",
      "description": "This authentic, white Drum Bearing Slide, also known as the bearing drum slide, glide, or pad, is a plastic, easy-to-install part for your dryer. It replaces the dryer's front drum slide to allow for easier movement. You'll know if this part is an issue if your dryer is unable to tumble properly or is very noisy. Damage can come from regular use. The part attaches to the outermost side of the bearing. Check both slides for signs of wear, because they often wear at the same rate, and should be replaced at the same time; there are 2 of these particular slides per dryer. This part is sold individually, so you'll need to purchase multiple parts if replacing both at the same time.",
      "symptoms": [
        "Marks left on clothes",
        "Noisy"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS755842-GE-WE1M504-Drum-Bearing-Slide-White-Sold-individually.htm?SourceCode=18"
    },
    {
      "title": "GE LOWER SPRAY ARM",
      "partSelectNumber": "PS17137081WD22X33499",
      "manufacturerPartNumber": "WD22X33499",
      "price": "19.70",
      "description": "This lower spray arm assembly in your dishwasher distributes water and detergent during the washing cycle by spinning around and spraying water in different directions. You can usually find it attached to a support or hub at the bottom of the dishwasher. If this part is broken, you might notice some signs. You might hear a knocking or banging sound coming from the dishwasher. The spray arm may not rotate properly or might seem wobbly. It is important to replace a damaged arm assembly as your dishes will not get cleaned properly, and they will still have dirt on them even after a wash cycle. It can also cause the dishwasher to have a bad smell because of leftover food residue. To remove your existing arm assembly, you will need to release its locking mechanism before lifting it out of your appliance. Please be informed that this OEM-verified part is sold individually.",
      "symptoms": [
        "Leaking",
        "Noisy",
        "Not cleaning dishes properly"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS17137081-GE-WD22X33499-LOWER-SPRAY-ARM.htm?SourceCode=18"
    },
    {
      "title": "GE Lint Filter",
      "partSelectNumber": "PS11763056WE03X23881",
      "manufacturerPartNumber": "WE03X23881",
      "price": "41.03",
      "description": "This is a genuine OEM part that works for some models of GE, and Hotpoint models. This Lint Filter is used for Dryer.",
      "symptoms": [
        "Door won’t close"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS11763056-GE-WE03X23881-Lint-Filter.htm?SourceCode=18"
    },
    {
      "title": "GE LOWER RACK ROLLER",
      "partSelectNumber": "PS16217024WD12X26146",
      "manufacturerPartNumber": "WD12X26146",
      "price": "13.11",
      "description": "The lower rack roller supports the smooth sliding of your dishwasher’s bottom rack. Measuring 1.5 inches in diameter and charcoal-colored, this OEM replacement part is sold individually. Replace all four rollers at once for consistent performance. Wear gloves during installation.",
      "symptoms": [],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS16217024-GE-WD12X26146-LOWER-RACK-ROLLER.htm?SourceCode=18"
    },
    {
      "title": "GE Refrigerator Water Filter",
      "partSelectNumber": "PS16217433XWFE",
      "manufacturerPartNumber": "XWFE",
      "price": "79.91",
      "description": "This water filter is found in the rear upper-right corner of the interior of the refrigerator. If your model has a replacement indicator light it will turn red to signal the need for a replacement. If your model does not have an indicator light, the filter cartridge should be replaced every six months or earlier if you notice a decrease in the flow of water from the dispenser. The filter media is carbon black and reduces leads, some pharmaceuticals, and fifty other contaminates. It is 2 inches deep, 6 inches high, 2.25 inches wide and weighs approximately 1 lbs. When it comes time to replace the filter, first discard the old one by turning it to the left to remove. It will release itself when it has been turned far enough. Installation instructions are quick and simple but can vary slightly depending on if it is a bottom-freezer, side-by-side or multi-door bottom-freezer model. Refer to the user instructions for you filter. Do not forget to reset the filter change indicator if applicable. In bottom-freezer and side-by-side models this is done by pressing and holding the RESET WATER FILTER bottom for three seconds. On a multi-door bottom-freezer model, press the button underneath the Confirm Filter Change message while the water is dispensing. On select models this reset is done automatically once a new filter is installed.",
      "symptoms": [
        "Not dispensing water"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS16217433-GE-XWFE-Refrigerator-Water-Filter.htm?SourceCode=18"
    },
    {
      "title": "GE Refrigerator Water Filter",
      "partSelectNumber": "PS10063209RPWFE",
      "manufacturerPartNumber": "RPWFE",
      "price": "92.32",
      "description": "This NSF-certified water filter helps to improve the taste, quality, and health of your water by removing a number of contaminants including mercury, lead, and trace pharmaceuticals. The filter should be replaced every six month or after 300 gallons of water have been filtered. If you are unsure if your filter is due for replacement, another indicator is if the water flow from the dispenser has slowed down considerably. Replacing this part is a simple task that does not require any tools or shutting off the water or power supply to your fridge. Once the new filter has been installed, be sure to run at least two gallons of water through before consuming.",
      "symptoms": [
        "Ice maker not making ice",
        "Not dispensing water"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS10063209-GE-RPWFE-Refrigerator-Water-Filter.htm?SourceCode=18"
    },
    {
      "title": "GE Front Drum Bearing",
      "partSelectNumber": "PS960316WE3M26",
      "manufacturerPartNumber": "WE3M26",
      "price": "32.89",
      "description": "This Front Drum Bearing (Top Bearing, Dryer Drum Front Support Bearing, Drum Support Bearing, Dryer Drum Glide Bearing) holds the drum bearing and slides for the drum to turn on. The front drum bearing attaches onto the inside of the dryer front panel. When this part fails, the drum may no longer turn freely, make odd sounds, and not dry properly due to the drum no longer sealing. This part needs to be replaced if it is broken (often due to normal wear and tear), no longer able to hold the drum bearing slide securely, or has been eroded by the drum movement. This part is about 10 inches in height and 22 inches in width, and comes in white plastic. Sold individually.",
      "symptoms": [
        "Marks left on clothes",
        "Noisy"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS960316-GE-WE3M26-Front-Drum-Bearing.htm?SourceCode=18"
    },
    {
      "title": "GE Timer Knob",
      "partSelectNumber": "PS11736611WE01X24552",
      "manufacturerPartNumber": "WE01X24552",
      "price": "20.27",
      "description": "This is a timer control knob for your dryer. The timer is the main part within dryers that is responsible for controlling when the different processes of the drying cycle occur, and it is important that the knob that controls it works properly, too. If you are having difficulty selecting the correct dryer function and mode, this knob may be broken and need to be replaced. To replace this knob, simply pull the old one away and off, and then carefully push the new one on in its place. This OEM knob is sold individually, and does not come with any other parts.",
      "symptoms": [
        "Timer Not Working",
        "Won’t Start"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS11736611-GE-WE01X24552-Timer-Knob.htm?SourceCode=18"
    }
  ]
}