{
  "pageTitle": "",
  "sourceUrl": "https://www.partselect.com/Dishwasher-Parts.htm",
  "brands": [
    {
      "name": "Admiral-Parts",
      "url": "https://www.partselect.com/Admiral-Parts.htm"
    },
    {
      "name": "Frigidaire-Parts",
      "url": "https://www.partselect.com/Frigidaire-Parts.htm"
    },
    {
      "name": "GE-Parts",
      "url": "https://www.partselect.com/GE-Parts.htm"
    },
    {
      "name": "Jenn-Air-Parts",
      "url": "https://www.partselect.com/Jenn-Air-Parts.htm"
    },
    {
      "name": "KitchenAid-Parts",
      "url": "https://www.partselect.com/KitchenAid-Parts.htm"
    },
    {
      "name": "LG-Parts",
      "url": "https://www.partselect.com/LG-Parts.htm"
    },
    {
      "name": "Maytag-Parts",
      "url": "https://www.partselect.com/Maytag-Parts.htm"
    },
    {
      "name": "Whirlpool-Parts",
      "url": "https://www.partselect.com/Whirlpool-Parts.htm"
    },
    {
      "name": "White-Westinghouse-Parts",
      "url": "https://www.partselect.com/White-Westinghouse-Parts.htm"
    },
    {
      "name": "Brands",
      "url": "https://www.partselect.com/Brands/"
    },
    {
      "name": "Ariens-Parts",
      "url": "https://www.partselect.com/Ariens-Parts.htm"
    },
    {
      "name": "Briggs-Stratton-Parts",
      "url": "https://www.partselect.com/Briggs-Stratton-Parts.htm"
    },
    {
      "name": "Echo-Parts",
      "url": "https://www.partselect.com/Echo-Parts.htm"
    },
    {
      "name": "Husqvarna-Parts",
      "url": "https://www.partselect.com/Husqvarna-Parts.htm"
    },
    {
      "name": "MTD-Parts",
      "url": "https://www.partselect.com/MTD-Parts.htm"
    },
    {
      "name": "Murray-Parts",
      "url": "https://www.partselect.com/Murray-Parts.htm"
    },
    {
      "name": "Poulan-Parts",
      "url": "https://www.partselect.com/Poulan-Parts.htm"
    },
    {
      "name": "Troy-Bilt-Parts",
      "url": "https://www.partselect.com/Troy-Bilt-Parts.htm"
    },
    {
      "name": "Brands",
      "url": "https://www.partselect.com/Brands/#LawnEquipment"
    },
    {
      "name": "Dishwasher-Parts",
      "url": "https://www.partselect.com/Dishwasher-Parts.htm"
    },
    {
      "name": "Dryer-Parts",
      "url": "https://www.partselect.com/Dryer-Parts.htm"
    },
    {
      "name": "Range-Parts",
      "url": "https://www.partselect.com/Range-Parts.htm"
    },
    {
      "name": "Refrigerator-Parts",
      "url": "https://www.partselect.com/Refrigerator-Parts.htm"
    },
    {
      "name": "Washer-Parts",
      "url": "https://www.partselect.com/Washer-Parts.htm"
    },
    {
      "name": "Products",
      "url": "https://www.partselect.com/Products/"
    },
    {
      "name": "Lawn-Mower-Parts",
      "url": "https://www.partselect.com/Lawn-Mower-Parts.htm"
    },
    {
      "name": "Snow-Blower-Parts",
      "url": "https://www.partselect.com/Snow-Blower-Parts.htm"
    },
    {
      "name": "Lawn-Tractor-Parts",
      "url": "https://www.partselect.com/Lawn-Tractor-Parts.htm"
    },
    {
      "name": "Chainsaw-Parts",
      "url": "https://www.partselect.com/Chainsaw-Parts.htm"
    },
    {
      "name": "Tiller-Parts",
      "url": "https://www.partselect.com/Tiller-Parts.htm"
    },
    {
      "name": "Generator-Parts",
      "url": "https://www.partselect.com/Generator-Parts.htm"
    },
    {
      "name": "Products",
      "url": "https://www.partselect.com/Products/#LawnEquipment"
    },
    {
      "name": "Same-Day-Shipping",
      "url": "https://www.partselect.com/Same-Day-Shipping.htm"
    },
    {
      "name": "oem",
      "url": "https://www.partselect.com/oem/"
    },
    {
      "name": "One-Year-Warranty",
      "url": "https://www.partselect.com/One-Year-Warranty.htm"
    }
  ],
  "popularParts": [
    {
      "title": "Dishwasher Upper Rack Adjuster Kit - White Wheels, Left and Right Sides",
      "partSelectNumber": "PS10065979W10712395",
      "manufacturerPartNumber": "W10712395",
      "price": "39.89",
      "description": "This authentic Dishwasher Upper Rack Adjuster Kit with white wheels is a kit made up of primarily plastic and metal components, which will require a screwdriver to install. This kit comes with all the necessary parts for a dishwasher rack adjuster. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. If broken then the rack will no longer slide properly, and the part must be replaced. In many cases, our customers have reported the top rack of their dishwasher hanging down or sagging due to the adjuster kit, particularly if the wheels, have broken or failed. If you are having problems in this area, this kit will help get your dishwasher back up and running. Check your model number and user manual to see if this part is right for you. The parts for this kit come as a package and are not generally sold individually.",
      "symptoms": [
        "Door latch failure",
        "Door won’t close",
        "Leaking"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS10065979-Whirlpool-W10712395-Upper-Rack-Adjuster-Kit-White-Wheels-Left-and-Right-Sides.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher Rack Track Stop",
      "partSelectNumber": "PS11746591WP8565925",
      "manufacturerPartNumber": "WP8565925",
      "price": "7.70",
      "description": "The rack track stop on your dishwasher is designed to stop the dish rack at the appropriate place when opening and closing the rack. If your dishwasher is not cleaning your dishes properly, the rack stop may need to be replaced. The replacement part may differ slightly from the broken part, depending on the model. However, the different styles are interchangeable. This product is sold individually and comes in both a white and grey plastic version. Many of our customers found this repair to be very easy and takes less than 30 minutes to complete. Simply snap the old part out and snap the new part into place. You will not require any tools to complete the job. This is an authentic part approved by the manufacturer.",
      "symptoms": [
        "Door latch failure",
        "Door won’t close",
        "Noisy"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS11746591-Whirlpool-WP8565925-Rack-Track-Stop.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher Lower Dishrack Wheel",
      "partSelectNumber": "PS3406971W10195416",
      "manufacturerPartNumber": "W10195416",
      "price": "26.89",
      "description": "This OEM gray Dishwasher Lower Dishrack Wheel Assembly is a plastic kit that allows the rack to slide in and out of the dishwasher easily. If it breaks or becomes damaged. sliding will feel difficult. This can happen due to normal wear and tear, and the part should be replaced if this occurs. Check your model number and user manual to make sure this part is correct. It attaches directly to the dishrack. To repair, open the dishwasher door and pull out the lower dishrack. Next, push the tab from both sides and it should pop out. To install the new wheel assembly, place it on the rack and make sure the caps overlap the wire from the inside before you clip it in place by pushing the wheel. It measures roughly 3x6 inches.",
      "symptoms": [
        "Door latch failure",
        "Door won’t close",
        "Leaking"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS3406971-Whirlpool-W10195416-Lower-Dishrack-Wheel.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher LOWER SPRAY ARM",
      "partSelectNumber": "PS17137081WD22X33499",
      "manufacturerPartNumber": "WD22X33499",
      "price": "19.70",
      "description": "This lower spray arm assembly in your dishwasher distributes water and detergent during the washing cycle by spinning around and spraying water in different directions. You can usually find it attached to a support or hub at the bottom of the dishwasher. If this part is broken, you might notice some signs. You might hear a knocking or banging sound coming from the dishwasher. The spray arm may not rotate properly or might seem wobbly. It is important to replace a damaged arm assembly as your dishes will not get cleaned properly, and they will still have dirt on them even after a wash cycle. It can also cause the dishwasher to have a bad smell because of leftover food residue. To remove your existing arm assembly, you will need to release its locking mechanism before lifting it out of your appliance. Please be informed that this OEM-verified part is sold individually.",
      "symptoms": [
        "Leaking",
        "Noisy",
        "Not cleaning dishes properly"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS17137081-GE-WD22X33499-LOWER-SPRAY-ARM.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher Lower Spray Arm",
      "partSelectNumber": "PS125856235304517203",
      "manufacturerPartNumber": "5304517203",
      "price": "31.89",
      "description": "The Lower Spray Arm is used in your dishwasher to spray water and clean your dishes. If broken there will be visible damage or your dishes may no longer be cleaned properly. If your spray arm is broken (due to general wear or high heat), it should be replaced. Your lower spray arm will be located at the bottom of your dishwasher tub. Check your user manual and model number to ensure this model is right for you. This version is plastic and metal and comes in gray/blue. We recommend you wear work gloves to keep your hands safe when installing and disconnect power to the appliance. You will also want to make sure that you turn off the water supply to your dishwasher. From here, you will want to open the dishwasher, pull out the lower rack and set it aside. Remove the lower wash arm. On each side of the bottom of the spray arm, there are small locking tabs that can be pushed aside using a flathead screwdriver. Once released, the spray arm can easily be pulled off the dishwasher. Put the new lower wash arm in place and push it down to lock it in. Ensure it is spinning freely and does not hit the heating element. Return the lower dish rack into place and then close the dishwasher door.",
      "symptoms": [
        "Door latch failure",
        "Leaking",
        "Noisy"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS12585623-Frigidaire-5304517203-Lower-Spray-Arm.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher Lower Dishrack Wheel Assembly",
      "partSelectNumber": "PS11750057WPW10195417",
      "manufacturerPartNumber": "WPW10195417",
      "price": "33.89",
      "description": "This gray plastic lower dishrack roller is a part for your dishwasher. It attaches to the bottom of the lower dishrack, allowing it to move in and out smoothly. If the lower dishrack stops moving in and out easily or preventing you from being able to shut the dishwasher door, inspect the dishrack roller for damage. The assembly includes 2 rollers and the bracket that attaches to the dishrack (parts are not sold separately). This assembly is sold individually, so you will need 4 assemblies to replace them all in your appliance. For this easy repair, start by removing the lower dishrack from the appliance and set it on the counter. Use a screwdriver to pry off the old roller assembly from the lower tabs. Align the new part on the dishrack by snapping it in place.",
      "symptoms": [
        "Door latch failure",
        "Door won’t close",
        "Not cleaning dishes properly"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS11750057-Whirlpool-WPW10195417-Lower-Dishrack-Wheel-Assembly.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher Upper Rack Adjuster",
      "partSelectNumber": "PS11756150WPW10546503",
      "manufacturerPartNumber": "WPW10546503",
      "price": "24.89",
      "description": "This OEM Dishwasher Upper Rack Adjuster is a grayish-black, plastic part which will require a screwdriver to install. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. If broken then the rack will no longer slide properly, and the part must be replaced. The installation has been rated as \"easy\" by customers. Before beginning any repair, you should unplug the dishwasher and wear gloves to protect your hands. Check your model number and user manual to see if this part is right for you! Your dishwasher should have a left and right upper rack adjuster, and both are the same part. These parts are sold individually, so if you are looking to replace both, you will need to order two parts.",
      "symptoms": [
        "Door latch failure",
        "Door won’t close",
        "Leaking"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS11756150-Whirlpool-WPW10546503-Dishwasher-Upper-Rack-Adjuster.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher LOWER RACK ROLLER",
      "partSelectNumber": "PS16217024WD12X26146",
      "manufacturerPartNumber": "WD12X26146",
      "price": "13.11",
      "description": "The lower rack roller supports the smooth sliding of your dishwasher’s bottom rack. Measuring 1.5 inches in diameter and charcoal-colored, this OEM replacement part is sold individually. Replace all four rollers at once for consistent performance. Wear gloves during installation.",
      "symptoms": [],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS16217024-GE-WD12X26146-LOWER-RACK-ROLLER.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher Bottom Door Gasket",
      "partSelectNumber": "PS9495545809006501",
      "manufacturerPartNumber": "809006501",
      "price": "21.06",
      "description": "This dishwasher door gasket (Bottom Gasket, Gasket, Door Seal, Dishwasher Door Lower Seal) helps prevent water from leaking out of the bottom edge of your dishwasher door by creating a watertight seal. This part is attached to the bottom of your dishwasher inner door panel. It is frequently exposed to water and detergent during its lifetime. The water and chemicals can eventually wear down the gasket and compromise the integrity of the seal. If the gasket is malfunctioning, the integrity of the door seal will be effected. You will notice leaking through the bottom of your dishwasher door. If your dishwasher is leaking water from the bottom of the door, first inspect the seal for food particles near the bottom and sides, and remove the buildup, as it can stop the door from closing properly and keeping a tight seal; if not, you may need to replace the bottom door gasket. Check the door gasket for tears, cuts, or wear. This part is sold individually and measures 22.5 inches by 1.25 inches. It is constructed of plastic, and comes in yellow/grey. Includes one lower door gasket.",
      "symptoms": [
        "Door latch failure",
        "Door won’t close",
        "Leaking"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS9495545-Frigidaire-809006501-Dishwasher-Bottom-Door-Gasket.htm?SourceCode=18"
    },
    {
      "title": "Dishwasher Dishrack Roller - Grey",
      "partSelectNumber": "PS872738700611475",
      "manufacturerPartNumber": "00611475",
      "price": "11.11",
      "description": "This is a replacement dishrack roller or wheel for your dishwasher. It is made of gray plastic, measures a little over an inch in diameter, and is sold individually. This roller is designed for the lower dishrack of your dishwasher. On one side of the roller is a clip that allows it to be attached to the dishrack. The dishrack roller allows you to slide the dishrack in and out of the dishwasher efficiently. If one of the rollers is broken or missing, it can cause the dishrack to become difficult to slide in and out. To replace the roller, simply snap it off the dishrack, and snap the new one into place. This is a genuine OEM part.",
      "symptoms": [],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS8727387-Bosch-00611475-Dishrack-Roller-Grey.htm?SourceCode=18"
    }
  ],
  "models": []
}