{
  "brands": [
    {
      "name": "Admiral",
      "url": "/Admiral-Parts.htm"
    },
    {
      "name": "Frigidaire",
      "url": "/Frigidaire-Parts.htm"
    },
    {
      "name": "General Electric",
      "url": "/GE-Parts.htm"
    },
    {
      "name": "Jenn-Air",
      "url": "/Jenn-Air-Parts.htm"
    },
    {
      "name": "KitchenAid",
      "url": "/KitchenAid-Parts.htm"
    },
    {
      "name": "LG",
      "url": "/LG-Parts.htm"
    },
    {
      "name": "Maytag",
      "url": "/Maytag-Parts.htm"
    },
    {
      "name": "Whirlpool",
      "url": "/Whirlpool-Parts.htm"
    },
    {
      "name": "White-Westinghouse",
      "url": "/White-Westinghouse-Parts.htm"
    },
    {
      "name": "See all Appliance Brands",
      "url": "/Brands/"
    },
    {
      "name": "Ariens",
      "url": "/Ariens-Parts.htm"
    },
    {
      "name": "Briggs and Stratton",
      "url": "/Briggs-Stratton-Parts.htm"
    },
    {
      "name": "Echo",
      "url": "/Echo-Parts.htm"
    },
    {
      "name": "Husqvarna",
      "url": "/Husqvarna-Parts.htm"
    },
    {
      "name": "MTD",
      "url": "/MTD-Parts.htm"
    },
    {
      "name": "Murray",
      "url": "/Murray-Parts.htm"
    },
    {
      "name": "Poulan",
      "url": "/Poulan-Parts.htm"
    },
    {
      "name": "Troy-Bilt",
      "url": "/Troy-Bilt-Parts.htm"
    },
    {
      "name": "See all Lawn Equipment Brands",
      "url": "/Brands/#LawnEquipment"
    },
    {
      "name": "Dishwasher",
      "url": "/Dishwasher-Parts.htm"
    },
    {
      "name": "Dryer",
      "url": "/Dryer-Parts.htm"
    },
    {
      "name": "Stove",
      "url": "/Range-Parts.htm"
    },
    {
      "name": "Refrigerator",
      "url": "/Refrigerator-Parts.htm"
    },
    {
      "name": "Washer",
      "url": "/Washer-Parts.htm"
    },
    {
      "name": "See all Appliances",
      "url": "/Products/"
    },
    {
      "name": "Lawn Mower",
      "url": "/Lawn-Mower-Parts.htm"
    },
    {
      "name": "Snow Blower",
      "url": "/Snow-Blower-Parts.htm"
    },
    {
      "name": "Lawn Tractor",
      "url": "/Lawn-Tractor-Parts.htm"
    },
    {
      "name": "Chainsaw",
      "url": "/Chainsaw-Parts.htm"
    },
    {
      "name": "Tiller",
      "url": "/Tiller-Parts.htm"
    },
    {
      "name": "Generator",
      "url": "/Generator-Parts.htm"
    },
    {
      "name": "See all Lawn Equipment",
      "url": "/Products/#LawnEquipment"
    },
    {
      "name": "Same-day Shipping",
      "url": "/Same-Day-Shipping.htm"
    },
    {
      "name": "All Original Manufacturer Parts\n                            Genuine Quality",
      "url": "/oem/"
    },
    {
      "name": "1 Year Warranty",
      "url": "/One-Year-Warranty.htm"
    }
  ],
  "parts": [
    {
      "title": "Washer Washing Machine Drain Pump",
      "partSelectNumber": "PS35793184681EA2001T",
      "manufacturerPartNumber": "4681EA2001T",
      "price": "60.33",
      "description": "The drain pump and motor assembly may also be known as the washer drain pump and is a part for your washer. The drain pump helps expel water from the washing machine. The drain pump is activated after the spin cycle speed is maintained for a specific period of time. To make this installation you will need a Phillips screwdriver, a small flat-blade screwdriver, a pair of needle-nose pliers, and a pair of slip-joint pliers. Note that the pump casing is not included. This medium-difficulty repair may vary, but can generally be started by disconnecting power, then removing the top of the washer by taking out the four back screws and two small brackets. Then, remove the front panel by taking out the two screws and eight tabs that should be taken from the top. Moving down the front of the washer, remove the door, latch, tub gasket, and drain cover. Disconnect the drain hoses and clip from under the drain assembly, and install new assembly from there. Reassemble parts in direct reverse order -- taking photos during disassembly and keeping parts clearly organized can help here. Despite the number of steps, you will only need a standard Phillips screwdriver to complete this repair.",
      "symptoms": [
        "Draining Issues",
        "Engine runs but does not pump water",
        "Leaking"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS3579318-LG-4681EA2001T-Washing-Machine-Drain-Pump.htm?SourceCode=18"
    },
    {
      "title": "Washer Agitator Directional Cogs",
      "partSelectNumber": "PS38803480040",
      "manufacturerPartNumber": "80040",
      "price": "4.39",
      "description": "This kit is used for replacing the agitator directional cogs (Agitator Dogs, Agitator Repair Kit, Washer Agitator Dogs, Agitator Dog Ears). The agitator is what creates the thrusting motion in your washer to tumble your clothes during the washer cycle. Your agitator will rotate one way, and not the other. The agitator dogs are what prevent the agitator from rotating in both directions, while allowing it to rotate in one direction. Your agitator cogs may be malfunctioning if you can manually rotate the agitator in both directions. If broken they will need to be replaced. Cogs can be found by simply removing the softener dispenser and then removing the agitator cap. The are attached to the agitator. This replacement part features 4 agitator directional cogs. There are 4 cogs per package that are made up of high-quality plastic. This part comes in white/beige.",
      "symptoms": [
        "Does not dispense fabric softener or detergent",
        "Marks left on clothes",
        "Not cleaning dishes properly"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS388034-Whirlpool-80040-Agitator-Directional-Cogs.htm?SourceCode=18"
    },
    {
      "title": "Washer DOOR STRIKE",
      "partSelectNumber": "PS16218028W11457841",
      "manufacturerPartNumber": "W11457841",
      "price": "12.92",
      "description": "This door strike is an authentic OEM replacement part that is compatible with various models of top-load washing machines. The door strike is located along the door frame, where it engages with the latch when the door is closed. It keeps the door securely shut so that the washer can start and prevents it from swinging open while the washer is running. It is a safety mechanism that prevents water leakage, injuries, and damage to the washer. If the door strike is damaged or worn down, it may be unable to lock the door properly and the washer may stop mid-cycle or fail to start altogether. Replace the door strike promptly to ensure the proper functioning of your washer.",
      "symptoms": [
        "Lid or door won’t close",
        "Locking Issues",
        "Will Not Start"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS16218028-Whirlpool-W11457841-DOOR-STRIKE.htm?SourceCode=18"
    },
    {
      "title": "Washer Suspension Spring",
      "partSelectNumber": "PS11743345WP63907",
      "manufacturerPartNumber": "WP63907",
      "price": "8.00",
      "description": "The suspension spring supports the outer tub and keeps the tub steady during loads that could cause an unbalance. If this part breaks, is worn down or has stretched out and lost its spring, it could cause the load to be off-balance which can lead to excessive shaking, moving, noise, and leaks. For this repair, you will need a 1/4 nut driver, a putty knife, a flat blade screwdriver, and a pair of needle-nose pliers. Disconnect the power supply, fill hoses, and drain hose to give you safe and easy access (have a container nearby for water left in drain hose). This item is sold individually, which is important as you may need to repair multiple springs in your appliance, which carries three suspension springs. As an inexpensive part, we recommend purchasing several at a time, as they can be very useful to have on-hand.",
      "symptoms": [
        "Leaking",
        "Shaking and Moving",
        "Spinning Issues"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS11743345-Whirlpool-WP63907-Suspension-Spring.htm?SourceCode=18"
    },
    {
      "title": "Washer CLUTCH",
      "partSelectNumber": "PS11729473WH05X24185",
      "manufacturerPartNumber": "WH05X24185",
      "price": "22.33",
      "description": "This is a clutch for your washing machine. The clutch is made of a white plastic material and is used within washing machines to engage and disengage the transmission during the wash and spin cycles, and ultimately help spin the basket of the tub so your clothes finish damp and not soaked. If your washer has issues with spinning or agitating, this part is likely broken or has worn out, and will need to be replaced. To replace this part, some disassembly of your washer will be required, and tools like a screwdriver and socket wrench will be needed. This clutch is sold as an individual and does not come with any other parts.",
      "symptoms": [
        "Noisy and Marks Left on Clothes",
        "Spinning Issues",
        "Will not agitate"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS11729473-GE-WH05X24185-CLUTCH.htm?SourceCode=18"
    },
    {
      "title": "Washer ROD & SPRING Assembly LEFT - WHITE",
      "partSelectNumber": "PS12343381WH16X26911",
      "manufacturerPartNumber": "WH16X26911",
      "price": "13.42",
      "description": "This is a manufacturer-made suspension rod and spring assembly for your washing machine. This suspension rod is one of four suspension rods that make up the entirety of the inner suspension of your washing machine, and if worn out or damaged, must be replaced immediately. If you hear loud or excessive banging noises from your washing machine, this and/or other suspension rods within the washing machine are worn out. This specific suspension rod is the left assembly, so the parts for the other side of your washing machine will also be required when replacing this one, considering they all wear at a relatively similar rate. This suspension rod assembly is sold individually, so it does not come with any other suspension rods.",
      "symptoms": [
        "Shaking and Moving",
        "Spinning Issues"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS12343381-GE-WH16X26911-ROD-SPRING-Assembly-LEFT-WHITE.htm?SourceCode=18"
    },
    {
      "title": "Washer MODE SHIFTER",
      "partSelectNumber": "PS16554752WH03X30517",
      "manufacturerPartNumber": "WH03X30517",
      "price": "39.36",
      "description": "This is a mode shifter or shift actuator for models of washing machine. Mode shifters are designed to change the function of the washing machine motor, between spinning cycles and agitation, and is usually installed at the bottom of the washer. If your washing machine is not spinning or agitating during its washing cycle, or if it simply does not start, this shift actuator is likely bad and in need of replacing. This shift actuator is made mostly of plastic, and features two holes to secure it with screws, as well as a single wire harness that connects within your washing machine. This shifter is an OEM part and is sold individually.",
      "symptoms": [
        "Noisy and Marks Left on Clothes",
        "Spinning Issues",
        "Will not agitate"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS16554752-GE-WH03X30517-MODE-SHIFTER.htm?SourceCode=18"
    },
    {
      "title": "Washer ROD & SPRING Assembly RIGHT - GREEN",
      "partSelectNumber": "PS12343380WH16X26910",
      "manufacturerPartNumber": "WH16X26910",
      "price": "12.67",
      "description": "This rod and spring assembly is designed to fit with washing machines and is made by the original manufacturer of your washer. It is a part of the washer suspension system that helps to stabilize and support the drum. The rod is a cylindrical plastic component that connects the drum to the outer frame of the washing machine. The spring is made of metal and provides tension and elasticity. The assembly is designed to absorb shocks and vibrations while the washer is running to help prevent excessive movement. If the assembly is damaged or out of alignment, the washer will be unstable and noisy. This assembly is designed to fit on the right side of the washer.",
      "symptoms": [
        "Shaking and Moving",
        "Spinning Issues"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS12343380-GE-WH16X26910-ROD-SPRING-Assembly-RIGHT-GREEN.htm?SourceCode=18"
    },
    {
      "title": "Washer Drive Hub Kit",
      "partSelectNumber": "PS6012095W10528947",
      "manufacturerPartNumber": "W10528947",
      "price": "26.98",
      "description": "This drive hub kit (part number W10528947VP) is for washers. Drive hub kit W10528947VP connects the spin basket to the spin shaft that spins the basket. The kit may include multiple parts; refer to your parts diagram for a complete list of parts included. Unplug the washer before installing this part. Wear work gloves to protect your hands.",
      "symptoms": [
        "Shaking and Moving",
        "Spinning Issues",
        "Spins slowly"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS6012095-Whirlpool-W10528947-Drive-Hub-Kit.htm?SourceCode=18"
    },
    {
      "title": "Washer Agitator Repair Kit",
      "partSelectNumber": "PS334650285811",
      "manufacturerPartNumber": "285811",
      "price": "14.01",
      "description": "This kit (Medium Cam Agitator Repair Kit, Washer Agitator Cam Repair Kit, Cam Agitator) is used to repair the agitator. These parts are located inside the agitator auger near the top. You will need to remove the softener dispenser first if your model is equipped with one. This part is driven by the output shaft of the transmission to move the clothes during a wash cycle. The agitator auger rotates one way but not the other, which forces the laundry down and out for a constant tumbling during the wash cycle. The agitator is subjected to a lot of force during the washer wash cycle. Constant and frequent use of the appliance can cause damage, especially during heavy loads. If you’re experiencing a noisy agitator, or an agitator that spins freely in both directions, then it may be in need of repairs. If your agitator is no longer agitating properly, your clothes will not tumble, and will not be washed properly. The agitator repair kit includes an agitator cam, 4 directional cogs, a bearing, thrust spacer, inner cap seal, and a washer. It is constructed of plastic and rubber, and comes in black/white.",
      "symptoms": [
        "Does not dispense fabric softener or detergent",
        "Leaking",
        "Marks left on clothes"
      ],
      "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
      "detailUrl": "https://www.partselect.com/PS334650-Whirlpool-285811-Agitator-Repair-Kit.htm?SourceCode=18"
    }
  ]
}