{
  "title": "Jenn-Air Dishwasher Dish Rack Adjuster Kit - Left and Right Side",
  "partUrl": "https://www.partselect.com/PS10064063-Whirlpool-W10712394-Dishwasher-Dish-Rack-Adjuster-Kit-Left-and-Right-Side.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$46.62",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS10064063",
  "manufacturerPartNumber": "W10712394",
  "description": "Jenn-Air Dishwasher Dish Rack Adjuster Kit - Left and Right Side ★★★★★ ★★★★★ 1029 Reviews PartSelect Number PS10064063 Manufacturer Part Number W10712394 This rack adjuster kit (Dishrack Adjuster Kit, Adjuster Kit, Dishwasher Rack Adjuster) will adjust the height of the upper rack of your dishwasher. It connects to the dishrack. The kit is constructed of grey plastic and metal, and measures approximately 12 inches wide and 6.5 inches tall. The rack adjuster can break from material fatigue or prolonged high temperature exposure. High temperature exposure can compromise the integrity of the materials. If the rack adjuster breaks, your upper rack may fall down, may be unlevel, or the door may not close. This kit includes the parts to replace the left and right-side rack adjusters and has been upgraded to a more durable metal design (2 adjuster assemblies, 1 left hand and 1 right hand actuator cover, 2 gray adjuster covers, and 2 gray adjuster housings)",
  "rating": 4.6,
  "reviewCount": 1029,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Paul from Encinitas, CA",
    "title": "Replace rack adjusters - wheel were broken",
    "content": "Replacement was pretty easy after figuring out how to unsnap/unlock the old pieces.  Tools only used to do a little prying and poking, but really aren't needed.  Everything either snaps or slides together.  Piece of cake"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS10064063-Whirlpool-W10712394-Dishwasher-Dish-Rack-Adjuster-Kit-Left-and-Right-Side.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS10064063-Whirlpool-W10712394-Dishwasher-Dish-Rack-Adjuster-Kit-Left-and-Right-Side.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}