{
  "title": "Refrigerator Condenser Fans Blade Assembly",
  "partUrl": "https://www.partselect.com/PS1022410-GE-WR60X10207-Condenser-Fans-Blade-Assembly.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$17.87",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1022410",
  "manufacturerPartNumber": "WR60X10207",
  "description": "Refrigerator Condenser Fans Blade Assembly ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS1022410 Manufacturer Part Number WR60X10207 The condenser fan blade assembly helps to regulate the temperature in your refrigerator or freezer. This fan assembly has 4 blades, but other fans may have 3 blades, so be sure to check the number of blades on your fan. The fan blade is made of white plastic and is approximately 6 inches in diameter. If your freezer section is too warm, or you notice a strange noise coming from your refrigerator when it is running, you may need to replace the condenser fan blade assembly. This part is sold individually.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [
    "Freezer section too warm",
    "Fridge too warm",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Jeffrey from Tampa, FL",
    "title": "My refrigerator began to overheat and the everything was thawing!!",
    "content": "My refrigerator began to overheat and the everything was thawing!! The condenser fan motor had seized and I thought this is something even I can replace.I did a Google search on the refrigerator model number. The link to your site looked promising and I clicked on it. I was taken to your web page for my refrigerator and I clicked on the schematic for the condenser assembly.The schematic had the parts I needed labeled clearly so this layman could be sure to get the right ones.I ordered the parts at 12:45PM Monday and selected overnight shipping. The parts arrived at 8:35AM Tuesday (Thank you FedEx). I installed the parts and my refrigerator is up and running again.To get to the condenser fan motor I took off the back panel on the fridge that covers the condenser, fan and coil. The fan/motor assembly is attached to a bracket I removed with two screws. Pulled the bracket assembly out of the back of the fridge, removed the fan blade and then the motor, and put the new motor on the bracket and stuck the new fan blade on the motor spindle. The trickiest part was getting the complete assembly back in. Just went slowly and took my time. Reconnected the wires,  no problems. I took pictures of everything that I disassembled BEFORE I disassembled it in case I wasn't sure how something went back in but this job was so simple I didn't need the pictures.I’m not sure how I could improve on this except maybe you could ship a refrigerator technician, too, to do the install.Thank you PartSelect everything worked out better than I could have hoped and I saved $220.00 compared to what a repair service was quoting."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1022410-GE-WR60X10207-Condenser-Fans-Blade-Assembly.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1022410-GE-WR60X10207-Condenser-Fans-Blade-Assembly.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}