{
  "title": "Refrigerator Defrost Thermostat",
  "partUrl": "https://www.partselect.com/PS1017716-GE-WR50X10068-Defrost-Thermostat.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$29.24",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1017716",
  "manufacturerPartNumber": "WR50X10068",
  "description": "Refrigerator Defrost Thermostat ★★★★★ ★★★★★ 18 Reviews PartSelect Number PS1017716 Manufacturer Part Number WR50X10068 This defrost termination thermostat (Defrost Limiter Thermostat, High Limit Thermostat, Refrigerator Defrost Bi-Metal Thermostat) acts as a safety device to stop the evaporator coil from overheating, by turning off the defrost heater at the end of the defrost cycle. This part attaches to the tubing of the evaporator coil in the freezer. A faulty defrost termination thermostat may result in the defrost heater never heating and a solid frost buildup on the evaporator coil, which results in too warm temperatures. The thermostat contacts are normally closed and have continuity until it reaches 140 degrees. If this high limit thermostat is open at room temperature or colder, it is defective. This limit thermostat has an attached mounting clip and comes with pink and amber wire leads. The thermostat is 1 inch in diameter and 1/2 inch thick, the 2 wire leads are 10 inches long.",
  "rating": 4.5,
  "reviewCount": 18,
  "symptoms": [
    "Doesn’t stop running",
    "Freezer not defrosting",
    "Freezer section too warm"
  ],
  "installationInstructions": {
    "author": "Greg from Aledo, TX",
    "title": "Ice box and freezer would not get cold,the back wall of the freezer was covered with ice",
    "content": "1. I had to defrost the ice off of the back wall of the freezer with a blowdryer.2. Removed the four 1/4'' screws and removed the back panel.3. Defrosted all of the ice off the coils and heater.4. I replaced the defrost thermostat and heater by following the directions that came with them. The directions are very clear and easy to follow. I had a single element heater, and the replacement was a double element, the directions even explained how to rearrange the wires to make it work. The whole job only really consisted of cutting two wires that are color coded on the thermostat and resplicing the new ones in. I used scotch locks and electrical tape for the splices. The element had connectors on it so I just removed two screws, unplugged two wires and plugged them on the new one.The greatest thing about this repair was that I troubleshot the problem using the PartSelect website, ordered the parts and they arrived at my house in less than 24 hours.Thank You."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1017716-GE-WR50X10068-Defrost-Thermostat.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1017716-GE-WR50X10068-Defrost-Thermostat.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}