{
  "title": "Dishwasher Cycling Thermostat - L150-25F",
  "partUrl": "https://www.partselect.com/PS11757517-Whirlpool-WPY304474-Cycling-Thermostat-L150-25F.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$48.07",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11757517",
  "manufacturerPartNumber": "WPY304474",
  "description": "Dishwasher Cycling Thermostat - L150-25F PartSelect Number PS11757517 Manufacturer Part Number WPY304474 This thermostat controls the internal drying temperature. Cycling themostats continually cycle the heating element off and on to maintain a constant inner temperature. This particular cycling thermostat has a limit of 150 degrees Fahrenheit and a differential of 25 degrees. Meaning that with this thermostat, the heating element will cut out at 150 degrees and cycle back on once the internal temperature drops by 25 degrees.",
  "rating": 0,
  "reviewCount": 0,
  "symptoms": [
    "Too hot"
  ],
  "installationInstructions": {
    "author": "Waldon from MOSES LAKE, WA",
    "title": "the drum belt broke so the dryer is 30 years old & this is first problem so i replaced other parts also",
    "content": "took off front panel took off front drum cover, removed drum, replaced rear carrer rollers, drilled out pop rivets on front tub cover and replaced drum glides, replaced all three thermostats, replaced drum belt idler wheel,replaced motor drum belt, put front panel back on , pluged it back into power and it run like new. We purchased this Maytag set in 1987 new and this was the first time for any repairs of any kind, so while it was all apart I replaced other parts also, since it was 30 years old, maybe it will last another 30 years. \" I won't I am 83 years old \" you have to love maytag"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11757517-Whirlpool-WPY304474-Cycling-Thermostat-L150-25F.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11757517-Whirlpool-WPY304474-Cycling-Thermostat-L150-25F.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}