{
  "title": "Dishwasher Screen",
  "partUrl": "https://www.partselect.com/PS11755148-Whirlpool-WPW10463906-Screen.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$35.70",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11755148",
  "manufacturerPartNumber": "WPW10463906",
  "description": "Dishwasher Screen ★★★★★ ★★★★★ 6 Reviews PartSelect Number PS11755148 Manufacturer Part Number WPW10463906 This is a screen filter, designed to keep food particles, gunk, and debris from entering the pump of your dishwasher. If this filter is missing, damaged, or simply unusable, it will need to be replaced so you can effectively clean your dishes. Replacing this filter is simple, as you only need to twist and remove the lower filter, before you can carefully lift this filter out. This filter is an OEM part and is sold individually.",
  "rating": 4.83,
  "reviewCount": 6,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "Kathy from TECUMSEH, MO",
    "title": "My filters had completely clogged up with hard deposits and food left on the dishes after running the dishwasher.",
    "content": "My filters had completely clogged up and had not cleaned my filters at all which was a no-no.I had lots of food left on the dishes after running my dishwasher, so I took bothp filters out and replaced them no tools required.  I won’t be using powdered or liquid detergent for my dishwasher anymore only pods  and promise to clean my filters once a month, so hopefully that’ll help keep them clean. Very easy replacement even for an old woman."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11755148-Whirlpool-WPW10463906-Screen.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11755148-Whirlpool-WPW10463906-Screen.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}