{
  "title": "Amana Refrigerator Crisper Drawer With Handle",
  "partUrl": "https://www.partselect.com/PS11739122-Whirlpool-WP2188664-Refrigerator-Crisper-Drawer-With-Handle.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$53.89",
  "originalPrice": "$61.97",
  "inStock": true,
  "partSelectNumber": "PS11739122",
  "manufacturerPartNumber": "WP2188664",
  "description": "Amana Refrigerator Crisper Drawer With Handle ★★★★★ ★★★★★ 122 Reviews PartSelect Number PS11739122 Manufacturer Part Number WP2188664 This OEM, clear convertible meat drawer can be used to store meats or vegetables and is designed for the lower portion of your refrigerator, generally. It has its own cold air duct to allow cold air from the freezer to flow into the drawer. You could have a broken or faulty drawer if you find that the food is kept within is spoiling or drying out quickly. The drawer should slide open and closed with ease. If your drawer will not easily slide open or closed, check the tracks that the drawer slides on. If the tracks are not damaged, the drawer itself could be at fault and should be replaced. Inspect it for visible damage like cracking or warping, which should be obvious. This part measures approximately 16 7/16 inches wide x 14 5/16 inches deep x 7 5/8 inches high and is a genuine OEM replacement part. It is sold individually. Note that there are several different types and options for the lower vegetable and meat drawers for your refrigerator, and you should check your user manual carefully to ensure that this is the drawer you are looking for.",
  "rating": 4.8,
  "reviewCount": 122,
  "symptoms": [
    "Door won’t open or close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Betty from Orinda, CA",
    "title": "Previous owners of the condo took the two drawers from the refrigerator",
    "content": "No repair, just slid the drawers in their places.Since you had a diagram of the refrigerator parts, ordering the parts was easy and I was confident that the parts were the correct ones."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11739122-Whirlpool-WP2188664-Refrigerator-Crisper-Drawer-With-Handle.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11739122-Whirlpool-WP2188664-Refrigerator-Crisper-Drawer-With-Handle.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}