{
  "title": "Speed Queen Dishwasher Idler Pulley Wheel with Bearing",
  "partUrl": "https://www.partselect.com/PS11757553-Whirlpool-WPY54414-Idler-Pulley-Wheel-with-Bearing.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$22.26",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11757553",
  "manufacturerPartNumber": "WPY54414",
  "description": "Speed Queen Dishwasher Idler Pulley Wheel with Bearing ★★★★★ ★★★★★ 20 Reviews PartSelect Number PS11757553 Manufacturer Part Number WPY54414 The idler pulley wheel helps the belt to rotate the drum in your dryer. If your dryer will not start, will not tumble, or is noisy during operation, the idler pulley wheel may need to be replaced. This part is located beneath the drum of the dryer, so the drum will need to be removed before you can access the idler pulley wheel. It is also recommended to remove the blower housing and motor from the dryer itself, for easier access to the idler pulley wheel. It is connected by a set of two 5/16 screws. This two-inch-wide idler pulley wheel is beige or black in color and is made of plastic. This pulley wheel comes with its own metallic bearing in its center. Be sure to shut off power to the dryer before beginning this repair.",
  "rating": 4.65,
  "reviewCount": 20,
  "symptoms": [
    "Drum Not Spinning",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "William from Round Mountain, NV",
    "title": "Squeeling/Screeching",
    "content": "First I read all of the other stories about this problem so I would have the correct parts. At $6 a roller, decided to get all 3 & a belt. Pulled the lower panel off (2 bolts), then the door (2 bolts). Marked the door switch wires. Took 2 bolts out of the top & tilted it back. I found this the easiest way to access the drum. Mark 2 wires before disconnecting them from the top.  All bolts are 5/16\". Removed the plastic piece that connects the lint trap to the blower (3 screws). Have to access these from inside the drum. Removed the belt, then the drum. The bad roller was the belt tension roller. Can't get to the snap ring from the front of the dryer for this roller. The 2 rollers in the back you can get to without removing the drum completely. Very easy to replace all rollers with the drum out. Also very easy to re-assemble. Buy or borrow a good set of snap ring pliers. Make sure you diagram the proper belt route if you don't have a picture. I printed a picture off this web site. Have someone hold the drum up so you can get the belt on, otherwise the entire repair is a 1 person job. Went back together in about 10 minutes. Total cost $40.00 parts & shipping."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11757553-Whirlpool-WPY54414-Idler-Pulley-Wheel-with-Bearing.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11757553-Whirlpool-WPY54414-Idler-Pulley-Wheel-with-Bearing.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}