{
  "title": "Caloric Dishwasher Hose Clamp",
  "partUrl": "https://www.partselect.com/PS11740613-Whirlpool-WP285655-Hose-Clamp.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$11.09",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11740613",
  "manufacturerPartNumber": "WP285655",
  "description": "Caloric Dishwasher Hose Clamp ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS11740613 Manufacturer Part Number WP285655 The hose clamp is used to hold the water hose in place which will prevent the hose from leaking water. Sometimes the clamp may lose its ability to latch on, causing a leaking washer. For the installation, you will need a flat head screw driver to replace the clamp and a drill to access the screws to remove the front of the washer. Be careful if you do not have specific clamp pliers as the clamp could fly off. Once the front of the washer has been removed, take a quick look for water damage or any obvious signs of where the leak is coming from. If it is not obvious, run water to test.",
  "rating": 3,
  "reviewCount": 2,
  "symptoms": [
    "Leaking",
    "Will not drain"
  ],
  "installationInstructions": {
    "author": "Stephen from Laveen, AZ",
    "title": "Drive Pump Leaked",
    "content": "It took some trial and error but overall not a difficult project.   1.  Take the front covers off.    2.  Undo the pully spring to loosen belt 3.  Remove belt off idler pulley wheel and free up belt from the large wheel.  4.  Disconect the wiring harness and the hoses.  5.  Undo the motor mounting bolts (4) 6.  Take motor out of washer and remove the 3 screws holding the pump to the motor.  7.  The pump had melted to the shaft and required I chisel the pump off of the shaft.  8.   Attach new pump paying attention to where the belt is positioned.  9.  Reattach the motor bolts, hoses, and wiring harnes.  10.  Attach the belt and test the pump.  11.  Put the front back on."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11740613-Whirlpool-WP285655-Hose-Clamp.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11740613-Whirlpool-WP285655-Hose-Clamp.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}