{
  "title": "Caloric Dishwasher Faucet Adapter",
  "partUrl": "https://www.partselect.com/PS11751238-Whirlpool-WPW10254672-Faucet-Adapter.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$54.41",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11751238",
  "manufacturerPartNumber": "WPW10254672",
  "description": "Caloric Dishwasher Faucet Adapter ★★★★★ ★★★★★ 22 Reviews PartSelect Number PS11751238 Manufacturer Part Number WPW10254672 The faucet adapter for your portable dishwasher or washing machine attaches to the faucet and allows you to connect the machine to the tap. Before you install the faucet adapter on your taps, be sure that it fits the coupler on your dishwasher or washer. As per the factory, this is used for faucets with inside or outside threads. For female connection (outside) just remove the washers. This adapter is approximately 1 inch in length, and slightly less than one inch in diameter. This adapter comes with two different thicknesses of rubber washer. You will not need to use both so be sure to determine which thickness works best for your tap before installing it.",
  "rating": 4.68,
  "reviewCount": 22,
  "symptoms": [
    "Leaking",
    "Will not fill with water"
  ],
  "installationInstructions": {
    "author": "Stephen from Enfield, CT",
    "title": "faucet attachment would not sit correctly in hose connector to portable dishwasher. Received machine second hand. Could not find a replacement faucet adapter. So ordered new one and hose plus connector.",
    "content": "Turned machine on side. Removed two casters with Wonder Tool prybar. Then used it to remove plastic push screws holding cardboard bottom cover.  Unscrewed water hose. Used screwdriver to remove clamp on drain hose. Stood machine upright, opened door. Unscrewed two screwsfrom tabs into woodblock top. Slid top forward and removed it.  Cut plastic hose retainer.  Removed hose assembly.  Installed new hose by reversing steps. Used a new wire strap to hold hoses in place on top corner of machine."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11751238-Whirlpool-WPW10254672-Faucet-Adapter.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11751238-Whirlpool-WPW10254672-Faucet-Adapter.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}