{
  "title": "Gaggenau Refrigerator Evaporator Fan Blade",
  "partUrl": "https://www.partselect.com/PS11738973-Whirlpool-WP2169142-Evaporator-Fan-Blade.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$37.10",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11738973",
  "manufacturerPartNumber": "WP2169142",
  "description": "Gaggenau Refrigerator Evaporator Fan Blade ★★★★★ ★★★★★ 4 Reviews PartSelect Number PS11738973 Manufacturer Part Number WP2169142 If your refrigerator or freezer is too warm, or making noises, you may need to replace the fan blade. The fan blade attaches to the evaporator motor, which is in the freezer section, to help circulate the cold air into the refrigerator and freezer sections. The fan blade is white in color and made from plastic. This is a genuine OEM part. Please be sure to disconnect the power to your refrigerator before starting your repair.",
  "rating": 3,
  "reviewCount": 4,
  "symptoms": [
    "Clicking sound",
    "Freezer section too warm",
    "Fridge too warm"
  ],
  "installationInstructions": {
    "author": "CYNTHIA from ALPHARETTA, GA",
    "title": "Noisy Evaporator Motor/Fan",
    "content": "Our 48\" Built-In KitchenAid Frig (1999 model)started getting very noisy about 3 years ago.  Two different repairmen plus KitchenAid said 'that was the way it was'. I figured out the noise was coming from the evaporator motor/fan but the repairmen said it was just because moisture was freezing on it and replacing the evaporator motor/fan probably would not make a difference plus it would be very expensive. When I discovered PartSelect and that I could order the parts (about $80) myself I thought why not.  It was simple to replace.  Removed cover inside freezer compartment - detached bracket and electrical wires - replaced with new motor and fan.  Now you can hardly hear the frig running and it runs half the time - more efficient.  I can't believe we lived with that noise for so long.  Thanks to PartSelect I proved KitchenAid and the repaiirmen wrong and did it myself!  Thank you PartSelect!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11738973-Whirlpool-WP2169142-Evaporator-Fan-Blade.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11738973-Whirlpool-WP2169142-Evaporator-Fan-Blade.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}