{
  "title": "Refrigerator Water Inlet Valve",
  "partUrl": "https://www.partselect.com/PS11738056-Whirlpool-W10865826-Water-Inlet-Valve.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$72.40",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11738056",
  "manufacturerPartNumber": "W10865826",
  "description": "Refrigerator Water Inlet Valve ★★★★★ ★★★★★ 13 Reviews PartSelect Number PS11738056 Manufacturer Part Number W10865826 This OEM, 120V, 60 HZ water inlet valve is specially designed for refrigerators. It is responsible for regulating the flow of water into the water dispenser and ice maker of the fridge. If your refrigerator is leaking or it is unable to dispense water, the water inlet valve may be damaged or experiencing electrical failure. It will need to be replaced to restore the functionality of the appliance. You can find the valve at the back of the refrigerator where it is connected to the water supply line.",
  "rating": 4.85,
  "reviewCount": 13,
  "symptoms": [
    "Ice maker not making ice",
    "Leaking",
    "Not dispensing water"
  ],
  "installationInstructions": {
    "author": "Mario from Rockledge, FL",
    "title": "Water on the floor, fridge leak",
    "content": "Back cover was wet in the area of the inlet valve(sign).   Water on the floor.   90% of the time is a leaking inlet valve.  But it could be frozen water on the drain pan- so I exposed the radiator fins and drain pan and looked. No ice so I went to the valve and opened the copper line valve and waited a few minutes- as soon as water was called by the. Ice maker it leaked.  So I went ahead and replaced the valve and after I made sure no leaks were visible I replaced the back cover and continued to observe and all was good.  I treated the fridge as a new installation, changed filter and dumped the next two ice buckets.   Then I proceeded to demand brownie points."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11738056-Whirlpool-W10865826-Water-Inlet-Valve.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11738056-Whirlpool-W10865826-Water-Inlet-Valve.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}