{
  "title": "Dacor Refrigerator Pantry Drawer Door Cover",
  "partUrl": "https://www.partselect.com/PS11723190-Whirlpool-W10827015-Refrigerator-Pantry-Drawer-Door-Cover.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$109.89",
  "originalPrice": "$137.36",
  "inStock": true,
  "partSelectNumber": "PS11723190",
  "manufacturerPartNumber": "W10827015",
  "description": "Dacor Refrigerator Pantry Drawer Door Cover ★★★★★ ★★★★★ 81 Reviews PartSelect Number PS11723190 Manufacturer Part Number W10827015 This pantry drawer lid is also known as a pantry drawer door or pantry drawer cover. This is a genuine OEM part, and is sold individually. This part helps keep everything inside the drawer. It acts as a cover, and also keeps your drawer at the proper temperature by creating a seal. You may need to replace this part if door does not open or close, or if the drawer is too cold. No tools are required for this replacement, simply push the hinge pins aside to remove the old lid. Consider checking the pantry end cap kit for damage before ordering the pantry drawer lid, as they are often purchased together.",
  "rating": 4.68,
  "reviewCount": 81,
  "symptoms": [
    "Door won’t open or close",
    "Fridge too cold"
  ],
  "installationInstructions": {
    "author": "Chauncey from Menan, ID",
    "title": "Started with a grinding noise in the bottom of the dishwasher,  and then the thing just stopped cleaning the dishes.  It wasn't pumping any water,",
    "content": "I removed the plasic inner parts, used the torx drivers to remove the internal platic plate that covered the sump.   Found the food chopper cover and removed it.  It had gotten a piece of plastiic wrapped around it.  As it spun it had ground the teeth off the end of the drive on the impellor and the food chopper.  I replace both as a set and it works fine."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11723190-Whirlpool-W10827015-Refrigerator-Pantry-Drawer-Door-Cover.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11723190-Whirlpool-W10827015-Refrigerator-Pantry-Drawer-Door-Cover.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}