{
  "title": "Dacor Refrigerator EveryDrop Water Filter",
  "partUrl": "https://www.partselect.com/PS11722132-Whirlpool-EDR5RXD1-EveryDrop-Water-Filter.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$85.14",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11722132",
  "manufacturerPartNumber": "EDR5RXD1",
  "description": "Dacor Refrigerator EveryDrop Water Filter ★★★★★ ★★★★★ 48 Reviews PartSelect Number PS11722132 Manufacturer Part Number EDR5RXD1 This EveryDrop Filter5 is certified to reduce the most contaminants with Triple Filtration Technology. Now, you and your family can enjoy the enriching benefits of cleaner, freshly filtered ice & water. Not just in beverages, but for preparing meals, too. This advanced generation of ice and water refrigerator filters from EveryDrop Filters are certified to reduce more contaminants with Triple Filtration Technology. Filter 5 reduces 16 contaminants, so you can feel reassured that you and your family are getting the most out of your water. Remember to replace your refrigerator filter every 6 months to maximize contaminant reduction.",
  "rating": 4.35,
  "reviewCount": 48,
  "symptoms": [
    "Ice maker dispenses too little ice",
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "Jeff from Midway, GA",
    "title": "Front wheel was broken when moving refrigerator",
    "content": "Lifted the front up onto a scrap 2x4 to get it off the ground and it had 1 bolt that you removed to get the old item off and replace with new assymbly and 1 bolt to re attach. This sat broke for over a year becuase I thought it would be alot harder to fix, found the part on parts select ordered it recieved it in approx 2 days and had it fixed in less than 15 minutes. I would recommend parts select to anyone who told me that they had a appliance broken.Thanks"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11722132-Whirlpool-EDR5RXD1-EveryDrop-Water-Filter.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11722132-Whirlpool-EDR5RXD1-EveryDrop-Water-Filter.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}