{
  "title": "Thermador Refrigerator Control Bracket",
  "partUrl": "https://www.partselect.com/PS11739027-Whirlpool-WP2180226-Control-Bracket.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$19.41",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11739027",
  "manufacturerPartNumber": "WP2180226",
  "description": "Thermador Refrigerator Control Bracket ★★★★★ ★★★★★ 117 Reviews PartSelect Number PS11739027 Manufacturer Part Number WP2180226 This is a control bracket for your refrigerator, and may also be known as the dispenser control bracket. The function of this part is to hold the micro switches and the light socket in the freezer dispenser section in place. Its measurements are roughly 9 inches long and 5 inches high, and this model comes in white. The tools you will need in order to do this repair include a Phillips screw driver, a quarter-inch nut-driver, and a pair of needle-nose pliers. If your ice dispenser is not working properly, your bracket could be the problem.",
  "rating": 4.88,
  "reviewCount": 117,
  "symptoms": [
    "Ice maker not making ice",
    "Ice maker won’t dispense ice",
    "Not dispensing water"
  ],
  "installationInstructions": {
    "author": "BILL from BATESVILLE, MS",
    "title": "Front Door Ice Wouldn't Work And Air Going Into Freezer",
    "content": "Thanks to the pictorial diagram, I was able to order correct parts.  It was just a matter of removal of broken parts and replacing them.  Ice maker now working and air is no longer getting into freezer which was freezing up ice maker.  Thanks for timely delivery, now I am able to use ice dispenser, which I haven't used for long time.  Thanks"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11739027-Whirlpool-WP2180226-Control-Bracket.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11739027-Whirlpool-WP2180226-Control-Bracket.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}