{
  "title": "Dacor Refrigerator Ice Maker Assembly",
  "partUrl": "https://www.partselect.com/PS11765620-Whirlpool-W10884390-Refrigerator-Ice-Maker-Assembly.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$90.94",
  "originalPrice": "$113.68",
  "inStock": true,
  "partSelectNumber": "PS11765620",
  "manufacturerPartNumber": "W10884390",
  "description": "Dacor Refrigerator Ice Maker Assembly ★★★★★ ★★★★★ 67 Reviews PartSelect Number PS11765620 Manufacturer Part Number W10884390 This is an ice maker assembly for various models of refrigerator. This ice maker assembly is used to freeze and eject ice into the ice bucket, then dispense the ice. This ice maker comes with the necessary shut-off arm, as well as a wire harness to properly install it into the freezer compartment of your refrigerator. If your current ice maker is either not producing ice or not breaking the ice up properly, it will need to be replaced. This ice maker assembly is an OEM part and is sold on its own, without any other parts or accessories.",
  "rating": 4.7,
  "reviewCount": 67,
  "symptoms": [
    "Ice maker dispenses too much ice",
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "Raymond from NORTH VENICE, FL",
    "title": "Ice maker did not work in the bottom freezer",
    "content": "Shut down refrigerator at the breaker.  Placed freezer items in a cooler.   Removed top shelf. You must release roller covers on each side to remove the shelf ( Two front screws must be removed)  Took off freezer door. (4 screws holding the door to the bracket)  Disconnected ice maker electronic plug.  Totally removed bottom screw holding ice maker.  Loosen two top screws and remove ice maker.  Reverse process to install."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11765620-Whirlpool-W10884390-Refrigerator-Ice-Maker-Assembly.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11765620-Whirlpool-W10884390-Refrigerator-Ice-Maker-Assembly.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}