{
  "title": "Refrigerator Light Board Assembly",
  "partUrl": "https://www.partselect.com/PS11767930-GE-WR55X26671-Light-Board-Assembly.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$87.04",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11767930",
  "manufacturerPartNumber": "WR55X26671",
  "description": "Refrigerator Light Board Assembly ★★★★★ ★★★★★ 16 Reviews PartSelect Number PS11767930 Manufacturer Part Number WR55X26671 This is a LED light board assembly, used within refrigerators to shine light on the contents and food items within. If the light panel in your fridge is significantly dimmed or dead, it needs to be replaced immediately. To replace this light board, simply gain access to it within your fridge, disconnect and remove the wire harness from it, and slide it off its securing posts, and then place the new one in. This OEM LED light board is sold individually, so depending on how many light boards are out in your fridge, consider that before ordering.",
  "rating": 4.75,
  "reviewCount": 16,
  "symptoms": [
    "Light not working"
  ],
  "installationInstructions": {
    "author": "Gordon from JACKSONVILLE, FL",
    "title": "Freezer light(s) were not coming on when freezer door was open",
    "content": "The PS11767930 BOARD LED LIGHT Assembly was an exact match to the one that had gone bad.  First, I removed the shelf above the light cover and items on it.  Next, remove the top 1/2 in phillips head screw holding the light cover in place.  Next, pop off the light cover(2 slots on each side and 2 on back freezer wall.  Next I popped off the plastic snap on holder at the end of the wires that contained the board LED lights.  Then remove the wire plastic connection by holding it with needle nose pliers and a small screwdriver to lift up the plastic snap in connector.  Take the new board and attach it just like you removed the old one.  Let there be light!  And so it was."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11767930-GE-WR55X26671-Light-Board-Assembly.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11767930-GE-WR55X26671-Light-Board-Assembly.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}