{
  "title": "Amana Dishwasher Door Handle And Latch Assembly with Switch",
  "partUrl": "https://www.partselect.com/PS11748729-Whirlpool-WPW10130695-Dishwasher-Door-Handle-And-Latch-Assembly-with-Switch.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$30.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11748729",
  "manufacturerPartNumber": "WPW10130695",
  "description": "Amana Dishwasher Door Handle And Latch Assembly with Switch ★★★★★ ★★★★★ 683 Reviews PartSelect Number PS11748729 Manufacturer Part Number WPW10130695 This door latch (Dishwasher Door Latch Assembly, Door Latch Assembly, Latch Assembly) is a simple on/off mechanism that prohibits the dishwasher from operating when the door is open. It is located on the door of your dishwasher, and is mounted on the inner door panel. The door latch can break from material fatigue. If the door is often slammed or opened quickly, the latch may break prematurely. If the door won't open or the door switches won't activate, you will need to replace this part. This latch measures 5 1/2 inches wide, 4 1/2 inches high, 2 1/2 inches deep, is constructed out of plastic and comes in black. The kit includes the black handle, latch, and 2 switches.",
  "rating": 4.79,
  "reviewCount": 683,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Walter from Tucson, AZ",
    "title": "Broken latch handle",
    "content": "The hardest thing was figuring out that you only need to purchase the latch handle because it only comes as a complete latch assembly, why they even list the latch assembly as a separate part in the parts list stupid. (you get the handle and latch already put together and it cost less than the latch assembly without the handle). Anyway all you need to do is disconect the power from the dishwasher (unless you like to live dangerously like me) take your drill with the correct size torx bit and remove all the screws on the inside door pannel (the top center two screws actually hold the latch assembly in place). Disconect the 4 wires from the old part and reconect them to the new part and reinstall all the torx screws being careful not to strip the plastic threads that they screw into if you are using a drill. Whole process takes less than 5 minutes. I am surprised that Maytag used such a flimsy handle assembly in their dishwashers since they are supposed to have the repair men with the most time on their hands. They probably sell just as many handle assemblies as they do dishwashers that have this particular part in it, probably more since you will probably have to change it 2 or 3 times during the life of the unit."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11748729-Whirlpool-WPW10130695-Dishwasher-Door-Handle-And-Latch-Assembly-with-Switch.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11748729-Whirlpool-WPW10130695-Dishwasher-Door-Handle-And-Latch-Assembly-with-Switch.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}