{
  "title": "Gaggenau Refrigerator Pantry End Cap - Left Side",
  "partUrl": "https://www.partselect.com/PS11738573-Whirlpool-WP12656105-Pantry-End-Cap-Left-Side.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$38.39",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11738573",
  "manufacturerPartNumber": "WP12656105",
  "description": "Gaggenau Refrigerator Pantry End Cap - Left Side ★★★★★ ★★★★★ 88 Reviews PartSelect Number PS11738573 Manufacturer Part Number WP12656105 The pantry end cap is also known as a drawer support or a door shelf trim. This specific piece is sold individually and is meant for the left side of your refrigerator. It snaps into place on the door of your fridge, which allows it to hold items on the door shelf. To change the left side end cap on your refrigerator you will need a 1/4 inch nut driver. Users have ranked this installation as easy to do, with a less than thirty minute repair time.",
  "rating": 4.92,
  "reviewCount": 88,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Gregory from Bethesda, MD",
    "title": "Broken pins holding pantry door",
    "content": "Removed door and crisper pans.Removed nuts on left end cap - think there were 3.Removed nuts on right end cap and one or two on back air regulator attached to right end cap.Replaced left end cap with new one using reserved nuts.Carefully removed back air regulator from right end cap.  Attached back air regulator to new right end cap.Replaced right end cap and back air regulator and attached with nuts. Carefully inserted pantry door into pin on one side and slightly bent both right and left pins to insert door fully into end caps.  Replaced crisper pans.That's it."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11738573-Whirlpool-WP12656105-Pantry-End-Cap-Left-Side.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11738573-Whirlpool-WP12656105-Pantry-End-Cap-Left-Side.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}