{
  "title": "Refrigerator LED Light Control Board",
  "partUrl": "https://www.partselect.com/PS11755867-Whirlpool-WPW10515058-LED-Light-Control-Board.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$183.50",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11755867",
  "manufacturerPartNumber": "WPW10515058",
  "description": "Refrigerator LED Light Control Board ★★★★★ ★★★★★ 15 Reviews PartSelect Number PS11755867 Manufacturer Part Number WPW10515058 This 2-plug LED light control board is a genuine OEM replacement part designed for refrigerators. It fits into the fresh food section of the refrigerator. The LED light helps users easily see the contents of the fridge, even in low-light conditions. LED lights are a popular choice due to their energy efficiency, longer lifespan, and ability to produce bright and consistent lighting. Compared to traditional incandescent or fluorescent lights, LED lights consume less energy, generate less heat, and have a much longer operational lifespan, making them a preferred choice-",
  "rating": 4.4,
  "reviewCount": 15,
  "symptoms": [
    "Light not working"
  ],
  "installationInstructions": {
    "author": "Edward from UNIVERSITY PL, WA",
    "title": "Central light board flashed periodically then quit",
    "content": "I began by replacing the central light board by using a plastic non-marring wedge type tool slipping it between the housing and the retainers to release the latch like catch.  Then I removed the lightboard and light cover assembly by depressing the latch like retainers for the two wire connectors. Installation was as simple as snapping the wires into the connectors and then pushing the lightboard and light cover assembly into place.  One major note:  I learned from a repairman that you cannot resolve the problem by simply replacing the central lightboard.  you must replace all three lightboards, the two in the refrigerator and the one in the freezer because unless you can absolutely identify which board is causing the fault, it will continue to cause a problem on the main board and the lights will not work. Replacing the other two boards is the same as   the central board.  Additional comment to consider: I absolutely fail top see how this design of using three circuit boards for a simple light saves me anything; in fact after only 5 years it has cost me in excess of $400 (or 20% of the original cost of the unit) just in materials for a simple light--absurd, ridiculous design.  If it burns out again I will have an appliance repairman install a simple 1950's design switch a small LED bulb which will probably last longer than the unit."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11755867-Whirlpool-WPW10515058-LED-Light-Control-Board.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11755867-Whirlpool-WPW10515058-LED-Light-Control-Board.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}