{
  "title": "Dishwasher Air Inlet",
  "partUrl": "https://www.partselect.com/PS11745487-Whirlpool-WP8268937-Air-Inlet.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$47.56",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11745487",
  "manufacturerPartNumber": "WP8268937",
  "description": "Dishwasher Air Inlet ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS11745487 Manufacturer Part Number WP8268937 This part is located at the bottom of the door. It helps to circulate air during the drying process.",
  "rating": 3.5,
  "reviewCount": 2,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Carl from North Haven, CT",
    "title": "Leakage along bottom of door panel during wash/rinse",
    "content": "The air inlet strip has a flap and two smaller side flaps that seal the bottom of the inner door to the bottom pan that hold the water.  The flaps don't form a watertight seal as they only serve to prevent the water surging during wash and rinse cycles from splashing out of the bottom pan onto the floor under the door.  What I learned after dismantling the door is that the problem I was having with water dripping from the bottom of the bottom of the outer door was being caused by a loose upper round louvered vent and not he lower vent strip.  If the lower vent strip were the problem, water would leak from the front lip of the bottom pan, which is located well behind the face of the front door panel.Here's my recommendation on the lower vent srtip repair.  Turn off the power to the unit at you breaker panel.  The air inlet strip is fastened to the backside of the inner stainleess steel door panel.  To access the screws the outer door panel must be removed.  Open the door and remove the six torx head screws that fasten the outer door panel to the stainless steel inner door.  Don't remove the two torx screws top dead center as they hold the door latch.  After removing the screws, raise the door up to the nearly closed position.  Lift up the outer door panel handle and door bottom to disengage the outer panel from the inner stainless door.  The next part is a little tricky since the vent strip hex head screws are at he bottom of the stainless door panel, facing out with the door closed.  The lip of the bottom stainless pan is high enough to make it a tight fit to access the screws.  There is also a steel bracket that is a door stiffener and holds electrical wiring.  I found removing the bracket held by a 1/4\" hex head screw on each side made access to the vent strip scews easier.  Lay flat on the floor.  With a 3/16\" nutdriver or socket wrench each of the five vent strip screws can be removed.  It's a tight fit between the bottom lip and door bottom, but it can be done.  Remove the old vent strip and attach the new one.  Make sure it fits snugly into the slot.  Best to have an extra pair of hands at this point to hold the stip securely in place while screws are reinserted from the opposite side.  Reassemble everything in reverse order.It was when I had the outer door panel off that I noticed my problem was water getting past the upper round louver vent seal and thus running down the inside of the outer panel.  Simple fix was to remove and clean the scale residue from the parts and door.  Then reassemble the vent and twitst tighten the vent to compress the rubber seal on the inside face of the door."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11745487-Whirlpool-WP8268937-Air-Inlet.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11745487-Whirlpool-WP8268937-Air-Inlet.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}