{
  "title": "Refrigerator Relay and Overload Combination",
  "partUrl": "https://www.partselect.com/PS11749877-Whirlpool-WPW10189190-Relay-and-Overload-Combination.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$105.26",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11749877",
  "manufacturerPartNumber": "WPW10189190",
  "description": "Refrigerator Relay and Overload Combination ★★★★★ ★★★★★ 8 Reviews PartSelect Number PS11749877 Manufacturer Part Number WPW10189190 This part is both the start relay and the overload. The start relay boosts the compressor, and then shuts off as soon as the motor gets up to speed and the overload provides extra protection against excessive temperatures.",
  "rating": 4.5,
  "reviewCount": 8,
  "symptoms": [
    "Clicking sound",
    "Freezer section too warm",
    "Fridge and Freezer are too warm"
  ],
  "installationInstructions": {
    "author": "Anna from Lincoln, RI",
    "title": "Our Refrigerator and freezer stopped working",
    "content": "I had read on a fix it site that the start device for the compressor on this particular model was known to fail after 3-5 years.  When we received the part it looked like something that just plugged into the compressor.  My husband unscrewed the panel in the back of the fridge and saw the part on the compressor.  He first removed the three  wires that it was connected to, and the wires were inside a plug so all he had to do was remove the plug from the start device.  He then removed the old start device from the compressor.  Plugged in the wire plug into the new start device, and pushed in the new start device into the compressor.  There was also another black part plugged into the old start device that he plugged inot the new start device that connected to the compressor.  Our freezer and refrigerator starting working.  Within a couple of hours our freezer had made ice."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11749877-Whirlpool-WPW10189190-Relay-and-Overload-Combination.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11749877-Whirlpool-WPW10189190-Relay-and-Overload-Combination.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}