{
  "title": "Estate Dishwasher Drain Pump",
  "partUrl": "https://www.partselect.com/PS11753379-Whirlpool-WPW10348269-Dishwasher-Drain-Pump.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$64.05",
  "originalPrice": "$80.06",
  "inStock": true,
  "partSelectNumber": "PS11753379",
  "manufacturerPartNumber": "WPW10348269",
  "description": "Estate Dishwasher Drain Pump ★★★★★ ★★★★★ 57 Reviews PartSelect Number PS11753379 Manufacturer Part Number WPW10348269 This drain pump is used in dishwashers to remove water from the dishwasher tub. If the impeller in the dishwasher is damaged or the motor has been shorted out and will not drain, it is possible the body is cracked, causing leakage. To prevent this from happening, replace the drain pump. The tools needed for this installation are: Phillips screwdriver, 5/16 inch nut driver, 5/8 inch wrench, and a flathead screwdriver. Remember to unplug your dishwasher from the power source before beginning this installation project. Refer to the manual provided by the manufacturer for further installation instructions.",
  "rating": 4.81,
  "reviewCount": 57,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Andrew from Alexandria, VA",
    "title": "dishwasher not draining after wash cycle",
    "content": "Caviat: The actual repair is less than 15 minutes, but I spent a lot of time playing with it before I figured out it was that easy and fast. You don't need to remove the dishwasher from the counter to do this. And it will probably help to look at the new part closely so you can understand where the retainer clip is to press it and release the old pump.First remove the water from the dishwasher pan that would not drain with a wet/dry vac. Otherwise the water will all drain on the floor when you remove the pump. Then remove the two screws on the kickplate on the front of the unit below the door. Remove the kickplate/maintainence access cover. The drain pump is on the right about 8 inches in. Using two hands you grasp the drain pump with your right hand and use the left hand to push the retaining clip down. Then the drain pump will rotate 1/4 turn counterclockwise and can be removed without pulling the dishwasher out. There is likely to be some water leak out that was traped in the pump housing that you can not reach with the vac. Disconnect the wire. Connect the wire to the new pump, put it in place and 1/4 turn clockwise to install it. Replace the kickplate and you're done."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11753379-Whirlpool-WPW10348269-Dishwasher-Drain-Pump.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11753379-Whirlpool-WPW10348269-Dishwasher-Drain-Pump.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}