{
  "title": "Estate Refrigerator Door Cam - Black",
  "partUrl": "https://www.partselect.com/PS11752991-Whirlpool-WPW10329686-Door-Cam-Black.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$9.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11752991",
  "manufacturerPartNumber": "WPW10329686",
  "description": "Estate Refrigerator Door Cam - Black ★★★★★ ★★★★★ 64 Reviews PartSelect Number PS11752991 Manufacturer Part Number WPW10329686 The Door Cam is a black plastic part which helps the door pivot shut while keeping the door and hinge in proper alignment. Lubricating this part upon installation may help it move easier. It attaches onto the door hinge and should be replaced if broken or if there is noticeable damage. Refer to your model number and user manual to ensure this is the correct part for you. To do this repair you will need a 5/6 nut driver, a 5/16 socket, and a ratchet. For safety purposes, do not forget to turn off your appliance before making this repair. Note that this piece is black, and as per the manufacturer requires a new screw to mount the door cam which is sold individually. Please also note that this is the closing cam for the lower door, and the upper door cam is sold as a separate kit.",
  "rating": 4.69,
  "reviewCount": 64,
  "symptoms": [
    "Clicking sound",
    "Door Sweating",
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Norbert from Sugar Land, TX",
    "title": "Refigerator door was not closing all the way if not pushed shut.",
    "content": "Remove the top hinge cover.  Removed the top hinge support.   Lifted the door from the bottom support.  Old door cams were worn completly flat.  Replaced the lower door cam and closing cam use a little vasalene for lubricant on the cam surfaces.  Placed the door back on the lower hinge support.  Replaced the top hinge support.  Door is closing great now.  Thanks for the quick part deliver."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11752991-Whirlpool-WPW10329686-Door-Cam-Black.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11752991-Whirlpool-WPW10329686-Door-Cam-Black.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}