{
  "title": "Gaggenau Refrigerator Crisper Drawer",
  "partUrl": "https://www.partselect.com/PS11743502-Whirlpool-WP67002659-Crisper-Drawer.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$90.89",
  "originalPrice": "$113.61",
  "inStock": true,
  "partSelectNumber": "PS11743502",
  "manufacturerPartNumber": "WP67002659",
  "description": "Gaggenau Refrigerator Crisper Drawer ★★★★★ ★★★★★ 83 Reviews PartSelect Number PS11743502 Manufacturer Part Number WP67002659 The crisper drawer in your refrigerator is used for storing various items. If you notice that your current crisper drawer is damaged, you may need to replace it. You may notice that your refrigerator door does not open or close properly, which is a sign that your cripser drawer is damaged. This crisper drawer is made of clear plastic and is roughly 20 inches in length. This part is sold individually and does not come with the plastic faceplate on it. If your current crisper has one, you will need to remove it and transfer it to the new crisper. NOTE: As per the manufacture the crisper drawer has been updated from the original. A new crisper cover may need to be purchased for the drawers to work. Factory dimensions - 12.847\" Depth X 15.217\" Width X 6.93 High.",
  "rating": 4.84,
  "reviewCount": 83,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Roland from Alexandria, VA",
    "title": "The crisper drawers had cracked runners",
    "content": "Crisper drawers:1. Removed crisper drawers from refrigerator.2. Removed drawer front decoration panels.3. Unpacked, inspected and rinsed out new drawers.4. Attached drawer front decoration panels.5. Transfered vegetables and fruit from old drawers to new drawers.6. Installed new drawers in refrigerator.7. Closed refrigerator door.8. Total time about 15 minutes, no tools required.Ice & Water filter1. Opened filter compartment cover2. Removed old filter, drained into sink and placed in the trash.3. Installed new filter4. Bled the water line with ice water tap button (be aware when the air in the line exits the spigot, it create a lot of spray and you may need to cleanup the water that splash out of the bottom of the container used to capture the water during the bleeding process.)5. Close the filter cover and refrigerator door.6. Total time about 10 minutes and no tools required."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11743502-Whirlpool-WP67002659-Crisper-Drawer.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11743502-Whirlpool-WP67002659-Crisper-Drawer.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}