{
  "title": "Refrigerator Kickplate Grille - Apollo Gray",
  "partUrl": "https://www.partselect.com/PS11756053-Whirlpool-WPW10534155-Kickplate-Grille-Apollo-Gray.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$79.99",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11756053",
  "manufacturerPartNumber": "WPW10534155",
  "description": "Refrigerator Kickplate Grille - Apollo Gray ★★★★★ ★★★★★ 21 Reviews PartSelect Number PS11756053 Manufacturer Part Number WPW10534155 This kickplate grille is attached to the bottom of the refrigerator.",
  "rating": 4.43,
  "reviewCount": 21,
  "symptoms": [],
  "installationInstructions": {
    "author": "blane from upper arlington, OH",
    "title": "no symptoms (previousely damaged product)",
    "content": "Easy repair here, the Refridge was purchased at a discount as a scratch and dent model. the damage was superfical and the parts orderd were simple remove and replace job did not take long at all to replace all parts.Divider pantry: no tools required, simply pull out tray and remove old broken dividers and snap new divider in place.Brace-Crisper: this takes a screw driver to remove. remove the crisper shelf and insert a screw driver to lift the plastic securing tab. slide out the frame brace and slide the new brace in place the plastic tabs will snap in to place and hold the metal frame in its position.Grille, Toe: this grill snaps into place no tools required.Bracket: this is the metal bracket for the front feet, there are 4 screws to remove and the bracket comes off the front of the refridge. unsrew the adjustable screw foot and screw the adjustable screw foot into the new bracket......install the 4 screws and you are done.Trim-Shelf: no tools required simply pry the trim piece of with your fingers.....some may use a flat screw driver but this riskes scratching the trim piece. the new trim piece snaps into place."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS11756053-Whirlpool-WPW10534155-Kickplate-Grille-Apollo-Gray.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}