{
  "title": "Refrigerator Compressor Start Relay",
  "partUrl": "https://www.partselect.com/PS11766700-GE-WR07X26748-Compressor-Start-Relay.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$16.88",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11766700",
  "manufacturerPartNumber": "WR07X26748",
  "description": "Refrigerator Compressor Start Relay ★★★★★ ★★★★★ 3 Reviews PartSelect Number PS11766700 Manufacturer Part Number WR07X26748 This part is the replacement compressor start relay for your refrigerator. It is made of black plastic and is approximately 1 ¼ inches long and 1 inch wide. The compressor start relay attaches to the compressor and helps to start the compressor motor. If the compressor will not start, or if your refrigerator or freezer is too warm, you may need to replace the compressor start relay. This part is sold individually. It is an OEM part sourced directly from the manufacturer.",
  "rating": 4.67,
  "reviewCount": 3,
  "symptoms": [
    "Clicking sound",
    "Freezer section too warm",
    "Fridge too warm"
  ],
  "installationInstructions": {
    "author": "Sam from Cooper City, AL",
    "title": "Freezer & Frig Were Not Cold",
    "content": "First I removed the rear cover, located at the bottom of the refrigerator.   Then I cleaned out the dirt & dust on and around the compressor.   The relay has a cover, that is secured with a spring loaded clip.   To release the clip, push in with your fingers, while disengaging the end clip with a screwdriver.   Once one side is off the other lifts off.   Remove cove exposing the relay.   There is one wire terminated, with a spade clip, remove it.   With a strait blade screwdriver, pry the relay off the 2 post it slides on to.  (Don't be surprised if it breaks into pieces, as they are sometimes brittle. ) Slide the new relay onto the 2 posts, replace the wire onto the right terminal, and replace the relay cover & clip.   Replace the rear cover.   Plug in and test."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11766700-GE-WR07X26748-Compressor-Start-Relay.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11766700-GE-WR07X26748-Compressor-Start-Relay.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}