{
  "title": "Gaggenau Refrigerator Pivot Block",
  "partUrl": "https://www.partselect.com/PS11743531-Whirlpool-WP67003405-Pivot-Block.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$11.09",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11743531",
  "manufacturerPartNumber": "WP67003405",
  "description": "Gaggenau Refrigerator Pivot Block ★★★★★ ★★★★★ 14 Reviews PartSelect Number PS11743531 Manufacturer Part Number WP67003405 This is a replacement pivot block for your refrigerator. It is made of white plastic and is approximately 4 inches long and 1 inch wide. The pivot block catches and holds the door mullion cover when you close the door. If your refrigerator door will not close properly, you may need to replace the pivot block. This part is sold individually and is an OEM part sourced directly from the manufacturer.",
  "rating": 4.93,
  "reviewCount": 14,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Elijah from Killeen, TX",
    "title": "I had several broken appilances broken with parts to be replaced.",
    "content": "I had ordered the parts from Part Select and came with in a week.  I ahd a Whrilpool microwave that had a door panel and vent grille that needed to be replaced and that was rplced with ease took less that five minutes to do. My Maytag refridgerator had it kickplate grille replace along with the pivot block that took all of about two minutes. The longest job that took about 5 minutes was my Whirlpool glass oven door that needed to be replaced, but that was pretty ease to replace also with an extra hand from my son.  I just didn't want to break another glass door or I would have done it myself plus I was teaching him how to do self reparts."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11743531-Whirlpool-WP67003405-Pivot-Block.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11743531-Whirlpool-WP67003405-Pivot-Block.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}