{
  "title": "Speed Queen Dishwasher Thrust Washer",
  "partUrl": "https://www.partselect.com/PS11740482-Whirlpool-WP233520-Thrust-Washer.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$7.95",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS11740482",
  "manufacturerPartNumber": "WP233520",
  "description": "Speed Queen Dishwasher Thrust Washer ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS11740482 Manufacturer Part Number WP233520 This genuine OEM washer has a 3/4 inch outside diameter. This thrust washer can be used on most makes and models of dryers. A complete list of compatible dryers is available below. The washer is found on dryers around the drum support rollers and idler pulleys, and helps prevent the rollers and pulleys from bumping up against the brackets they are installed on. Your thrust washer could be defective if you notice your dryer wont tumble, rotate, or turn; or there is a load squealing or whining noise when the dryer tumbles. The repair is a relatively easy job. You will require a putty knife, 5/16 inch nut driver, and E-Ring pliers. Remember to disconnect the power to your dryer before you begin the repair.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [
    "Burning smell",
    "Noisy",
    "Spins slowly"
  ],
  "installationInstructions": {
    "author": "Chris from Hopedale, MA",
    "title": "Drum not centered , clothes getting stuck in dryer",
    "content": "The first thing I did was to unplug the dryer from the wall.  Then I removed the bottom two screws and slid the bottom cover off so i could see all the way to the back, I tipped the dryer back against the wall and searched for the problem with a flashlight.  I noticed that one of the guide wheels that held the drum in place was sheared off.  I took the new drum support roller out and carefully slid it over the shaft, I had to jiggle it around for a bit, but then it finally was seated correctly.  I replaced the washer and then the clip using a pair of needle nose pliers and a regular screw driver and then turned the dryer by hand to see if the wheel came off.  After confirming that it worked, I put the cover back on, and plugged it in and tested it."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11740482-Whirlpool-WP233520-Thrust-Washer.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11740482-Whirlpool-WP233520-Thrust-Washer.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}