{
  "title": "Dishwasher Seal",
  "partUrl": "https://www.partselect.com/PS11755651-Whirlpool-WPW10497235-Seal.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$9.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11755651",
  "manufacturerPartNumber": "WPW10497235",
  "description": "Dishwasher Seal ★★★★★ ★★★★★ 17 Reviews PartSelect Number PS11755651 Manufacturer Part Number WPW10497235 This part is the replacement door seal for your dishwasher. It is approximately 22 inches long and 2 inches wide. This door seal is made of gray plastic and is found at the bottom the dishwasher. The door seal is designed to seal the gap between the dishwasher tub and outer edge of the door. This helps to prevent leaks when your dishwasher is running. A leaking dishwasher is a good indication that the door seal is damaged. This seal is sold individually and is an OEM part sourced directly from the manufacturer.",
  "rating": 4,
  "reviewCount": 17,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Don from GRAPEVINE, TX",
    "title": "Door leaking from corner.",
    "content": "First, I replaced the bottom door seal. You will need magnetic nut drivers because of the location of the 3/16 screws that hold the seal in place. you also need a 1/4 in nut driver to remove plastic cover that covers up the 5 3/16 screws. Last you need a small star driver to remove the door screws. Note 4 of the door screws, the 4 on top of the door are much longer than the side screws. With all this said, this seal was not my problem. I then replaced the large black rubber seal around the tub. Be sure if you do this you fold the seal in half and start in the middle of the top of the opening so you have the exact amount of seal left over on both sides. Also when you remove the old seal, clean the area it was removed from with a damp cloth. Turns out, That was not my problem either. So now I will move to the next step to see where the water is coming from but maybe this information will help someone with a simple door leak."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11755651-Whirlpool-WPW10497235-Seal.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11755651-Whirlpool-WPW10497235-Seal.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}