{
  "title": "Caloric Refrigerator Capacitor",
  "partUrl": "https://www.partselect.com/PS11757023-Whirlpool-WPW10662129-Capacitor.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$34.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11757023",
  "manufacturerPartNumber": "WPW10662129",
  "description": "Caloric Refrigerator Capacitor ★★★★★ ★★★★★ 39 Reviews PartSelect Number PS11757023 Manufacturer Part Number WPW10662129 This capacitor (Refrigerator and Freezer Compressor Run Capacitor, Run Capacitor) provides the voltage or energy current required to start the compressor and keep it running. It allows the compressor in your appliance to easily cycle on and off. This capacitor mounts directly onto the compressor starting relay. If the capacitor is faulty the compressor may get unusually hot and draw excessive amperage. It the compressor overheats, it may fail to run until it cools down again. The compressor may also get noisy from overheating. If this part is totally electrically open, it is defective (often due to overheating) and needs to be replaced. The part measures 1 inch by 1-1/2 inches, and is constructed of plastic with two metal wire terminals. This item includes 1 capacitor, sold individually. This part comes in black.",
  "rating": 4.21,
  "reviewCount": 39,
  "symptoms": [
    "Clicking sound",
    "Freezer not defrosting",
    "Freezer section too warm"
  ],
  "installationInstructions": {
    "author": "garth from forest lake, MN",
    "title": "My refrigerator stopped cooling and the freezer section stopped freezing",
    "content": "I knew the chances of all the freon leaking out was unlikely so I looked at the wiring to the compressor and there was a capacitor and a starter/overload so i figured I would start there. I went on line and found the parts at this site and they were less than the minimum service call charge for a service tech so I figured what the heck let's give her a shot so I did give it a shot. I ordered the parts and they were there in less time than a service tech could come out and i installed the parts and guess what  for 90.00 in parts and 15 minutes in time I repaired my refrigerator. Thanks guys, It took less time to order the parts than it did to make the repair so thanks, your website rocks and is very well designed so my hat is off to you guys!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11757023-Whirlpool-WPW10662129-Capacitor.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11757023-Whirlpool-WPW10662129-Capacitor.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}