{
  "title": "Norge Dishwasher Hose Clamp",
  "partUrl": "https://www.partselect.com/PS11743008-Whirlpool-WP596669-Hose-Clamp.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$11.77",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11743008",
  "manufacturerPartNumber": "WP596669",
  "description": "Norge Dishwasher Hose Clamp ★★★★★ ★★★★★ 1 Review PartSelect Number PS11743008 Manufacturer Part Number WP596669 This hose clamp is used in a wide variety of household appliances. Most often it is found in washers, dishwashers, refrigerators, freezers, dehumidifiers, garbage disposals, or air conditioners. This clamp is used to securely attach a hose to another part of your appliance, which helps prevent leaks from those connections. Depending on the appliance, it can attach hoses to drain pumps, water inlet valves, pressure switches, and injector nozzles. We recommend you refer to model-specific diagrams for appropriate uses and exact placement. This hose clamp is made of metal, and is sold individually. To access and replace this part you will need a nut driver, pliers, and screwdrivers. Before you begin any repair work, make sure you have unplugged your appliance, and shut off the water supply if applicable.",
  "rating": 5,
  "reviewCount": 1,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "jeff from lindenhurst, IL",
    "title": "Washing Machine was leaking water",
    "content": "Loosened the hose clamp, removed the injector valve and injector nozzle assembly, replaced both and tightened with new hose clamp.  Fixed the problem for less than $20!!  Washing machine is 20 years old and this was the first problem--hopefully it is now good for another 20 years!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11743008-Whirlpool-WP596669-Hose-Clamp.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11743008-Whirlpool-WP596669-Hose-Clamp.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}