{
  "title": "Speed Queen Dishwasher Drum Support Roller",
  "partUrl": "https://www.partselect.com/PS11741913-Whirlpool-WP37001042-Drum-Support-Roller.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$20.93",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11741913",
  "manufacturerPartNumber": "WP37001042",
  "description": "Speed Queen Dishwasher Drum Support Roller ★★★★★ ★★★★★ 13 Reviews PartSelect Number PS11741913 Manufacturer Part Number WP37001042 This drum support roller is used for square-ported model clothes dryers. This part is sold individually; however, rollers tend to wear at the same rate, so it is suggested that both should be replaced at the same time. It has a metallic bearing in its center. The drum support roller holds the drum in place while it rotates on the support wheels. You may have a faulty or damaged roller if your dryer will not start or tumble, takes too long to dry clothes, or starts making loud noises. Customers have ranked this repair as easy and should take 15-30 minutes to complete.",
  "rating": 4.77,
  "reviewCount": 13,
  "symptoms": [
    "Drum Not Spinning",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Chris from Hopedale, MA",
    "title": "Drum not centered , clothes getting stuck in dryer",
    "content": "The first thing I did was to unplug the dryer from the wall.  Then I removed the bottom two screws and slid the bottom cover off so i could see all the way to the back, I tipped the dryer back against the wall and searched for the problem with a flashlight.  I noticed that one of the guide wheels that held the drum in place was sheared off.  I took the new drum support roller out and carefully slid it over the shaft, I had to jiggle it around for a bit, but then it finally was seated correctly.  I replaced the washer and then the clip using a pair of needle nose pliers and a regular screw driver and then turned the dryer by hand to see if the wheel came off.  After confirming that it worked, I put the cover back on, and plugged it in and tested it."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11741913-Whirlpool-WP37001042-Drum-Support-Roller.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11741913-Whirlpool-WP37001042-Drum-Support-Roller.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}