{
  "title": "Refrigerator Door Shelf Bin - White",
  "partUrl": "https://www.partselect.com/PS11739091-Whirlpool-WP2187172-Refrigerator-Door-Shelf-Bin-White.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$31.89",
  "originalPrice": "$39.86",
  "inStock": true,
  "partSelectNumber": "PS11739091",
  "manufacturerPartNumber": "WP2187172",
  "description": "Refrigerator Door Shelf Bin - White ★★★★★ ★★★★★ 235 Reviews PartSelect Number PS11739091 Manufacturer Part Number WP2187172 The white refrigerator door bin is an essential component for maximizing the storage capacity of your appliance. Measuring approximately 16.25\" wide, 3.25\" high, and 6.25\" deep, it securely holds jars, bottles, and other items in an accessible location on the refrigerator door. This bin is made from sturdy materials to withstand daily use and is designed to fit seamlessly into compatible refrigerator models. Installation is straightforward—simply follow the instructions provided in your owner’s manual. Confirm compatibility by matching the bin’s dimensions to your appliance before purchasing.",
  "rating": 4.91,
  "reviewCount": 235,
  "symptoms": [
    "Door won’t open or close",
    "Ice maker not making ice",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Charles from Dallas, TX",
    "title": "One of my door bins and filter cap broke.",
    "content": "I searched the model number for my Whirlpool refrigerator on the internet and partselect.com came up so I clicked on it.  The site asked for my model number which I typed in and there it was...a picture of my refrigerator in full detail and very well diagramed and labeled.  I found the number of the parts I needed, added them to my cart and paid.  In a few days (2 I think which is an awsome delivery time) the parts were iin my front door step, very well packaged and in imaculate condition.  I took them out of the box and installed them in less than 15 minutes.  A parts internet order and repair has NEVER gone as quick and easy as this did.  Thankyou Partselect for an awsome job and awsome website and even more awsome delivery time.  Very happy and impressed with your service.  Keep up the outstanding work!!!!!!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11739091-Whirlpool-WP2187172-Refrigerator-Door-Shelf-Bin-White.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11739091-Whirlpool-WP2187172-Refrigerator-Door-Shelf-Bin-White.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}