{
  "title": "Dishwasher Upper Rack Adjuster",
  "partUrl": "https://www.partselect.com/PS11756150-Whirlpool-WPW10546503-Dishwasher-Upper-Rack-Adjuster.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$24.89",
  "originalPrice": "$43.81",
  "inStock": true,
  "partSelectNumber": "PS11756150",
  "manufacturerPartNumber": "WPW10546503",
  "description": "Dishwasher Upper Rack Adjuster ★★★★★ ★★★★★ 123 Reviews PartSelect Number PS11756150 Manufacturer Part Number WPW10546503 This OEM Dishwasher Upper Rack Adjuster is a grayish-black, plastic part which will require a screwdriver to install. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. If broken then the rack will no longer slide properly, and the part must be replaced. The installation has been rated as \"easy\" by customers. Before beginning any repair, you should unplug the dishwasher and wear gloves to protect your hands. Check your model number and user manual to see if this part is right for you! Your dishwasher should have a left and right upper rack adjuster, and both are the same part. These parts are sold individually, so if you are looking to replace both, you will need to order two parts.",
  "rating": 4.72,
  "reviewCount": 123,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Kathie from Breda, IA",
    "title": "Broken parts on rack",
    "content": "Easy...easy....I first watched YouTube videos on how to fix our problem.    We replaced both tracks and also the rack adjuster on both sides of the rack.  The entire repair took about an hour and most of that time was spent finding the tools at our house!!  I ordered the parts on a Sunday evening and they were at our house on Tuesday!!!  Will use this sight again if repairs are needed."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11756150-Whirlpool-WPW10546503-Dishwasher-Upper-Rack-Adjuster.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11756150-Whirlpool-WPW10546503-Dishwasher-Upper-Rack-Adjuster.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}