{
  "title": "Estate Refrigerator Lower Door Closing Cam",
  "partUrl": "https://www.partselect.com/PS11739042-Whirlpool-WP2182179-Lower-Door-Closing-Cam.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$7.70",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11739042",
  "manufacturerPartNumber": "WP2182179",
  "description": "Estate Refrigerator Lower Door Closing Cam ★★★★★ ★★★★★ 87 Reviews PartSelect Number PS11739042 Manufacturer Part Number WP2182179 The lower door closing cam is used in refrigerator doors, it can be located on the fresh food side or the freezer side. It helps hold the door open. This cam is made out of plastic, so it might crack or wear down over time. If your door will not open and close properly you may need to replace the door closing cam. To successfully install this part, you will need a 5/16 nut driver and a small flat blade screwdriver. Before you begin, unplug your appliance and disconnect the water supply. Lubricating this part may help with installation. This replacement part is sold individually. This part will fit both the left and right side of your refrigerator door. To make the repair, remove the top hinge cover, then the top hinge support. Lift the door from the bottom support and remove the old door cams. Replace the cams, using a little lubricant if necessary, and place the door back on the lower hinge support. Replace the top hinge support and your repair is complete!",
  "rating": 4.54,
  "reviewCount": 87,
  "symptoms": [
    "Clicking sound",
    "Door Sweating",
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Norbert from Sugar Land, TX",
    "title": "Refigerator door was not closing all the way if not pushed shut.",
    "content": "Remove the top hinge cover.  Removed the top hinge support.   Lifted the door from the bottom support.  Old door cams were worn completly flat.  Replaced the lower door cam and closing cam use a little vasalene for lubricant on the cam surfaces.  Placed the door back on the lower hinge support.  Replaced the top hinge support.  Door is closing great now.  Thanks for the quick part deliver."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11739042-Whirlpool-WP2182179-Lower-Door-Closing-Cam.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11739042-Whirlpool-WP2182179-Lower-Door-Closing-Cam.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}