{
  "title": "Dishwasher Kickplate - Black",
  "partUrl": "https://www.partselect.com/PS11769017-Whirlpool-W10871196-Kickplate-Black.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$97.13",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11769017",
  "manufacturerPartNumber": "W10871196",
  "description": "Dishwasher Kickplate - Black ★★★★★ ★★★★★ 3 Reviews PartSelect Number PS11769017 Manufacturer Part Number W10871196 New Black Single Metal Access Panel Replacement Kit. Replaces old two part toe kick plates. Reuse insulation off old panel or see Recommended Parts.",
  "rating": 4.33,
  "reviewCount": 3,
  "symptoms": [],
  "installationInstructions": {
    "author": "Margaret from San Diego, CA",
    "title": "Wanted to change beige dishwasher front to black.",
    "content": "First , I went outside and turned the breaker for the dishwasher off.  Next,I removed the screws that held the bottom 2 pieces, that rest on the floo,r in place. Then removed the two beige metal pcs. . Next I replaced them with the 2 black pieces I had ordered and secured them with the 2 black screws I had received as part of my order. Then I removed the scews from the inside of the door of my KitchenAid Dishwasher. This released both the front bottom panel and the control panel. . I took the beige bottom door panel off and moved the insulation piece from the back of thebeige panel to the back of the black panel. Then I intalled the new black panel I ordered and resecured it with two screws until I had finished with the control panel switch out.I had to unplug an electronic tape from the inside of the beige control panel and plug the same tape back into the black control panel. I also had to remove the beige handle that was on the inside of the control panel, attached to the door, and replace it with the new black one I'd received.  I then installed the black control panel and reattached it with screws and finished replacing the rest of the screws I had removed from the inside of the door.I tested the handle to make sure it opened the door and locked it like it should and then went outside and turned the breaker back on. Came in and turned on the dishwasher and did a load of dishes. It looks awesome, matches the rest of my black appliances and I am very proud to have done it myself.  I also wanted to thank the customer service lady who was so great to work with on the phone. I would shop with you again."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS11769017-Whirlpool-W10871196-Kickplate-Black.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}