{
  "title": "General Electric Dishwasher Tub Gasket",
  "partUrl": "https://www.partselect.com/PS11774412-GE-WD08X23476-Dishwasher-Tub-Gasket.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$21.57",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11774412",
  "manufacturerPartNumber": "WD08X23476",
  "description": "General Electric Dishwasher Tub Gasket ★★★★★ ★★★★★ 31 Reviews PartSelect Number PS11774412 Manufacturer Part Number WD08X23476 The tub gasket, also known as the door gasket runs along the perimeter of your dishwasher basin and creates a seal that prevents water from leaking out when the tub is full. If you notice water on the floor after you run your dishwasher, it may be an indication that the gasket is loose or damaged. If your door gasket is damaged, it will need to be replaced. To replace the gasket, simply pull the old gasket out of the groove it rests in, and press the new gasket into place. This part is made of black rubber and is sold individually.",
  "rating": 4.84,
  "reviewCount": 31,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Mohammad from WOODBRIDGE, VA",
    "title": "Water was leaking from the bottom of the door during wash cycle",
    "content": "I replaced the tub gasket around the door circumference which took less than five minutes to replace. However the problem was replacing the beach gasket that prevents the water from flowing out of the dishwasher tub. The door had to be unhinged from the dishwasher which was unscrewed from the cabinets and brought out from its location. After the door was completely removed it was laid on its front.  After removing the door hinges which were secured with just one bolt I tried to slide the back panel off the front panel but without any success.  So I had to remove the torn and worn out gasket while working in a tight space. This is where the problem rose because according to  installation instructions there are screws supposed to be holding it to the main body frame. However, in my case rivets were used  by the manufacture since this was the first time the gasket was being replaced. So I had to use a power tool With a grinding bit to remove the face of the rivets and essentially cut them out to reveal the underlying holes. After this I replace the beach gasket and then used half inch SS Philips bolts and nuts to secure the gasket to the body frame."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11774412-GE-WD08X23476-Dishwasher-Tub-Gasket.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11774412-GE-WD08X23476-Dishwasher-Tub-Gasket.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}