{
  "title": "Norge Dishwasher Door Spring Linkage",
  "partUrl": "https://www.partselect.com/PS11746857-Whirlpool-WP912653-Door-Spring-Linkage.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$11.09",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11746857",
  "manufacturerPartNumber": "WP912653",
  "description": "Norge Dishwasher Door Spring Linkage ★★★★★ ★★★★★ 16 Reviews PartSelect Number PS11746857 Manufacturer Part Number WP912653 The door spring retainer is used in dishwashers. It attaches and holds the door spring to the support frame. If your dishwashers door keeps crashing, or both the door and dish rack are falling apart, then replacing the door spring retainer, which provides more flexibility, could be the solution to your symptoms. Before starting this project make sure to unplug the dishwasher as well as shut off the water supply before installing the spring retainer. Tools are not needed for this easy repair. Refer to the manufacturers installation instructions for best results and accuracy.",
  "rating": 5,
  "reviewCount": 16,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "kathleen from farmersville, CA",
    "title": "son used door for a step and bent as well as broke spring door component",
    "content": "first i removed the 2 holding screws fron the underside of the counter then oulled the dishwasher out about a foot.  i then removed the side panel that hold the front plate in plase on the right, below this were the screws that held the door hinge assembly on the right.  i then proceeded to remove those bolts. and replaced with the new one.  replacing the spring and the linkage came next no tools required.  i have to say that the diagram when i ordered helped emensly.  i am a 45 yr old woman and fixed it by nyself thanks to your ordering diagrams.  life is good!!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11746857-Whirlpool-WP912653-Door-Spring-Linkage.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11746857-Whirlpool-WP912653-Door-Spring-Linkage.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}