{
  "title": "Magic Chef Refrigerator Bi-Metal Defrost Thermostat",
  "partUrl": "https://www.partselect.com/PS11750673-Whirlpool-WPW10225581-Bi-Metal-Defrost-Thermostat.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$30.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11750673",
  "manufacturerPartNumber": "WPW10225581",
  "description": "Magic Chef Refrigerator Bi-Metal Defrost Thermostat ★★★★★ ★★★★★ 27 Reviews PartSelect Number PS11750673 Manufacturer Part Number WPW10225581 If you have ice building up in your freezer, or if your freezer is getting too warm during the defrost cycle you may need to replace the bi-metal defrost thermostat. The function of the defrost bi-metal thermostat is to clip onto the evaporator and protect your evaporator from overheating during the defrost cycle. If your refrigerator does not defrost properly you can test both the thermostat and the heater to figure out which part is at fault. For this repair, you will need a Phillips screwdriver, a 1/4 inch nut driver, a flat blade screwdriver, a pair of wire strippers, a roll of electrical tape, and a few butt splice connectors.",
  "rating": 4.63,
  "reviewCount": 27,
  "symptoms": [
    "Freezer not defrosting",
    "Freezer section too warm",
    "Freezer too cold"
  ],
  "installationInstructions": {
    "author": "Laune from Front Worth, TX",
    "title": "Both freezer and refrigerator stopped cooling",
    "content": "Compressor Start Divice kit, I took off back lower panel with the 1/4 inch nut driver, on the compressor their was a wire hook that held the starter in place used my plyers to unhook, pulled the unit off plug the new unit in reappled the clip it was so easy I had to exame it severl to time to make sure that was all their was to it. put the cover back on and turn the refrigerator on and it has work great, I did not install the Bi-Metal Defrost Thermostat it was not needed."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11750673-Whirlpool-WPW10225581-Bi-Metal-Defrost-Thermostat.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11750673-Whirlpool-WPW10225581-Bi-Metal-Defrost-Thermostat.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}