{
  "title": "Refrigerator Water Tube Kit",
  "partUrl": "https://www.partselect.com/PS11730901-Whirlpool-W10823511-Water-Tube-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$36.02",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11730901",
  "manufacturerPartNumber": "W10823511",
  "description": "Refrigerator Water Tube Kit ★★★★★ ★★★★★ 7 Reviews PartSelect Number PS11730901 Manufacturer Part Number W10823511 This is the replacement water tube kit for your refrigerator. This tubing is made of plastic, is 1/4 inch in diameter, and comes with 2 inserts. This tube may be longer than the original tube, and may need to be cut. This water tube transports water to the ice and water dispensers. If your refrigerator is leaking, or if the ice and water dispensers are not dispensing properly, you may need to replace this tube. This part is sold individually and is an OEM part sourced directly from the manufacturer.",
  "rating": 3.71,
  "reviewCount": 7,
  "symptoms": [
    "Ice maker not making ice",
    "Leaking",
    "Not dispensing water"
  ],
  "installationInstructions": {
    "author": "Trent from Tacoma, WA",
    "title": "water dispenser started leaking",
    "content": "i wasn't sure it was the inlet valve unit because the leak was at the water dispenser in the freezer door.  after some research it looked like the water inlet valve located in the back lower part of the refrigerator was the problem.  to replace, take off the cardboard cover, about 6 screws, you have access to the water inlet valve, disconnect the hoses (i think it goes without saying that you should have turned off the water to the frig) replace the inlet valve, connect hoses, turn water back on and you'll be back in business.  very easy repair."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11730901-Whirlpool-W10823511-Water-Tube-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11730901-Whirlpool-W10823511-Water-Tube-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}