{
  "title": "Dishwasher Drain Hose",
  "partUrl": "https://www.partselect.com/PS11760658-LG-AEM69493808-Dishwasher-Drain-Hose.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$73.58",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11760658",
  "manufacturerPartNumber": "AEM69493808",
  "description": "Dishwasher Drain Hose ★★★★★ ★★★★★ 8 Reviews PartSelect Number PS11760658 Manufacturer Part Number AEM69493808 This corrugated drain hose assembly directs wastewater from your dishwasher to the household drainage system. Positioned at the rear of the unit, it connects the pump to the sink drain or garbage disposal. If the hose becomes damaged or punctured, you may observe water leakage beneath the dishwasher or standing water within it. Please keep in mind that this genuine OEM replacement part is sold separately from the drain pump.",
  "rating": 4.75,
  "reviewCount": 8,
  "symptoms": [
    "Leaking",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "James from Evanston, IL",
    "title": "Drain hose was leaking.",
    "content": "I went to Youtube to get an idea of how to approach the repair. First turn off the electric power to the dishwasher. Then turn off the water valve that's connected to the dishwasher. Then disconnect both electrical and water lines connected to the dishwasher. Then remove the dishwasher from under the counter. Then place the dishwaher upside down. Remove the old hose,and install the new hose. Place the dishwasher right side up, and reconnect the water line, and electric line. Place the dishwasher back in place, and you're done."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11760658-LG-AEM69493808-Dishwasher-Drain-Hose.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11760658-LG-AEM69493808-Dishwasher-Drain-Hose.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}