{
  "title": "Dishwasher Door Handle - Silver",
  "partUrl": "https://www.partselect.com/PS11758453-Bosch-12012913-Door-Handle-Silver.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$42.45",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11758453",
  "manufacturerPartNumber": "12012913",
  "description": "Dishwasher Door Handle - Silver ★★★★★ ★★★★★ 10 Reviews PartSelect Number PS11758453 Manufacturer Part Number 12012913 This is a door handle, which is is installed at the top of your dishwasher door and allows you to open and close it. However, if this part is missing or broken, the opening and closing your dishwasher will be more difficult, and the overall visual appearance will be less pleasing. Replacing this door handle will require a Phillips-head and flat-head screwdriver, as well as a set of pliers, and some disassembly of your dishwasher will be necessary. This door handle is an individual OEM part and does not come with any other accessories for your dishwasher.",
  "rating": 4.1,
  "reviewCount": 10,
  "symptoms": [
    "Door latch failure"
  ],
  "installationInstructions": {
    "author": "Michael from CASTLE ROCK, CO",
    "title": "Replacing the pocket handle on a Bosch Dishwasher",
    "content": "I removed the 3 #20 torn screws in the handle, and the six #20 tore screws inside the door that hold the outer door skin in place.The plastic handle has a series of molded hooks that allow it to snap into the stainless steel skin.   To avoid damaging the skin, use a utility knife to cut behind the two large hooks on the bottom of the handle and the one on each end.   One trimmed, the handle easily slides out of the door skin.The new one will effortlessly snap in-place, then reposition the door skin and fasten with the 9 screw previously removed."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11758453-Bosch-12012913-Door-Handle-Silver.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11758453-Bosch-12012913-Door-Handle-Silver.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}