{
  "title": "Dishwasher Spring, Lid",
  "partUrl": "https://www.partselect.com/PS11744874-Whirlpool-WP8066018-Spring-Lid.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$7.95",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11744874",
  "manufacturerPartNumber": "WP8066018",
  "description": "Dishwasher Spring, Lid ★★★★★ ★★★★★ 12 Reviews PartSelect Number PS11744874 Manufacturer Part Number WP8066018 The dishwasher lid spring helps open the dispenser cover in the soap box when the control releases the latch. If your dishwasher does not dispense detergent, is broken and worn out, or the door is not opening properly, replacing the dispenser spring could be the solution. For this replacement you will need needle nose pliers. First, release the cover on the detergent dispenser, then remove the cover from the shaft it hinges on. Pull the shaft from one side and remove the spring from the shaft. Next, replace with the new spring and engage the two open hooks into the soap cover. Finally, grasp the hook and pull it over tab on the side of the wash cup. Verify that it works properly by opening and closing the cap. Refer to the manual provided by the manufacturer for further instructions.",
  "rating": 4.33,
  "reviewCount": 12,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "HAROLD from FISHERSVILLE, VA",
    "title": "Worn out spring on detergent release box lid",
    "content": "First, examine very carefully how the old spring relates to the detergent release box lid.  Note that the top of the spring has a square-end upside down \"U\" . This rests on a small ledge on the detergent box.  Also note that on either end of the spring is a straight extension of the spring wire.  These two \"legs\" must rest on the inside of the edge of the detergent box.                                                         Second, use a flat blade screw driver to pry the LID hinge pin from the mounting \"posts.  Remove the pin, first noting the position of the spring. Reassemble the spring on the hinge pin in reverse order. Then snap the lid onto the spring using the two mounting \"posts\".  NOTE: I used a very fine needle nose pliers to move the two spring \"legs\" behind the detergent box edge after I had mounted the lid.  Flip the lid down to test if the spring pressure on the lid can be felt.  Harold Kitzmann, Fishersville VA"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11744874-Whirlpool-WP8066018-Spring-Lid.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11744874-Whirlpool-WP8066018-Spring-Lid.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}