{
  "title": "Dishwasher Circulation Pump and Motor",
  "partUrl": "https://www.partselect.com/PS11757388-Whirlpool-WPW10757217-Circulation-Pump-and-Motor.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$222.31",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11757388",
  "manufacturerPartNumber": "WPW10757217",
  "description": "Dishwasher Circulation Pump and Motor ★★★★★ ★★★★★ 22 Reviews PartSelect Number PS11757388 Manufacturer Part Number WPW10757217 The circulation pump and motor is located near the bottom of the dishwasher. The part functions by spinning the impeller of the circulation pump, which is used to move the water through the spray arms during the wash cycle. Before you begin this repair, it is recommended that you pull your dishwasher out of the cabinet, so you can tip the dishwasher to one side and gain better access to the circulation pump and motor. Be sure to disconnect the power source and the water source to the dishwasher before you begin this repair. To complete this repair you will need a 1/4 inch nut driver and a 3/8 inch nut driver.",
  "rating": 4.86,
  "reviewCount": 22,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Steve from Inver Grove Heights, MN",
    "title": "Loud grinding noise from water pump",
    "content": "Rather than remove the pump assembly - as an earlier post had done - I pulled the entire dishwasher out and laid it down on the floor. This allowed easy, direct access to the motor (that was the hard, messy part). From this point it was easy. Unplug the wiring, remove the retaining bolt, rotate the motor off the mounting brackets and pull it out. Then put the new one in. That was the easy part (about 15 minutes). The entire job took 2-and-a-half hours, most of which was taken in disconnecting, cleaning up and reconnecting the dishwasher. It's much quieter now."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11757388-Whirlpool-WPW10757217-Circulation-Pump-and-Motor.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11757388-Whirlpool-WPW10757217-Circulation-Pump-and-Motor.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}