{
  "title": "Dishwasher Detergent Dispenser",
  "partUrl": "https://www.partselect.com/PS11770487-Frigidaire-5304506521-Detergent-Dispenser.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$70.53",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11770487",
  "manufacturerPartNumber": "5304506521",
  "description": "Dishwasher Detergent Dispenser ★★★★★ ★★★★★ 6 Reviews PartSelect Number PS11770487 Manufacturer Part Number 5304506521 This is the replacement detergent dispenser for your refrigerator. It is gray in color and is sold individually. It is approximately 8.5 inches long and 3 inches wide. The detergent dispenser stores the detergent until it is ready to be dispensed. If your dishes are not coming clean, or you notice the detergent is still in the dispenser at the end of the cycle, you may have a damaged or malfunctioning detergent dispenser. This is an OEM part sourced directly from the manufacturer.",
  "rating": 4.33,
  "reviewCount": 6,
  "symptoms": [
    "Door latch failure",
    "Leaking",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Bernard from ACUSHNET, MA",
    "title": "The soap dispenser didn’t dispense the soap",
    "content": "After shutting off power to the dishwasher, I removed the two screws holding the door cover on the inside of the door sides, about 8 inches from the bottom of the door. I slid the cover down and off, and unplugged the wires to the dispenser. Then I removed the six screws holding the dispenser in place, removed the old dispenser, installed the new one, replaced the six screws and plugged the wires back in. The door cover and the two screws was all that was left. It took about ten minutes. Easy."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11770487-Frigidaire-5304506521-Detergent-Dispenser.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11770487-Frigidaire-5304506521-Detergent-Dispenser.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}