{
  "title": "Admiral Refrigerator Ice Maker",
  "partUrl": "https://www.partselect.com/PS11738120-Whirlpool-W10873791-Refrigerator-Ice-Maker.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$75.92",
  "originalPrice": "$97.53",
  "inStock": true,
  "partSelectNumber": "PS11738120",
  "manufacturerPartNumber": "W10873791",
  "description": "Admiral Refrigerator Ice Maker ★★★★★ ★★★★★ 43 Reviews PartSelect Number PS11738120 Manufacturer Part Number W10873791 This ice maker is for refrigerators. Ice maker includes the ice mold and the control device. The ice maker receives water from the water inlet valve and then holds the water in the ice mold until the water freezes solid. It then automatically ejects the ice and refills to continue the process until the ice storage in is full. Safely store any food that could deteriorate while the power is off and unplug the refrigerator when installing this part. Wear work gloves to protect your hands.",
  "rating": 4.44,
  "reviewCount": 43,
  "symptoms": [
    "Ice maker not making ice",
    "Ice maker won’t dispense ice",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "James from NEW LONDON, NH",
    "title": "Ice maker has stopped making ice and made a loud banging sound",
    "content": "I turned the water and electricity off for the refrigerator.(not sure if this is necessary but is safer)Remove the ice bucket.Cover the Ice auger with a hand towel to catch any screws which my get dropped.Remove four Philips screws holding plastic cover to inside of the door. there are no clip/snaps to worry about but on/off switch needs to be un plugged. Remove cover.Remove two nut head screws holding old ice maker.Remove wiring harness from ice maker and lift ice maker up and out. There are two tabs on the door.Unplug the wiring harness from the ice maker..Installation: Press the wiring harness into clips on the new ice maker. Install ice maker onto door insuring it is over the tabs on door and the holes for nut screws line up. Plugging the wiring harness in and install two screws.Plug on/off wiring onto switch and press plastic cover onto inside of door. Take care that it fits inside of rubber door seal. Install four philips screws.Remove hand towel and install ice bucket making sure the ice maker is switched on. Close door.Turn on water and electricity.This took me 25 min. and I am sure would go faster if I had had instructions.My refrigerator took awhile before it started to make cubes but has been working like new ever since.This task is easy go for it."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11738120-Whirlpool-W10873791-Refrigerator-Ice-Maker.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11738120-Whirlpool-W10873791-Refrigerator-Ice-Maker.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}