{
  "title": "Dishwasher Thermostat",
  "partUrl": "https://www.partselect.com/PS11750035-Whirlpool-WPW10195091-Thermostat.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$44.96",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11750035",
  "manufacturerPartNumber": "WPW10195091",
  "description": "Dishwasher Thermostat ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS11750035 Manufacturer Part Number WPW10195091 This genuine OEM thermostat is sourced directly from the manufacturer to ensure compatibility with your dishwasher model. The thermostat monitors and regulates the temperature of the dishwasher heating element. It is responsible for ensuring that the water temperature reaches the optimal level for effective cleaning while also helping to prevent overheating and potential damage to the internal components of the dishwasher.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [
    "Not cleaning dishes properly",
    "Not drying dishes properly",
    "Will Not Start"
  ],
  "installationInstructions": {
    "author": "Ron from OKLAHOMA CITY, OK",
    "title": "Dishwasher does not finish its cycle. The sanitizer light flashes red and there is soapy water left in the dishwasher.",
    "content": "I replaced the thermostat (part # PS11750035) along with the heating element (part # PS9494999) and the turbidity sensor (part # PS11757214). I also checked the filter (part # PS11759673) and it was very clean with no holes. The dishwasher still has water and soap suds standing in dishwasher after I ran it through different cycles. Also, when I run the sanitize cycle the sanitize light flashes red at the end. It doesn’t appear to completely filling with water. Also my hot water temperature is 130 degrees after running for 1 minute. I am at a loss! Any suggestions?"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11750035-Whirlpool-WPW10195091-Thermostat.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11750035-Whirlpool-WPW10195091-Thermostat.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}