{
  "title": "Estate Dishwasher Rack Adjuster",
  "partUrl": "https://www.partselect.com/PS11750255-Whirlpool-WPW10204131-Rack-Adjuster.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$11.09",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11750255",
  "manufacturerPartNumber": "WPW10204131",
  "description": "Estate Dishwasher Rack Adjuster ★★★★★ ★★★★★ 35 Reviews PartSelect Number PS11750255 Manufacturer Part Number WPW10204131 This OEM dishrack roller and adjuster is found in your dishwasher. They work together to support and facilitate the smooth movement of your dishrack. The dishrack rollers are small wheels located on the sides of the dishrack and allow it to slide in and out effortlessly. Meanwhile, the dishrack adjuster is used to adjust the height via the selector at the back of this component. Over time, the rollers wear out. You may experience resistance or difficulty when sliding the dishrack in or out. If left unreplaced, your rollers or adjuster may break, causing dishes to tilt, collide, or fall over during the wash cycle. When removing a roller and adjuster from your appliance, you will need to pull out the dishrack partway. Detach the assembly by depressing the tabs on the two end stops before lifting them up. Keep in mind that the roller and adjuster are sold together, but the dishrack itself is sold separately.",
  "rating": 4.69,
  "reviewCount": 35,
  "symptoms": [],
  "installationInstructions": {
    "author": "Randy from Glenview, IL",
    "title": "Replacement of broken Rack Assembly Mount with Wheel",
    "content": "The only piece that may be a little difficult to remove here without a tool is the 'Track Stop'. This piece has a couple of clip-like pieces that need to be depressed in order to remove it. A flathead screw driver will do the trick. Once this piece is out and you have popped the Mount off of the Rack, you simply roll the piece out of the track, roll the new one in and snap the new Mount in place, replacing the Track Stop when you are done. VERY EASY!"
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS11750255-Whirlpool-WPW10204131-Rack-Adjuster.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}