{
  "title": "Caloric Dishwasher Clamp",
  "partUrl": "https://www.partselect.com/PS11743796-Whirlpool-WP696392-Clamp.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$7.28",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11743796",
  "manufacturerPartNumber": "WP696392",
  "description": "Caloric Dishwasher Clamp PartSelect Number PS11743796 Manufacturer Part Number WP696392 This screw-type clamp, also known as a hose clamp, is made of metal and is used within various models of washers to secure the tub-to-pump hose and tub/drum of the washer. Without this clamp, the hose is vulnerable to leaking and disconnecting from the tub during the wash cycle of the washer, which can present a serious safety hazard for the machine and your home. Clamps can wear out and lose their tension due to excessive vibrations, mechanical damage, and normal wear and tear, all things present within a washing machine. To replace this clamp, you will first need to turn off your washer and you will need access to the lower portion of the washer chassis, which may require one or multiple screwdrivers and wrenches. Once you have access, use your screwdriver to loosen this clamp, which can then be removed and replaced with the new clamp, which will need to be tightened securely. Then you can simply reassemble the rest of the washer you originally disassembled.",
  "rating": 0,
  "reviewCount": 0,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Tina from Denver, PA",
    "title": "A wirre from an underwire bra punctured a hole in tub to pump hose. Water leaked out all over the floor.",
    "content": "I searched the internet for parts because we had just had a repairman out to fix the knocking noise in the washer drum. He found an underwire from a bra there and removed it. That cost about $100. My husband took apart the bottom panel and showed me what the part looked like and I was able to find it on your website. I was able to order the parts and have my husband repair the washer so I was only without a washer for a week and a half. Thank you."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11743796-Whirlpool-WP696392-Clamp.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11743796-Whirlpool-WP696392-Clamp.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}