{
  "title": "Refrigerator Ice Maker Water Fill Tube Kit",
  "partUrl": "https://www.partselect.com/PS11739222-Whirlpool-WP2196157-Ice-Maker-Water-Fill-Tube-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$10.13",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11739222",
  "manufacturerPartNumber": "WP2196157",
  "description": "Refrigerator Ice Maker Water Fill Tube Kit ★★★★★ ★★★★★ 25 Reviews PartSelect Number PS11739222 Manufacturer Part Number WP2196157 The icemaker water fill tube provides water to the icemaker so it can produce ice and dispense water. If you notice that your ice maker is not making or dispensing ice, or is leaking, you may need to replace the water fill tube. This water fill tube kit comes with a fill tube and a compression nut. This part is made of white plastic and is approximately 10 inches in length. The ice maker water fill tube is in the rear of the fridge. To complete this repair, you will need a 1/4 inch nut driver and a utility knife. Before beginning this repair, you may want to disconnect the water and power supply to the refrigerator.",
  "rating": 4.6,
  "reviewCount": 25,
  "symptoms": [
    "Ice maker not making ice",
    "Ice maker won’t dispense ice",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Charles from Orland Hills, IL",
    "title": "Broken elbow on icemaker water fill tube.",
    "content": "Removed 2 screws holding water fill tube to rear of refrigerator and pulled out, matched old part with new to make sure of proper match.  Guide new fill tube thru hole, making sure it is aligned with slot in ice cube tray on inside of freezer.  Install new plastic line from water pump outlet to water fill tube, check for leaks, job done."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11739222-Whirlpool-WP2196157-Ice-Maker-Water-Fill-Tube-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11739222-Whirlpool-WP2196157-Ice-Maker-Water-Fill-Tube-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}