{
  "title": "Magic Chef Dishwasher Door Latch Assembly",
  "partUrl": "https://www.partselect.com/PS11731673-Whirlpool-W10862259-Door-Latch-Assembly.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$62.10",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11731673",
  "manufacturerPartNumber": "W10862259",
  "description": "Magic Chef Dishwasher Door Latch Assembly ★★★★★ ★★★★★ 127 Reviews PartSelect Number PS11731673 Manufacturer Part Number W10862259 This replacement part is a door latch assembly for a dishwasher. The latch keeps the appliance door closed while it is running, and prohibits the dishwasher from starting when the door is open. Depending on your model, you will need to remove approximately eleven screws to remove the inner panel and access the latch assembly. The latch assembly is connected by two wiring harnesses that are nearly identical, so it is recommended to make note of where each harness goes before continuing with the repair. You will need a Torx screwdriver to complete the repair. Disconnect the dishwasher from the power source before beginning this repair.",
  "rating": 4.84,
  "reviewCount": 127,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Will Not Start"
  ],
  "installationInstructions": {
    "author": "Marilyn from Marsing, ID",
    "title": "Handle and latch broke",
    "content": "I had to force the door open, due to a broken handle/latch.Ordered assembly with help of order desk to assure correct part number. Arrived within 3 to 4 days. Not sure but very fast. Only had to wash dishes by hand once. Turned off power to dishwasher, my electrical panel is clearly marked with switch for dishwasher. No guess work there. 3 min. to remove old assy. 3 min. to replace with new part. I might add that I am a 67yr. old female. So if I can handle this repair, anyone can. Saved repairman service call, or purchasing a new dishwasher."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11731673-Whirlpool-W10862259-Door-Latch-Assembly.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11731673-Whirlpool-W10862259-Door-Latch-Assembly.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}