{
  "title": "Caloric Refrigerator Door Light Switch",
  "partUrl": "https://www.partselect.com/PS11738900-Whirlpool-WP2149705-Door-Light-Switch.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$24.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11738900",
  "manufacturerPartNumber": "WP2149705",
  "description": "Caloric Refrigerator Door Light Switch ★★★★★ ★★★★★ 14 Reviews PartSelect Number PS11738900 Manufacturer Part Number WP2149705 The purpose of the light switch in your refrigerator is to automatically turn on the light when the door is opened. If the light does not come on automatically when you open the door, the contacts inside the light switch may be burned out, meaning it is time to replace the switch. This package contains both the new light switch and a small plastic spacer. To complete this repair, you will need to remove the control panel section of your refrigerator. The only tools you will require for this repair are a 1/4-inch nut driver and maybe a small flat blade screwdriver. Be sure to disconnect the power source from the refrigerator before completing this repair.",
  "rating": 4.14,
  "reviewCount": 14,
  "symptoms": [
    "Light not working"
  ],
  "installationInstructions": {
    "author": "Randy from Hays, KS",
    "title": "Broken light switch",
    "content": "Took all the screws out of the plastic shroud that encloses the switch .There only four that I needed to remove, were the two in front where the switches that go,they go in horizontally and two in the back with large washers on them that hold the back to the top of the box that go in vertically.The switch was a snap ( make that two  snaps ) the wiring is almost self explanatory. then it gos back to the way you took it off. OH! and don't forget to turn the light bulb all the way back in to the socket , so the light will work after you take the time to install it yourself.I had the water supply line from under the box to the water dispenser in the door and the total bill on that was one hundred thirty seven and a hand full of change.Don't be afraid to do it yourself the savings is enough on one one item to make several months payments on a new one  Randy the \"Handy Man'"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11738900-Whirlpool-WP2149705-Door-Light-Switch.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11738900-Whirlpool-WP2149705-Door-Light-Switch.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}