{
  "title": "Speed Queen Dishwasher Dryer Idler Assembly",
  "partUrl": "https://www.partselect.com/PS11741930-Whirlpool-WP37001287-Dryer-Idler-Assembly.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$35.66",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11741930",
  "manufacturerPartNumber": "WP37001287",
  "description": "Speed Queen Dishwasher Dryer Idler Assembly ★★★★★ ★★★★★ 20 Reviews PartSelect Number PS11741930 Manufacturer Part Number WP37001287 The spring for this part is sold separately. This idler assembly is for dryers. Idler assembly includes the idler arm and the idler pulley that maintains tension on the drive belt, allowing the belt to turn. Disconnect the power before installing this part. Wear work gloves to protect your hands.",
  "rating": 4.7,
  "reviewCount": 20,
  "symptoms": [
    "Drum Not Spinning",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Steven from Holderness, NH",
    "title": "Squeeling and grinding noise",
    "content": "Wasn't the belt!!  Changed it anyway. Should have come here earlier. That mistake added several days to the repair waiting for a second batch of the right parts. Became a pro at taking the dryer apart and reassembling, though!  Easy job, just take your time and mark your wires, if you need to.Followed other people's excellent instructions. Clean out all the dust bunnies. Schematics were a great resource. Those and the prices made me a repeat customer.The shaft of the Idler Lever wheel was the cause, but decided, since I had it apart, to spend a little more money and replace both Drum Support Rollers and the Roller Bracket and Shaft Assembly.  They showed some wear, and the parts were very inexpensive. Make sure you have snap ring pliers with prongs that are smaller than the standard 0.40 to save some aggravation with the Drum Rollers.  $5 tool.  Total parts were less than $60. Probably saved $150+ in labor. Quieter than ever now.  Thanks!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11741930-Whirlpool-WP37001287-Dryer-Idler-Assembly.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11741930-Whirlpool-WP37001287-Dryer-Idler-Assembly.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}