{
  "title": "Speed Queen Dishwasher Single Drum Glide Felt Pad",
  "partUrl": "https://www.partselect.com/PS11742773-Whirlpool-WP500121-Single-Drum-Glide-Felt-Pad.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$8.00",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11742773",
  "manufacturerPartNumber": "WP500121",
  "description": "Speed Queen Dishwasher Single Drum Glide Felt Pad ★★★★★ ★★★★★ 3 Reviews PartSelect Number PS11742773 Manufacturer Part Number WP500121 This dryer drum glide pad is an inch long. It is made of a felt material and is used for gas and electric clothes dryers. The dryer drum glide provides a soft surface for the front of the drum glide and allows the drum to move effortlessly. If you notice that your dryer is making loud squeaking noises, it might be due to the drum glide pad being worn down or torn apart. Make sure to unplug your dryer before performing this repair. To access this part, you will need to open up the top of the dryer. The front panel and the bulk head will also need to come off.",
  "rating": 5,
  "reviewCount": 3,
  "symptoms": [
    "Marks left on clothes",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Steven from Holderness, NH",
    "title": "Squeeling and grinding noise",
    "content": "Wasn't the belt!!  Changed it anyway. Should have come here earlier. That mistake added several days to the repair waiting for a second batch of the right parts. Became a pro at taking the dryer apart and reassembling, though!  Easy job, just take your time and mark your wires, if you need to.Followed other people's excellent instructions. Clean out all the dust bunnies. Schematics were a great resource. Those and the prices made me a repeat customer.The shaft of the Idler Lever wheel was the cause, but decided, since I had it apart, to spend a little more money and replace both Drum Support Rollers and the Roller Bracket and Shaft Assembly.  They showed some wear, and the parts were very inexpensive. Make sure you have snap ring pliers with prongs that are smaller than the standard 0.40 to save some aggravation with the Drum Rollers.  $5 tool.  Total parts were less than $60. Probably saved $150+ in labor. Quieter than ever now.  Thanks!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11742773-Whirlpool-WP500121-Single-Drum-Glide-Felt-Pad.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11742773-Whirlpool-WP500121-Single-Drum-Glide-Felt-Pad.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}