{
  "title": "Dishwasher Heating Element",
  "partUrl": "https://www.partselect.com/PS11748194-Whirlpool-WPW10082892-Heating-Element.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$52.87",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11748194",
  "manufacturerPartNumber": "WPW10082892",
  "description": "Dishwasher Heating Element ★★★★★ ★★★★★ 4 Reviews PartSelect Number PS11748194 Manufacturer Part Number WPW10082892 This dishwasher heating element is not designed to heat the water that enters it, but is designed to maintain the heat of the water that enters the dishwasher. It is located on the bottom of the dishwasher.",
  "rating": 3.75,
  "reviewCount": 4,
  "symptoms": [
    "Not cleaning dishes properly",
    "Not drying dishes properly",
    "Will Not Start"
  ],
  "installationInstructions": {
    "author": "Jeff from Blaine, WA",
    "title": "Burning smell from dishwasher",
    "content": "So one day passing the dishwasher while it was running, I noticed a rather pungent burning smell. Yikes, I shut it off!I took apart the pump housing at the bottom inside the dishwasher, expecting to find some kids toy plastic bit had got caught and had jammed the motor or something. But nothing there, and my dishwasher has a little screen to keep just such things from getting to the pump anyway. Hmmm.So, ran the dishwasher again, seemed ok now.A week later, same thing, burning smell. Pull it apart again, but no sign of trouble. But I know something is up, so I pull the kickplate and have a look underneath... Way at the back I see a red wire that looks a little melted, but it's hard to tell, so I pull the whole dishwasher out. Sure enough, one of the heater wires is melted and burned, and the plastic locknut holding that side of the heater is badly scorched. Looks like a little electrical fire, I'm lucky it didn't get out of hand!The heater still tests ok with an ohmeter, but I don't trust it now - order the heater and replacement locknut and washers. Didn't need to order washers, they come with the heater, oh well.Heater removal and replacement is very straight forward, but I added some high-temp gasket silicone sealant (Ultra Blue) around the seals as I think the original problem may have ben a bit of water leakage causing a short.Took about an hour to pull the dishwasher out, remove the heater and install the new one, put a new terminal on the heater wire, and put the whole thing back under the counter.Working great now. But not a problem I expected to have with a 2-year-old dishwasher!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11748194-Whirlpool-WPW10082892-Heating-Element.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11748194-Whirlpool-WPW10082892-Heating-Element.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}