{
  "title": "Litton Refrigerator Light Bulb - 7W",
  "partUrl": "https://www.partselect.com/PS11731356-Whirlpool-W10857122-Light-Bulb-7W.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$14.21",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS11731356",
  "manufacturerPartNumber": "W10857122",
  "description": "Litton Refrigerator Light Bulb - 7W ★★★★★ ★★★★★ 5 Reviews PartSelect Number PS11731356 Manufacturer Part Number W10857122 Sold individually. This bulb is a 7-watt appliance incandescent light bulb. This appliance light bulb is two inches long. It is used for many clothes dryers. You will need a Phillips screwdriver and needle-nose pliers. Unplug the power from your dryer. You will find the light bulb by opening your dryer door and locating the casing surrounding the bulb on the top of the inside of the door. You will need to remove the single screw holding it in place to access the bulb. Twist the old bulb out of place. Use your pliers if the base of the bulb is still inside the socket once the glass part of the bulb has been removed. Check to make sure that the socket itself is not damaged. If the socket is damaged it will need to be replaced as well. Screw your new bulb into place.",
  "rating": 4,
  "reviewCount": 5,
  "symptoms": [],
  "installationInstructions": {
    "author": "James from Canyon Country, CA",
    "title": "Frig was hot freezer was cold.  Freezer was fronzen over.",
    "content": "The frig was hot but the freezer was cold. I opened the back of the freezer and found the condenser all frozen over. Upon inspecting the defrost thermostat I found that it was split open, as if water got into it and the froze breaking it open. I used a blow dryer to defrost the condenser. I then spent a long time trying to find the model on-line, even the manufactor said it did not exist. Partselect.com was the only place that said the model did exist. When that part came in I toke the back of the freezer out again. Unplugged the defrost thermostat plugged the new one in clipped it back on the condenser and put the it all back together. Everything is working fine now."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS11731356-Whirlpool-W10857122-Light-Bulb-7W.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}