{
  "title": "Speed Queen Dishwasher Drum Glide",
  "partUrl": "https://www.partselect.com/PS11741931-Whirlpool-WP37001298-Drum-Glide.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$14.16",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11741931",
  "manufacturerPartNumber": "WP37001298",
  "description": "Speed Queen Dishwasher Drum Glide ★★★★★ ★★★★★ 10 Reviews PartSelect Number PS11741931 Manufacturer Part Number WP37001298 If your dryer is noisy, will not tumble, or is leaving marks on your clothes, you may need to replace the drum glide. The drum glide is installed on the front bulkhead either at the top or the bottom, regardless of the brand of dryer. To gain access to the drum glide, you will have to open the cabinet on the dryer. This drum glide is sold individually but it is important to note that they should be replaced in pairs. Before beginning this repair, it is important to disconnect the dryer from the power source. The tools required for this repair are a putty knife and a 5/16 nut driver.",
  "rating": 4.9,
  "reviewCount": 10,
  "symptoms": [
    "Marks left on clothes",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "David from Underwood, IA",
    "title": "Loud banging sound. Worn out roller.",
    "content": "Pulled off the lower panel with 5/16 socket.Pulled off the door assembly by removing the two screws at the bottom of the door assembly. I pulled down a little and then out. be carefull of the wires. Other posts said to remove. The wires were long enough I did not have to remove them. I just leaned it against the wall. I then removed the 4 screws that hold the front piece in.pulled it off replaced brackets , installed self adhesive felt(stuck good) and then glides. Mine were thin but not the problem. I then reached under the drum and released the belt from the tensioner. I then pulled the whole drum out.This is the time to vacum out good. I could get to the rear rollers very easy. The left roller was shot and the shaft half wore into(the problem). I pulled off the two screws holding the roller support. Normally You have to remove the wheel with snap ring pliers first to remove the support. In this case snap ring long gone. Replaced support shaft, installed thrust washers and roller with grease for both sides. The right support shaft was still good. Removed tensioner pulley and inspected. It was just as good as the new one. Cleaned and greased and reinstalled. Put new belt on the tub and slid it back in. Be carefull to get the belt on the proper side of the tensioner. I then installed the front supprt in place to support the tub with the 4 screws. Spun the tub(felt good) then reached under and reinstalled belt to motor and tensioner. Spun again to check for belt alignment. (Check) Reinstalled door an lower panel. Test Quiet Sounds like new. Very easy! I hope this helps someone just as the other post has helped me. Blessings to all."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11741931-Whirlpool-WP37001298-Drum-Glide.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11741931-Whirlpool-WP37001298-Drum-Glide.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}