{
  "title": "Amana Refrigerator Pantry End Cap Kit, LH and RH",
  "partUrl": "https://www.partselect.com/PS11738134-Whirlpool-W10874836-Pantry-End-Cap-Kit-LH-and-RH.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$26.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11738134",
  "manufacturerPartNumber": "W10874836",
  "description": "Amana Refrigerator Pantry End Cap Kit, LH and RH ★★★★★ ★★★★★ 377 Reviews PartSelect Number PS11738134 Manufacturer Part Number W10874836 This manufacturer-approved Refrigerator Pantry End Cap Kit, also known as the Refrigerator Drawer Support, is a kit containing all parts of the Pantry End Cap. It snaps into place on the appliance’s pantry drawer to help contain the items inside and to keep your refrigerator door from sliding all the way out. It is rated as \"medium\" difficulty to install, is constructed of plastic and comes in white. If broken or missing, the pantry drawer will not stay in place and the part should be replaced. Refer to your user manual and model number to ensure this is the correct part for you. This kit includes both the right and left side end caps, as well as the pins that will hold them in place. To replace an end cap, remove the three screws holding it in place. Then, remove the pin and end cap, replacing the old end cap with the new end cap. In the past, the left and right end caps were sold separately, but the part has been updated and now includes both sides. The part is sold as a kit, and unfortunately, as such none of the parts are available individually.",
  "rating": 4.84,
  "reviewCount": 377,
  "symptoms": [
    "Door won’t open or close",
    "Fridge too cold",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Tim from Littleton, CO",
    "title": "The poorly designed deli drawer lid tab broke off",
    "content": "Removed the fruit & veggie drawers & the deli (pantry) drawer.  Took out the 3 screws, removed the attached parts, put them on the replacement part, reattached it and put the drawers back in.Here's the part I want to share:  PartSelect had a expanded diagram showing the correct part and sufficiently detailed to figure out the repair before the part arrived.  That's why I ordered from them.  Secondly, I ordered the part Thursday morning--and the thing was sitting on my porch when I came back in from my evening out Saturday--2 days later!!!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11738134-Whirlpool-W10874836-Pantry-End-Cap-Kit-LH-and-RH.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11738134-Whirlpool-W10874836-Pantry-End-Cap-Kit-LH-and-RH.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}