{
  "title": "Admiral Dishwasher Filter",
  "partUrl": "https://www.partselect.com/PS11759673-Whirlpool-W10872845-Dishwasher-Filter.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$31.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11759673",
  "manufacturerPartNumber": "W10872845",
  "description": "Admiral Dishwasher Filter ★★★★★ ★★★★★ 33 Reviews PartSelect Number PS11759673 Manufacturer Part Number W10872845 This filter works with the water pump in your dishwasher. It prevents debris from entering the pump and causing damage. As a result, the filter can occasionally become clogged or damaged, and will need to be replaced. A good indication of a damaged filter is if your dishwasher is not draining or cleaning the dishes properly. This filter has a gray plastic top and bottom that are approximately 5 inches in diameter. This is a genuine OEM part that comes directly from the manufacturer. To replace the filter, simply turn it counterclockwise to unlock, and then screw in the new filter",
  "rating": 4.94,
  "reviewCount": 33,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "Kathy from TECUMSEH, MO",
    "title": "My filters had completely clogged up with hard deposits and food left on the dishes after running the dishwasher.",
    "content": "My filters had completely clogged up and had not cleaned my filters at all which was a no-no.I had lots of food left on the dishes after running my dishwasher, so I took bothp filters out and replaced them no tools required.  I won’t be using powdered or liquid detergent for my dishwasher anymore only pods  and promise to clean my filters once a month, so hopefully that’ll help keep them clean. Very easy replacement even for an old woman."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11759673-Whirlpool-W10872845-Dishwasher-Filter.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11759673-Whirlpool-W10872845-Dishwasher-Filter.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}