{
  "title": "Sharp Refrigerator Water Fill Cup and Bearing",
  "partUrl": "https://www.partselect.com/PS11743318-Whirlpool-WP628356-Water-Fill-Cup-and-Bearing.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$40.29",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11743318",
  "manufacturerPartNumber": "WP628356",
  "description": "Sharp Refrigerator Water Fill Cup and Bearing ★★★★★ ★★★★★ 10 Reviews PartSelect Number PS11743318 Manufacturer Part Number WP628356 This refrigerator ice maker fill cup dispenses the water into the ice cube mold during the fill cycle. Replacing the water fill cup is a possible solution if you notice that the ice maker is leaking, or not making/dispensing ice. If you notice the fill cup has been damaged or cracked; replace the part straight away. This water fill cup is a genuine OEM part and will fit most refrigerators, but check the list of compatible brands to make sure yours is included before purchasing.",
  "rating": 4.5,
  "reviewCount": 10,
  "symptoms": [
    "Ice maker dispenses too much ice",
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "David from Chester, CA",
    "title": "The Bearing Cup Assembly was broken and ice would jamb against it during the ice making cycle.",
    "content": "I removed the ice maker from the refrigerator, by removing one screw on the underside bracket and loosening the two screws at the top side, then lifting the ice maker off the loosened screws.  I then unplugged the electrical harness that supplies power from the refrigerator to the ice maker.  I then disassembled the ice maker by removing the front cover which is snapped in place, then removing  two recessed screws at the front. I removed the broken part, I then reassembled the ice maker with the new part. I replaced the two recessed screws at the front and snapped on the cover.  Then I reinstalled the ice maker in the refrigator by plugging in the harness, slipping the ice maker over the loosened screws in the refrigerator and replacing the screw that was removed from the underside bracket. Tightening all the screws completed the project."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11743318-Whirlpool-WP628356-Water-Fill-Cup-and-Bearing.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11743318-Whirlpool-WP628356-Water-Fill-Cup-and-Bearing.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}