{
  "title": "Refrigerator Hinge Bracket",
  "partUrl": "https://www.partselect.com/PS11739061-Whirlpool-WP2183805-Hinge-Bracket.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$10.72",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS11739061",
  "manufacturerPartNumber": "WP2183805",
  "description": "Refrigerator Hinge Bracket ★★★★★ ★★★★★ 5 Reviews PartSelect Number PS11739061 Manufacturer Part Number WP2183805 This hinge bracket, also known as a door stop, is attached to the bottom of the door and is used to limit how far the door swings out to protect the refrigerator itself, and any surrounding cabinets from potential damage. If your fridge is having issues opening or staying closed, check the hinges for any damage or cracking. To replace this bracket, simply remove the door off your refrigerator, unscrew and remove this bracket from the bottom of the door, and install the new one. This hinge bracket is an OEM replacement and is compatible with several different makes and models of refrigerator.",
  "rating": 1.8,
  "reviewCount": 5,
  "symptoms": [
    "Clicking sound",
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Gregory J from CHICAGO, IL",
    "title": "Right side door doesn't lift when closing",
    "content": "I failed to repair the problem and sent the parts back.  The hinge bracket that I needed was WPW10524049.  The hinge that I purchased was WP2183805.   I gave up on trying to repair the door because it was not clear to me how to assemble the cam and hinge.  There doesn't seem to be any obvious way to disassemble the hinge and cam that I have - which would allow me to replace the cam in the existing hinge."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11739061-Whirlpool-WP2183805-Hinge-Bracket.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11739061-Whirlpool-WP2183805-Hinge-Bracket.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}