{
  "title": "Refrigerator Door Gasket",
  "partUrl": "https://www.partselect.com/PS11770644-Frigidaire-5304507200-Refrigerator-Door-Gasket.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$143.22",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11770644",
  "manufacturerPartNumber": "5304507200",
  "description": "Refrigerator Door Gasket ★★★★★ ★★★★★ 14 Reviews PartSelect Number PS11770644 Manufacturer Part Number 5304507200 This door gasket, also known as a door seal, is sourced from the original equipment manufacturer for use in refrigerators and freezers. It is a flexible rubber strip that runs along the edge of the appliance door. It creates an airtight seal between the door and cabinet to prevent cold air from escaping, and warm air from entering the refrigerator, to ensure that the temperature in the appliance remains constant. Over time, the door gasket can lose its elasticity or tear. In this case, you will likely notice frost build-up, increased noise, and inconsistent temperatures. Peel the faulty gasket off the refrigerator frame and remove any debris or residue on the surface. Carefully place the new seal along the edge of the door and press it firmly into place. Secure it with the appropriate fasteners and close the door to verify that there are no gaps between the door and cabinet.",
  "rating": 4.43,
  "reviewCount": 14,
  "symptoms": [
    "Doesn’t stop running",
    "Door Sweating",
    "Fridge too warm"
  ],
  "installationInstructions": {
    "author": "Louise from Ocala, FL",
    "title": "Ice and frost were forming in a frost free freezer",
    "content": "The old gasket was obviously gapping, partially from age and partially from damage during a move.  To make the repair, I loosened the screws that are under the gasket and hold it in, but did not remove them.  Once all were loose, I removed the old gasket, then starting at the top, ran a thin bead of food grade RTV under the portion of the door that captures the gasket.  I put the sealant on that edge only, then carefully worked one of the short edges of the gasket under the plastic and tightened all but the corner screws.  I then ran the RTV down the inside of the hinge side of the door and repeated the process, this time tightening the top screw and the hinge side screw at the top, but leaving the bottom most screw loose.  I repeated the process on the opening side of the door.  The bottom was the hardest because the gasket seemed just a little long and it was hard to get the RTV up and behind the door portion, but after a couple tried I got a good bead of sealant then slid the gasket under the door capture and tightened all the remaining screws.  After closing the door, it was obvious that there were places were it did not seal well.  I used some cardboard strips, cut from the box the gasket came in, to place inside the freezer, between the hard plastic of the door and the inside of the gasket where it laps over the screws.  This helped a lot, but there were still a couple small areas, so I used more cardboard, from the outside, between the main portion of the gasket and the rim of the gasket.  This eliminated all the gaps.  I let this sit overnight and this morning removed all the cardboard for a great sealing freezer."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11770644-Frigidaire-5304507200-Refrigerator-Door-Gasket.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11770644-Frigidaire-5304507200-Refrigerator-Door-Gasket.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}