{
  "title": "Thermador Refrigerator Ice Guide",
  "partUrl": "https://www.partselect.com/PS11739026-Whirlpool-WP2180224-Ice-Guide.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$19.45",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11739026",
  "manufacturerPartNumber": "WP2180224",
  "description": "Thermador Refrigerator Ice Guide ★★★★★ ★★★★★ 60 Reviews PartSelect Number PS11739026 Manufacturer Part Number WP2180224 This is a refrigerator ice guide that is made entirely of clear plastic. This ice guide is located in the freezer door. Turn your refrigerator ice dispenser off before replacing the part. This is a simple repair, and the only tool you will need is a small flat blade screwdriver to push on the pivot tab on the bottom of the ice guide. Do not worry about breaking the side or pivot tabs on your existing ice guide because it will be discarded anyway. This is a genuine manufacturer replacement part.",
  "rating": 4.73,
  "reviewCount": 60,
  "symptoms": [
    "Door Sweating",
    "Ice maker dispenses too little ice",
    "Ice maker dispenses too much ice"
  ],
  "installationInstructions": {
    "author": "Tracy from Jacksonville, FL",
    "title": "External Ice Guide Broke a Tooth and Fell Off",
    "content": "We waited two years to do this because we didn't want to hassle with a repair man to come out and charge us arm+leg for something so simple. Finally we searched and found the part on line. It came two days FASTER than promised. Kudos to Part Select. Snapping it on was a breeze, although you do have to apply more pressure than feels comfortable with plastic clips. We can know get ice out of the external door system again."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11739026-Whirlpool-WP2180224-Ice-Guide.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11739026-Whirlpool-WP2180224-Ice-Guide.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}