{
  "title": "Refrigerator CAM-DOOR",
  "partUrl": "https://www.partselect.com/PS11755285-Whirlpool-WPW10470155-CAM-DOOR.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$8.00",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11755285",
  "manufacturerPartNumber": "WPW10470155",
  "description": "Refrigerator CAM-DOOR ★★★★★ ★★★★★ 3 Reviews PartSelect Number PS11755285 Manufacturer Part Number WPW10470155",
  "rating": 4,
  "reviewCount": 3,
  "symptoms": [
    "Clicking sound",
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "William from OREFIELD, PA",
    "title": "Right door lower hinge assembly was damaged, such that the door sagged and would not open or close properly.",
    "content": "Unfortunately, I have still not managed to complete the repair, using the two parts indicated above, nor with the door bracket (part no WP2183805) that I ordered subsequently that arrived two days ago. It is not the same as, nor functionally equivalent to, the old bracket that I assumed was broken, since it was not retaining the piece in the base of the door into which the cam is inserted to mount the door.  The new Cam is the correct part, but is not the solution since the old Cam is slightly worn but not damaged, and the thimble I bought does not seem to fit anywhere. The hole in the new bracket has a much too small hole to retain the Cam receptacle piece in place in the base of the door. However, this is the only lower door bracket shown in the PartSelect diagram of all the door parts used on a Whirlpool WRF560SMYM04 refrigerator. I do observe that the dark gray plastic cover on the base of the door is broken, but I don't imagine this plastic cover served to retain the Cam receptacle piece solidly in place, and this plastic cover is not offered as a replacement part either.  At present I am at a total loss for how to proceed!  However, the instructions for removing and replacing the door are clear and very easily carried out, and the job would be very quick and easy with the right parts. So beware if you are repairing the door on this model that the door parts diagram might not show all the parts to cover the door variations that apparently have been used!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11755285-Whirlpool-WPW10470155-CAM-DOOR.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11755285-Whirlpool-WPW10470155-CAM-DOOR.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}