{
  "title": "Refrigerator LED Light",
  "partUrl": "https://www.partselect.com/PS11755866-Whirlpool-WPW10515057-LED-Light.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$109.45",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11755866",
  "manufacturerPartNumber": "WPW10515057",
  "description": "Refrigerator LED Light ★★★★★ ★★★★★ 9 Reviews PartSelect Number PS11755866 Manufacturer Part Number WPW10515057 This genuine OEM LED light is compatible with refrigerators. It has a length of 5.25 inches and a width of 2.24 inches. It is designed to fit into the freezer section of the appliance. The light has a white plastic housing and a translucent shield for protection. The light illuminates the interior of the refrigerator and allows you to easily view the contents inside and find stored items, especially in low light conditions. The LED light is known for its energy efficiency, longevity, and bright lighting.",
  "rating": 4.56,
  "reviewCount": 9,
  "symptoms": [
    "Light not working"
  ],
  "installationInstructions": {
    "author": "Barb from RALEIGH, NC",
    "title": "Freezer light out and refrigerator lights dim",
    "content": "I was not able to unplug the refrigerator because it is housed in a built-in. I removed the icemaker and following simple instructions from YouTube was able to pry the cover off the existing part.  After a few gentle tugs, I disconnected the pinned wires from the old part. Connecting the new part was a little tricky but I managed with a little contorting. As soon as the pins connected the freezer light as well as the refrig lights came on.  It took about 15 minutes to complete."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11755866-Whirlpool-WPW10515057-LED-Light.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11755866-Whirlpool-WPW10515057-LED-Light.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}