{
  "title": "Norge Dishwasher Inner Door Foam Insulation Strip",
  "partUrl": "https://www.partselect.com/PS11748543-Whirlpool-WPW10117748-Inner-Door-Foam-Insulation-Strip.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$36.18",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11748543",
  "manufacturerPartNumber": "WPW10117748",
  "description": "Norge Dishwasher Inner Door Foam Insulation Strip ★★★★★ ★★★★★ 4 Reviews PartSelect Number PS11748543 Manufacturer Part Number WPW10117748 This genuine inner door foam insulation strip, sometimes known as bottom seal foam, is used to create a waterproof seal that helps prevent leaking from the door area of the dishwasher. The existing insulation strip may leave a sticky residue or leftover disintegrated strip that must be scraped off before installing the new strip. Residue can be scraped off with a putty knife. Be sure to remove all residue and clean surrounding areas of the dishwasher build. It is strongly recommended to check other sealant parts on the dishwasher door such as the door gasket and dispenser grommet to ensure the leaking issue is fully solved.",
  "rating": 4.25,
  "reviewCount": 4,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Bernard from Williamsport, PA",
    "title": "Water Leak at right side bottom of the dishwasher door",
    "content": "After dissassembling the unit to discover the leakage source I determined that it would do best to replace the top three contributors to the problem as listed by you.  Disassembly, parts replacement and reassembly was straight forward and a few hints garnered from your good instructions and assembly blow-up drawings made the job simple with the most difficult task being the removal of the adhesive foam gasket at the bottom of the door's interior. After scraping as much of the deteriorated foam away as possible with a plastic scraper I used some of my wife's nail polisher remover and a clean-up rag (being careful not to get the remover on plastic parts)and soon I had the adhesion area surface clean and ready to receive the new seal. With close attention to clean up of residues left behind from detergent and water and care taken with part installation and reassembly it no longer leaks and I hope to get another 10-15 years of leak free operation out of the dishwasher"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11748543-Whirlpool-WPW10117748-Inner-Door-Foam-Insulation-Strip.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11748543-Whirlpool-WPW10117748-Inner-Door-Foam-Insulation-Strip.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}