{
  "title": "Refrigerator Ice Maker Replacement",
  "partUrl": "https://www.partselect.com/PS11752389-Whirlpool-WPW10300022-Refrigerator-Ice-Maker-Replacement.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$156.89",
  "originalPrice": "$196.11",
  "inStock": true,
  "partSelectNumber": "PS11752389",
  "manufacturerPartNumber": "WPW10300022",
  "description": "Refrigerator Ice Maker Replacement ★★★★★ ★★★★★ 26 Reviews PartSelect Number PS11752389 Manufacturer Part Number WPW10300022 The replacement ice maker does not include a new ice level arm, or wire harness, these components will need to be reused from original ice maker.",
  "rating": 4.73,
  "reviewCount": 26,
  "symptoms": [
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "John from WELLTON, AZ",
    "title": "The ice maker had a internal brownish leak substance. This in turn dripped on the ice in the tray, which froze the ice cubes in a ball which would not let the ice to be ejected from the dispenser, and in turn cracked the tray which holds the ice cubes, so I had to replace the tray and ice maker.",
    "content": "On a side by side refer, you need both doors open to unscrew the three 1/4 inch screws,  1. Remove the ice tray2.the ice arm needs to be in the up position,  so no water will flow while dissembling. 3. Remove the two top screws,  4. While holding the ice maker with o e hand,  remove the bottom screw.Balance the ice maker and unplug the ice make  electric plug in the rear of the ice maker. 5. Take the I e maker out. 6. The ice maker does not come with the ice arm, so you need to remove the arm from the old or broken ice maker and install it in the new ice maker.7. Resemble in reverse order. I did not unplug the refer from the wall socket, you may want to do this. It recommended but I did not.There you go."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11752389-Whirlpool-WPW10300022-Refrigerator-Ice-Maker-Replacement.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11752389-Whirlpool-WPW10300022-Refrigerator-Ice-Maker-Replacement.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}