{
  "title": "Dishwasher Rubber Washer",
  "partUrl": "https://www.partselect.com/PS11743934-Whirlpool-WP717273-Rubber-Washer.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$7.75",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11743934",
  "manufacturerPartNumber": "WP717273",
  "description": "Dishwasher Rubber Washer PartSelect Number PS11743934 Manufacturer Part Number WP717273 The rubber washer is a part which is specific to dishwashers and should not be substituted by a similar part. It works with the heating element to seal the receptacle opening where the heating element is attached. The rubber washer is used to prevent water leaking from your dishwasher during its cycle. Before making any repairs to your dishwasher make sure that you disconnect the power by finding the breaker for the dishwasher, and turning it off. The tools you will need to complete this repair include an adjustable wrench, and a 1/4 inch nut driver. This specific rubber washer is sold individually.",
  "rating": 0,
  "reviewCount": 0,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Not drying dishes properly"
  ],
  "installationInstructions": {
    "author": "PAUL from ESTES PARK, CO",
    "title": "Unit Wouldn't Work. \"Clean\" Light Blinking",
    "content": "The unit had power, but the controls would not work.  The \"clean\" light was blinking.  I first replaced the control unit, no help.  I then used the \"just ask\" and was told the problem was the heating element and/or the hi-temp thermostat.  I replaced both those and used the re-set code pushing the \"hi-temp/air dry, hi-temp/air dry\" buttons.  That did it.  Easy parts to locate and replace.  It took longer pulling the unit out and putting it back than it did to replace the parts."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11743934-Whirlpool-WP717273-Rubber-Washer.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11743934-Whirlpool-WP717273-Rubber-Washer.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}