{
  "title": "Refrigerator Evaporator Drip Tray",
  "partUrl": "https://www.partselect.com/PS11756735-Whirlpool-WPW10614158-Evaporator-Drip-Tray.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$76.96",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11756735",
  "manufacturerPartNumber": "WPW10614158",
  "description": "Refrigerator Evaporator Drip Tray ★★★★★ ★★★★★ 5 Reviews PartSelect Number PS11756735 Manufacturer Part Number WPW10614158 This is the replacement evaporator drip tray for your refrigerator. It is made of white plastic and is approximately 19 inches by 9 inches. The evaporator drip tray sits below the evaporator to collect dripping water. If the drip tray is damaged, you may notice that your refrigerator is leaking. Because it is made of plastic, the drip tray can eventually develop a crack. You will need to pull out the refrigerator from the wall, and take off the bottom panel on the back of your refrigerator in order to access the drip tray for replacement. This is an OEM part sourced directly from the manufacturer.",
  "rating": 4.8,
  "reviewCount": 5,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Jerrel from REDDING, CA",
    "title": "Cracked Evaporation tray was leaking water on kitchen floor",
    "content": "I emptied refrigerator contents and tilted the refrigerator to the right so as to access the metal panel upon which the evaporation tray was resting.  The metal panel is on the left side underneath the refrigerator and the evaporation tray is resting on the panel.  I removed 4 screws that were holding the metal panel, pressed down on the panel, slid out the old, cracked plastic evaporation tray, inserted the new plastic evaporation tray, raised the metal panel to its original position, replaced the 4 screws, being careful not to pinched the water line that feeds the ice-maker.  VOILA!  Un-tilt the frig and re-stock it.  It took a day for the temperature to stabilize, due to tilting, I think.  New tray $45."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11756735-Whirlpool-WPW10614158-Evaporator-Drip-Tray.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11756735-Whirlpool-WPW10614158-Evaporator-Drip-Tray.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}