{
  "title": "Samsung Dishwasher Door Latch with Switches - NO Handle",
  "partUrl": "https://www.partselect.com/PS11751688-Whirlpool-WPW10275768-Door-Latch-with-Switches-NO-Handle.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$56.22",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11751688",
  "manufacturerPartNumber": "WPW10275768",
  "description": "Samsung Dishwasher Door Latch with Switches - NO Handle ★★★★★ ★★★★★ 21 Reviews PartSelect Number PS11751688 Manufacturer Part Number WPW10275768 This door latch, used in dishwashers, is located at the top of the door and locks the door shut when the dishwasher is working. If the door will not close or is damaged, changing the latch could be the solution. For this repair, remove all screws from the inner panel, then lift up the inner door panel and hold the door apart. Next, access the latch and pull wires from the switches. Refer to the manual provided by the manufacturer for further instructions and guidance. Remember to unplug the dishwasher from the power source or shut off the house circuit breaker before beginning this installation project.",
  "rating": 4.33,
  "reviewCount": 21,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Dennis from Austin, TX",
    "title": "Latch handle broke due to Latch Assembly worn",
    "content": "This repair was fairly quick and easy.  The parts are much better made than the stock Maytag.  The parts from PartSelect came lightening quick!  Never used before, always Sears, but will ALWAYS use from now on!So, first, make super sure all power is disconnected.  Then take the torx and remove all the screws on interior front cover - the top center two actually hold the latch assembly and handle.  Once all are removed, I propped the cover up and left all wiring connected.  I removed the switches connected to the old latch assembly and just removed the new switches from the new latch assembly, and popped the old ones onto the new latch assembly.  Now have new switches if the old ones ever wear out.  The latch assembly just pops out from what should be two sets of plastic peg clips molded into the black control panel back.  Mine were busted on one side.   So I molded some jb weld on the remaining sides to the pegs on the latch assembly and then screwed all back together (the controls on the panel are fine, not spending $85 if I can get away with sticking it...and the upper center two screws do the most of the holding anyway).  Works great again.  I really am ultra impressed with the HUGE difference in reinforcement that the new handle has.  If Maytag would have built it that way to begin with, should not have broke.  Anyway, if you are here just checking to see if you can do and how much parts are, place the order - it is no problem and cheap, and will probably never give up and break again."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11751688-Whirlpool-WPW10275768-Door-Latch-with-Switches-NO-Handle.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11751688-Whirlpool-WPW10275768-Door-Latch-with-Switches-NO-Handle.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}