{
  "title": "Dishwasher Rack Track Stop",
  "partUrl": "https://www.partselect.com/PS11746591-Whirlpool-WP8565925-Rack-Track-Stop.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$7.70",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11746591",
  "manufacturerPartNumber": "WP8565925",
  "description": "Dishwasher Rack Track Stop ★★★★★ ★★★★★ 121 Reviews PartSelect Number PS11746591 Manufacturer Part Number WP8565925 The rack track stop on your dishwasher is designed to stop the dish rack at the appropriate place when opening and closing the rack. If your dishwasher is not cleaning your dishes properly, the rack stop may need to be replaced. The replacement part may differ slightly from the broken part, depending on the model. However, the different styles are interchangeable. This product is sold individually and comes in both a white and grey plastic version. Many of our customers found this repair to be very easy and takes less than 30 minutes to complete. Simply snap the old part out and snap the new part into place. You will not require any tools to complete the job. This is an authentic part approved by the manufacturer.",
  "rating": 4.58,
  "reviewCount": 121,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Steven from WASHINGTON, DC",
    "title": "Upper rack wheels had begun to break off. Shoddy design and materials.",
    "content": "I carefully followed the video instructions step by step.  They were detailed, clear, and pointed out how to avoid installation mistakes. WIthout the video I would have been tempted to just figure it out myself - (\"Hey, I'm a handy guy. How hard could it be, right?\"). With the video I sailed right through with no dumb errors. The new rack adjuster wheel set is much sturdier than the Whirlpool original. It made sense to get new rack stops at the same time. Thank you, PartSelect."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11746591-Whirlpool-WP8565925-Rack-Track-Stop.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11746591-Whirlpool-WP8565925-Rack-Track-Stop.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}