{
  "title": "Jenn-Air Dishwasher Tine Pivot",
  "partUrl": "https://www.partselect.com/PS11748190-Whirlpool-WPW10082853-Tine-Pivot.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$9.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS11748190",
  "manufacturerPartNumber": "WPW10082853",
  "description": "Jenn-Air Dishwasher Tine Pivot ★★★★★ ★★★★★ 28 Reviews PartSelect Number PS11748190 Manufacturer Part Number WPW10082853 The tine pivot clip, also known as the tine row pivot, is used in dishwashers and is located in the upper dishrack. At around 3 inches in length, the clip is used to keep the tine row in place in the dishrack. If your clip is cracked or damaged, it is best to replace this part. To repair, first lift the release tab and hold the other side to prevent it from falling off. After lifting it off, you can set the new clip on the tine row and lock it up. Refer to the manual provided by the manufacturer for further installation instructions and guidance. Remember to wear work gloves as a safety precaution. This repair was rated as very easy by our customers and should be done in 15 minutes or less.",
  "rating": 5,
  "reviewCount": 28,
  "symptoms": [
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Kathie from Breda, IA",
    "title": "Broken parts on rack",
    "content": "Easy...easy....I first watched YouTube videos on how to fix our problem.    We replaced both tracks and also the rack adjuster on both sides of the rack.  The entire repair took about an hour and most of that time was spent finding the tools at our house!!  I ordered the parts on a Sunday evening and they were at our house on Tuesday!!!  Will use this sight again if repairs are needed."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS11748190-Whirlpool-WPW10082853-Tine-Pivot.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS11748190-Whirlpool-WPW10082853-Tine-Pivot.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}