{
  "title": "Crosley Dishwasher Lower Spray Arm",
  "partUrl": "https://www.partselect.com/PS12705424-Frigidaire-5304518927-Lower-Spray-Arm.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$34.10",
  "originalPrice": "$42.63",
  "inStock": true,
  "partSelectNumber": "PS12705424",
  "manufacturerPartNumber": "5304518927",
  "description": "Crosley Dishwasher Lower Spray Arm ★★★★★ ★★★★★ 73 Reviews PartSelect Number PS12705424 Manufacturer Part Number 5304518927 This lower spray arm assembly is a device in your dishwasher that distributes water and detergent during the washing cycle. Its rotating motion sprays water in multiple directions, ensuring thorough cleaning. Typically, it is attached to a support or hub at the bottom of the dishwasher. When this part is broken, there are noticeable signs to be aware of. You might hear knocking or banging sounds coming from the dishwasher. The spray arm may be wobbly or unable to rotate. If a broken arm assembly is not replaced, your dishes may still have dirt on them even after a wash cycle. Additionally, leftover food residue can result in an unpleasant smell within the dishwasher. To remove the existing arm assembly, simply grasp the center of it and lift it up so that it unsnaps from your dishwasher. Please note that this OEM-sourced part is sold individually.",
  "rating": 4.68,
  "reviewCount": 73,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Allison from Greenville, SC",
    "title": "Melted spray arm resulted in leaky dishwasher",
    "content": "Over Thanksgiving, the spray arm in my dishwasher apparently popped off and was partially melted. I remounted  it inside the dishwasher, but the new hole was on the side of the arm.  I think this resulted in water being sprayed directly against the door and not up through the top holes.  It flooded my kitchen floor.The spray arm pops on and off with plastic tabs (?) at the base. You can lightly pry with a butter knife or simply wiggle it off.  The new one popped right on.  Easiest repair EVER."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12705424-Frigidaire-5304518927-Lower-Spray-Arm.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12705424-Frigidaire-5304518927-Lower-Spray-Arm.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}