{
  "title": "Refrigerator Fresh Food Evaporator Fan Motor (DC)",
  "partUrl": "https://www.partselect.com/PS12172983-GE-WR60X26866-Refrigerator-Fresh-Food-Evaporator-Fan-Motor-DC.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$75.34",
  "originalPrice": "$120.03",
  "inStock": true,
  "partSelectNumber": "PS12172983",
  "manufacturerPartNumber": "WR60X26866",
  "description": "Refrigerator Fresh Food Evaporator Fan Motor (DC) ★★★★★ ★★★★★ 31 Reviews PartSelect Number PS12172983 Manufacturer Part Number WR60X26866 The Refrigerator Evaporator Fan Motor is an OEM replacement part for some GE refrigerators. It is responsible for circulating air over the evaporator coils, which are responsible for cooling the refrigerator's interior. Causes of a bad evaporator fan motor can include bearing failure, motor burnout due to overheating, or electrical issues. A malfunctioning fan motor can lead to temperature fluctuations, frost buildup, and ultimately, reduced cooling efficiency.",
  "rating": 4.48,
  "reviewCount": 31,
  "symptoms": [
    "Fridge too cold",
    "Fridge too warm",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Eunice from POWELL, WY",
    "title": "The refrigerator was too warm. The drawers where vegetables and fruits are kept were being frozen. The vents blowing cool air into bins were iced up.",
    "content": "Took the drawers out of fridge and unscrewed the support rails for drawers and unscrewed inside back wall of fridge. Removed cover on blower fan ~ unplugged fan. This took 45 mins. Left refrigerator unplugged and let thaw out.  Replaced with new fan 5 days later. Plugged in new fan. ThenPlugged in refrigerator to make sure it would work. After 15 minutes, unplugged fridge and put rails and drawers back. Total time 45 minutes. Plugged refrigerator back in and let run 24 hours. It took 5 days to get part due to snow storm delaying delivery. It works perfectly. Our GE will be 10 years old in August."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12172983-GE-WR60X26866-Refrigerator-Fresh-Food-Evaporator-Fan-Motor-DC.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12172983-GE-WR60X26866-Refrigerator-Fresh-Food-Evaporator-Fan-Motor-DC.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}