{
  "title": "Dishwasher Drain Pump Kit",
  "partUrl": "https://www.partselect.com/PS12582714-GE-WD19X24829-Drain-Pump-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$51.89",
  "originalPrice": "$64.86",
  "inStock": true,
  "partSelectNumber": "PS12582714",
  "manufacturerPartNumber": "WD19X24829",
  "description": "Dishwasher Drain Pump Kit ★★★★★ ★★★★★ 23 Reviews PartSelect Number PS12582714 Manufacturer Part Number WD19X24829 This is a drain pump kit for dishwashers. The drain pump for is responsible for pulling out and removing all contaminated food water from your dishwasher during and at the end of its washing cycle. If you notice water standing in your dishwasher after the cycle is over, or if you experience and notice leaks underneath your dishwasher, the pump will likely need to be replaced. This drain pump kit comes with the drain itself, as well as 5 different metal screw clamps of varying sizes. Replacing this drain pump will require some disassembly of your dishwasher, which means you will need a screwdriver, wrench, and protective equipment such as work gloves. This drain pump is sold as an individual OEM part, and does not come with any hoses or wire harnesses, so consider that before ordering.",
  "rating": 4.78,
  "reviewCount": 23,
  "symptoms": [
    "Leaking",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "DAWN from SARATOGA SPGS, NY",
    "title": "Dishwasher was not draining.",
    "content": "I listened to the DW cycles to be sure it was the drain pump (no water passes through discharge tube). We already had checked inside filter and our drain line. I watched video and saw it was a simple change. We unplugged and removed the pump and the new one fit exactly-it came with several clamps. Very simple & effective!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12582714-GE-WD19X24829-Drain-Pump-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12582714-GE-WD19X24829-Drain-Pump-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}