{
  "title": "Dishwasher PRESSURE SENSOR ASM",
  "partUrl": "https://www.partselect.com/PS12741258-GE-WD21X25468-PRESSURE-SENSOR-ASM.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$29.51",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12741258",
  "manufacturerPartNumber": "WD21X25468",
  "description": "Dishwasher PRESSURE SENSOR ASM ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS12741258 Manufacturer Part Number WD21X25468 This is a manufacturer-built pressure sensor for dishwashers. This pressure sensor, also known as a pressure switch, is designed to monitor the water pressure, communicate with the control board of the dishwasher, and accurately calculate the necessary amount of water for the washing cycle. If this pressure sensor is bad or not working properly, it will cause over and underfilling of your dishwasher, as well as excessive noise while in operation. To replace this pressure sensor, you will need a screwdriver and wrench to gain access and remove this part, and further disassembly of your dishwasher may be required. This sensor is sold individually and does not come with any other parts.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [
    "Not draining",
    "Will not fill with water",
    "Will Not Start"
  ],
  "installationInstructions": {
    "author": "Linda from MYRTLE BEACH, SC",
    "title": "Dishwasher would not fill with water and would shut off",
    "content": "I found it online! There were step by step instructions that were easy to understand. I have never had to do anything like this in my life, only recently had to start doing everything around the house myself due to husband's illness. The repairman came out, charged me $100 to determine what the dishwasher needed & left me with the part number.  He was going to charge me $389 to install the part and they were over charging for the part. The repairman suggested I just get a new dishwasher.I ordered the part from the website at 1/2 the price that the other place charges and found it on line. With the step by step instructions and the online  page, I successfully installed it MYSELF. Saved me a ton of $$.I LOVE the websiteThank You!!!!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12741258-GE-WD21X25468-PRESSURE-SENSOR-ASM.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12741258-GE-WD21X25468-PRESSURE-SENSOR-ASM.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}