{
  "title": "Dishwasher Lower Spray Arm",
  "partUrl": "https://www.partselect.com/PS12585623-Frigidaire-5304517203-Lower-Spray-Arm.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$31.89",
  "originalPrice": "$39.86",
  "inStock": true,
  "partSelectNumber": "PS12585623",
  "manufacturerPartNumber": "5304517203",
  "description": "Dishwasher Lower Spray Arm ★★★★★ ★★★★★ 125 Reviews PartSelect Number PS12585623 Manufacturer Part Number 5304517203 The Lower Spray Arm is used in your dishwasher to spray water and clean your dishes. If broken there will be visible damage or your dishes may no longer be cleaned properly. If your spray arm is broken (due to general wear or high heat), it should be replaced. Your lower spray arm will be located at the bottom of your dishwasher tub. Check your user manual and model number to ensure this model is right for you. This version is plastic and metal and comes in gray/blue. We recommend you wear work gloves to keep your hands safe when installing and disconnect power to the appliance. You will also want to make sure that you turn off the water supply to your dishwasher. From here, you will want to open the dishwasher, pull out the lower rack and set it aside. Remove the lower wash arm. On each side of the bottom of the spray arm, there are small locking tabs that can be pushed aside using a flathead screwdriver. Once released, the spray arm can easily be pulled off the dishwasher. Put the new lower wash arm in place and push it down to lock it in. Ensure it is spinning freely and does not hit the heating element. Return the lower dish rack into place and then close the dishwasher door.",
  "rating": 4.72,
  "reviewCount": 125,
  "symptoms": [
    "Door latch failure",
    "Leaking",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Donna from Madison, OH",
    "title": "spray arm keeps melting",
    "content": "I have had to keep replacing the spray arm on the bottom of my dishwasher which takes like 2 seconds to do..  First you open the dishwasher and than pull the bottom basked forward and reach down and pull the spray arm up and pop the bottom of the spray arm off and put it on the new spray arm and slip it back into the dishwasher over the thing that makes it spin around.. but the tricky part is and I didn't know this and this is why my dishwasher spray arm kept falling over and melting on the heating element.. you have to turn it till it clicks in..  and your done.."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12585623-Frigidaire-5304517203-Lower-Spray-Arm.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12585623-Frigidaire-5304517203-Lower-Spray-Arm.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}