{
  "title": "LG Refrigerator Water Filter",
  "partUrl": "https://www.partselect.com/PS12724833-LG-AGF80300702-Refrigerator-Water-Filter.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$80.19",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12724833",
  "manufacturerPartNumber": "AGF80300702",
  "description": "LG Refrigerator Water Filter ★★★★★ ★★★★★ 18 Reviews PartSelect Number PS12724833 Manufacturer Part Number AGF80300702 This refrigerator water filter replacement is for 2010 LG refrigerators that have either forward French doors or are the four-door dispensing models. This filter is designed to minimize impurities that can cause ill-tasting water or an unpleasant smell. It reduces sediment, dirt, rust, limescale, sand, and many other contaminants that can be harmful to your health and the life of your appliance. This filter should be replaced every 6 months or 200 gallons to ensure top quality performance. To remove your unwanted filter, press the push button to open the filter cover (water may spill from the hole), pull out the old cartridge in a downward motion. To install the new filter, make it so the ears are in the horizontal position and push the new cartridge into the housing until it stops. Push the filter upward until it is secure. Click the cover to lock it in place. Run water for approximately 5 minutes to prep the filter for use, and discard water. Reset the “filter reset” button if applicable.",
  "rating": 4.94,
  "reviewCount": 18,
  "symptoms": [
    "Ice maker not making ice",
    "Not dispensing water"
  ],
  "installationInstructions": {
    "author": "William from BOWDOINHAM, ME",
    "title": "The hose that feeds the Ice Maker broke,right where it goes in the Fridge.",
    "content": "I actually didn't use what I got. Because there was all kinds of tubing coiled up in the door. We just fed the exsess all the way through the Fridge,and Bingo! It was done."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12724833-LG-AGF80300702-Refrigerator-Water-Filter.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12724833-LG-AGF80300702-Refrigerator-Water-Filter.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}