{
  "title": "Dishwasher DIVERTER ASSEMBLY KIT",
  "partUrl": "https://www.partselect.com/PS12710077-GE-WD19X25278-DIVERTER-ASSEMBLY-KIT.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$95.62",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12710077",
  "manufacturerPartNumber": "WD19X25278",
  "description": "Dishwasher DIVERTER ASSEMBLY KIT ★★★★★ ★★★★★ 16 Reviews PartSelect Number PS12710077 Manufacturer Part Number WD19X25278 This diverter valve assembly is sourced from the original manufacturer for use in dishwashers. The assembly controls the flow of water between different parts of the appliance. It directs water to either the upper or lower spray arms during different stages of the wash cycle, ensuring efficient cleaning of dishes throughout the dishwasher. The valve may become damaged or worn down over time due to frequent use and exposure to heat and chemicals. If the assembly is faulty, you will likely notice leaking from under the door and less water reaching the spray arms. It is best to replace the assembly promptly to avoid further damage to the dishwasher.",
  "rating": 4.63,
  "reviewCount": 16,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Richard from THE DALLES, OR",
    "title": "Water leak, no power,shorted control motherboard, diverter passive main assembly rubber hose had hole in it.",
    "content": "repair under warranty for Home Depot. Ordered new controller, new sump manifold, new piranh clamp kit, new diverter passive main assy, installation took 6 months. Could not finish as GE had changed the diverter to a new design with the same part number that the repairman had no knowledge of and there is no part available for the same configuration of the one that went bad, after I called GE tech line they were not aware of updates. Giving me the same numbers. The new design works if you order a new conduit main. As the old one in the dishwasher will not connect to the new Diverter. New deverter no. WD19X25278 and the new main conduit is the same as the old configuration  no.WD12X21681 .  The repair people and parts people are not yet aware of the design change and availability of parts, as most are out of stock and no updated pictures of the new design. Repair warranty washed their hands of this and Home Depot after 6 months gave me credit of my full price I bought this for 3 yrs ago. Repairing myself and sell."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12710077-GE-WD19X25278-DIVERTER-ASSEMBLY-KIT.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12710077-GE-WD19X25278-DIVERTER-ASSEMBLY-KIT.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}