{
  "title": "Electrolux Refrigerator ROLLER",
  "partUrl": "https://www.partselect.com/PS12071116-Frigidaire-5304508016-ROLLER.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$7.23",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12071116",
  "manufacturerPartNumber": "5304508016",
  "description": "Electrolux Refrigerator ROLLER ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS12071116 Manufacturer Part Number 5304508016 This crisper pan roller is sourced directly from the manufacturer for use in your refrigerator. It is a genuine OEM part that is designed to fit just like the original for your convenience. The roller is a plastic wheel-like component that attached to the sides of the crisper pan and allows it slide in and out of the refrigerator smoothly. The rollers allow users to easily and conveniently access the contents of the drawers. Over time, the roller may wear down, break, or fall off. If the roller is faulty, you may notice difficulty sliding the drawer in and out, or the drawer may feel loose and unstable when you pull it out. Each crisper pan roller is sold individually. Ensure that you order the correct number of rollers for your refrigerator.",
  "rating": 3.5,
  "reviewCount": 2,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "hellen from SPRINGFIELD, MO",
    "title": "Roller screw recipients broke out.  Can't be repaired.",
    "content": "Was not able to repair.  Wasn't rollers I needed.  Plastic screw recipients in front on frame had broken out so rollers weren't the problem.  Tried gluing back pieces to no avail.  Crisper frames are poorly designed."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12071116-Frigidaire-5304508016-ROLLER.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12071116-Frigidaire-5304508016-ROLLER.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}