{
  "title": "Frigidaire Dishwasher Lower Spray Arm Support",
  "partUrl": "https://www.partselect.com/PS12712289-Frigidaire-5304518968-Lower-Spray-Arm-Support.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$11.26",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12712289",
  "manufacturerPartNumber": "5304518968",
  "description": "Frigidaire Dishwasher Lower Spray Arm Support ★★★★★ ★★★★★ 17 Reviews PartSelect Number PS12712289 Manufacturer Part Number 5304518968 This lower spray arm is a genuine OEM part for various makes and models of dishwasher and is sold as an individual part. This part attaches to the lower spray assembly of your dishwasher and the lower spray arm itself clips into this part to facilitate its spinning movement during the washing cycle. To replace it, remove the spray arm by pulling it out, remove the surrounding circular clip and then twist to remove this bit. Made completely of plastic, this part measures approximately 3-inches deep, 2-inches wide, and 3.125-inches tall.",
  "rating": 4.82,
  "reviewCount": 17,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Dale from Worley, ID",
    "title": "spray arm fell off and melted on element",
    "content": "The Spray arm and the support had come off during operation and subsequently melted on the heating element.  This was our fault, as a knife had slipped through the lower dish-rack and acted as a ramp to launch the spray arm as it came around.  The support was a simple 1/4 turn counter-clockwise until it clicked into place, drop the strainer basket into position around the support, them push the spray arm into place until the catches snap over the retaining ring molded into the support.  All told, about 10 minutes, max."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12712289-Frigidaire-5304518968-Lower-Spray-Arm-Support.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12712289-Frigidaire-5304518968-Lower-Spray-Arm-Support.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}