{
  "title": "Refrigerator Water Inlet Valve",
  "partUrl": "https://www.partselect.com/PS12727426-GE-WR57X30890-Water-Inlet-Valve.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$72.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12727426",
  "manufacturerPartNumber": "WR57X30890",
  "description": "Refrigerator Water Inlet Valve ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS12727426 Manufacturer Part Number WR57X30890 This water inlet valve is sourced directly from the manufacturer to ensure the best fit with your refrigerator. The water inlet valve is responsible for controlling the flow of water into the water dispenser and ice maker. It is typically located at the back of the refrigerator and is connected to the household water supply line. It opens to allow water to flow into the refrigerator and once the desired amount of water has been dispensed or the ice maker water reservoir has been filled, the valve closes to stop the flow of water. The water inlet valve will need to be replaced if it is physically damaged or otherwise faulty.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [
    "Ice maker not making ice",
    "Not dispensing water"
  ],
  "installationInstructions": {
    "author": "Christopher from BANCROFT, MI",
    "title": "No water and no ice being made",
    "content": "Checked to make sure water was going to the fridge and it was. Removed the 1st line after the valve and no water was present. Figured the valve was bad. Removed the wires to the old valve and also had to remove the wire harness on the new valve. It wasn't needed. Replaced the valve and installed the old wires. Hooked up the water line and instantly had water. A day later I had a full ice bucket. This part wasn't listed on GE website. But it was on partselect.com."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12727426-GE-WR57X30890-Water-Inlet-Valve.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12727426-GE-WR57X30890-Water-Inlet-Valve.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}