{
  "title": "Kelvinator Refrigerator Light Bulb",
  "partUrl": "https://www.partselect.com/PS12751166-Frigidaire-316538904-Light-Bulb.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$19.71",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12751166",
  "manufacturerPartNumber": "316538904",
  "description": "Kelvinator Refrigerator Light Bulb ★★★★★ ★★★★★ 11 Reviews PartSelect Number PS12751166 Manufacturer Part Number 316538904 This OEM 40 watt appliance light bulb is used for some ranges, refrigerators, freezers, and microwaves. Simply locate the existing bulb, unscrew it from its socket, and replace with new light bulb. If the existing bulb is broken in the socket, disconnect the power to the refrigerator and use a pair of needle nose pliers to grip the internal fragments of the bulb to unscrew. Replace with the new bulb and reconnect the power to the refrigerator. These bulbs are sold individually and are a commonly replaced part; consider ordering a spare.",
  "rating": 4.55,
  "reviewCount": 11,
  "symptoms": [],
  "installationInstructions": {
    "author": "Colin from Hollis, NY",
    "title": "Ice-Maker and Water Dispenser not working.",
    "content": "First I disconnected the power cord, then removed the screws that held the bracket that holds the base for the water-filer in place. I then disconnected the water lines(intake and outflow). Next I removed the screws that held the water-filter's base in place. I then disconnected the release lock mechanism for the filter and finally removed the water-filter base. I did the reverse to install the new water-filter base. Previously I had tested the intake water line and noticed the water was flowing with enough pressure upto the water-filter's base but no water was exiting thru the outflow line, which leads to the Ice-Maker and Dispenser. I had tried changing the filter but that didn't solve the problem it was then I had realized that the Base was the problem. The actual problem was the spring-loaded valves for both the intake and outflow lines, which had a plastic prong that protrudes out of the base that is triggered by the filter when installed. The two prongs were worn-down so the filter wasn't activating the spring-loaded release valve to let the water thru. As for the light, I just unscrewed it."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS12751166-Frigidaire-316538904-Light-Bulb.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}