{
  "title": "Electrolux Refrigerator Air Filter",
  "partUrl": "https://www.partselect.com/PS12586284-Frigidaire-PAULTRA2-Air-Filter.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$20.30",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12586284",
  "manufacturerPartNumber": "PAULTRA2",
  "description": "Electrolux Refrigerator Air Filter ★★★★★ ★★★★★ 13 Reviews PartSelect Number PS12586284 Manufacturer Part Number PAULTRA2 This package contains one carbon activated filter for refrigerators with Pure Air Ultra II filtration systems. The air filter cleans the air and absorbs strong odors from fragrant foods, such as onions, garlic, seafood, and over-ripe fruits and vegetables. By absorbing these unpleasant smells, it will also improve the flavor of your ice cubes. This is a simple repair that does not require tools for installation or removal. Start by removing the plastic wrap on the new filter, remove the cover from the housing inside the refrigerator, remove the old filter, place the new filter into the housing, and close the cover. Depending on the model of your appliance, you may need to reset the filter reminder. This part is OEM official, guaranteeing a smooth install and proper fit.",
  "rating": 4.85,
  "reviewCount": 13,
  "symptoms": [],
  "installationInstructions": {
    "author": "Sandra from UNION, NJ",
    "title": "Drawers were not packaged properly.  Had a broken piece on arrival.",
    "content": "I can’t repair them.  A piece broke from both drawers.  They weren’t packaged properly.   I didn’t even see fragile on the outside of the box.  I need to return the drawers.  I tried to go to The postal office but they’re charging over 100 dollars to ship both items.  I shouldn’t have to pay for shipping.  I need these items resent but packaged properly to avoid damage please."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS12586284-Frigidaire-PAULTRA2-Air-Filter.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}