{
  "title": "Dishwasher Dish Rack Slide Track - Right Side",
  "partUrl": "https://www.partselect.com/PS12584377-Whirlpool-W11259786-Dishwasher-Dish-Rack-Slide-Track-Right-Side.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$51.75",
  "originalPrice": "$71.74",
  "inStock": true,
  "partSelectNumber": "PS12584377",
  "manufacturerPartNumber": "W11259786",
  "description": "Dishwasher Dish Rack Slide Track - Right Side ★★★★★ ★★★★★ 44 Reviews PartSelect Number PS12584377 Manufacturer Part Number W11259786 This dish rack slide rail is a genuine OEM replacement part that is compatible with various models of dishwasher. It is designed to fit on the right side of the dishwasher. The slide rail or track supports the upper dish rack and allows it to slide in and out of the dishwasher smoothly so that you can easily load and unload your dishes. It is made of stainless steel and can be found mounted to the side of the interior cavity of the dishwasher. If your dish rack is unstable and difficult to pull in and out, you will likely need to replace the slide rail. Mounting hardware is sold separately.",
  "rating": 4.77,
  "reviewCount": 44,
  "symptoms": [
    "Door latch failure",
    "Door won’t close"
  ],
  "installationInstructions": {
    "author": "Kenneth from YACOLT, WA",
    "title": "Dish rack tracks failed over time",
    "content": "The repair was easy. You will need to make sure any screws securing the dishwasher are removed at the top front of the dishwasher under the counter and above the top of the dishwasher.  Then pull the dishwasher out exposing roughly 18\" of each side of the dishwasher then use a socket to remove the screws holding the tracks in place, 4 in total on each side. Then install new tracks and slide dishwasher back into place and secure."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12584377-Whirlpool-W11259786-Dishwasher-Dish-Rack-Slide-Track-Right-Side.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12584377-Whirlpool-W11259786-Dishwasher-Dish-Rack-Slide-Track-Right-Side.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}