{
  "title": "Dishwasher ORBITAL SPRAYER",
  "partUrl": "https://www.partselect.com/PS12717897-Frigidaire-5304517982-ORBITAL-SPRAYER.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$60.23",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS12717897",
  "manufacturerPartNumber": "5304517982",
  "description": "Dishwasher ORBITAL SPRAYER ★★★★★ ★★★★★ 5 Reviews PartSelect Number PS12717897 Manufacturer Part Number 5304517982 This orbital sprayer is an authentic OEM replacement part that is designed to fit with various models of dishwashers. It is blue in color and has a diameter of 8 inches. The sprayer is located at the bottom of the dishwasher beneath the lower dish rack. It is responsible for directing pressurized water and detergent onto dishes during the cleaning process. This ensures that the dishes are cleaned thoroughly and evenly. The orbital movement of the sprayer helps to maximize cleaning efficiency reaching into hard-to-reach places. Replacing the sprayer is a simple process, simply twist off the faulty sprayer and snap the new one into place.",
  "rating": 4.2,
  "reviewCount": 5,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Dennis from UNION, KY",
    "title": "Bottom orbital sprayer was loose and hitting on bottom heating element.",
    "content": "Made sure the dishwasher was empty. Removed bottom tray to access the spray arm. Turned plastic locking nut 30 degrees by hand and removed the entire bottom spray arm. Popped off defective orbital spray head and replaced by hand with new one. Replaced spray arm in unit and turned plastic lock nut to make sure the unit stayed in place. Placed bottom tray back in unit and repair was complete. Google installation guide and they give you very good step by step directions."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS12717897-Frigidaire-5304517982-ORBITAL-SPRAYER.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS12717897-Frigidaire-5304517982-ORBITAL-SPRAYER.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}