{
  "title": "Dishwasher Interlock Switch",
  "partUrl": "https://www.partselect.com/PS1481922-GE-WD21X10261-Interlock-Switch.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$27.42",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1481922",
  "manufacturerPartNumber": "WD21X10261",
  "description": "Dishwasher Interlock Switch ★★★★★ ★★★★★ 18 Reviews PartSelect Number PS1481922 Manufacturer Part Number WD21X10261 The interlock switch may also be referred to as a belt switch. This part is a simple on/off mechanism that prohibits the appliance from operating when the door is open. This is a part for your dryer. The interlock switch senses the door is shut and the dryer can begin. This part might need to be replaced if your dryer is not starting or is in process while the door is open. The black rectangular part of the switch is approximately 2 inches long and a 1/2-inch wide with two gold plates on either end. This is a genuine OEM part that is sourced right from the manufacturer.",
  "rating": 4.61,
  "reviewCount": 18,
  "symptoms": [
    "Door latch failure",
    "Will Not Start",
    "Won’t Start"
  ],
  "installationInstructions": {
    "author": "Steven from EPHRATA, WA",
    "title": "interlock switch was bad. Prevents the dishwasher form running as it \"thinks\" the door is still open.",
    "content": "Opened door, removed screw holding down metal plate that presses against interlock switch when door is closed. Removed plastic cover thingy that is over interlock switches. Removed the interlock switch by pressing the plastic lock thingy away from switch. Pulled the wires off each end of the interlock switch. Removed new interlock switch from plastic bag and reversed above procedure. Done, shut door and the dishwasher works."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1481922-GE-WD21X10261-Interlock-Switch.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1481922-GE-WD21X10261-Interlock-Switch.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}