{
  "title": "Refrigerator Dispenser Door Solenoid Assembly",
  "partUrl": "https://www.partselect.com/PS1483583-GE-WR62X10055-Dispenser-Door-Solenoid-Assembly.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$45.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1483583",
  "manufacturerPartNumber": "WR62X10055",
  "description": "Refrigerator Dispenser Door Solenoid Assembly ★★★★★ ★★★★★ 33 Reviews PartSelect Number PS1483583 Manufacturer Part Number WR62X10055 This part is a possible option when ice door won't open or shut properly or when water is not dispensing.",
  "rating": 4.79,
  "reviewCount": 33,
  "symptoms": [
    "Door Sweating",
    "Door won’t open or close",
    "Freezer not defrosting"
  ],
  "installationInstructions": {
    "author": "Bill from Cleveland Heights, OH",
    "title": "flap to ice dispenser would not close",
    "content": "The flap to the ice dispenser would not close, which allowed the ice dispenser to frost up, freezing the water dispenser.This was a simple fix.  The solenoid had stopped working, so it would not automatically close the door flap.  I read some posts on this site that suggest that you had to remove the trim around the entire dispenser to get at the solenoid.  My fridge may be a newer model, but in any event it was much easier than that.  Just below the touch pad for choosing water, ice, or crushed ice (above where the ice/water dispenses) there are three very small holes spaced about an inch a part. After unplugging the fridge, I stuck a small philips-head screw driver in each, freeing spring clips. That  allowed the touch pad to come off.  I then removed four screws to remove a plastic piece covering the chute, giving me access to the flap and solenoid.  I just unplugged the solenoid from the circuit board on the back of the touch pad and then removed three screws to remove the old solenoid. I replaced it with the new solenoid and plugged it into the circuit board. The touch pad then snapped back into place.The hardest part was figuring out how to get at the solenoid.  After I found that pushing the clips in those three holes allowed me to remove the touch pad, it could not be any easier."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1483583-GE-WR62X10055-Dispenser-Door-Solenoid-Assembly.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1483583-GE-WR62X10055-Dispenser-Door-Solenoid-Assembly.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}