{
  "title": "Refrigerator Water Dispenser Actuator",
  "partUrl": "https://www.partselect.com/PS1526418-Frigidaire-241685703-Water-Dispenser-Actuator.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$112.38",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1526418",
  "manufacturerPartNumber": "241685703",
  "description": "Refrigerator Water Dispenser Actuator ★★★★★ ★★★★★ 18 Reviews PartSelect Number PS1526418 Manufacturer Part Number 241685703 Once a glass is pressed against the actuator pad it will cause the dispenser to deliver ice or water when activated.",
  "rating": 4.89,
  "reviewCount": 18,
  "symptoms": [
    "Not dispensing water"
  ],
  "installationInstructions": {
    "author": "Jerome from Yardville, NJ",
    "title": "Water dispenser actuator snapped in half",
    "content": "Unplugged refrigerator.  Pull forward on tray at bottom of water & ice dispenser to remove it.  Remove three screws.  Push up and then pull out to remove black cover around dispensers.  Be careful not to break ribbon cable.  Pulled ribbon cable from green circuit card on the cover.  Set the cover aside.  Removed green circuit card from refigerator (six small screws).  Had to unplug two wires to do this.  Set this aside.  Make sure you remember which connector each wire goes in for re-assembly.  I ended up removing the entire assembly, it was easier to work on.  There were a couple more screws to remove and then you can carefully pull the entire assembly down and toward you to remove it.  This meant removing the water supply line from the dispenser.  Pushed up on the water supply line with needle nose pliers to \"unstick\" it and make it easier to pull out.  Used needle nose pliers to unplug wires from broken actuator from the circuit card.  Make sure to unplug the correct one.  Unscrewed the two screws that held the metal plates thet held the actuator in place.  Cut the wires to make it easier to remove the broken actuator and pull the wires through  Installed the new actuator and screws.  Routed the wire through and plugged it in to the circuit card.  Now the hardest part, and I would not have figured it out without a tip from this website.  There was no slack in the water line and it was impossible to push the end of it back into the hole in the dispenser assembly.  Open the refrigerator doors and remove the black cover at the bottom.  The water line goes up through the freezer door from the bottom.  It was easy to push an inch or two of slack up through the door.  Then I could grab the water line and insert it in the hole in the dispenser.  Re-connect the wires that were disconnected and replace the assembly in the freezer door.  You can pull slack in the water supply line back down from the bottom if needed.  Replace the screws that hold the dispenser assembly in place.  Replace the circuit card.  Then I had to push the ribbon cable back into the slot in the circuit card in the cover.  I had to remove the circuit card from the cover to get at the slot.  Push the cable into the slot and re-install the circuit card in the cover.  I needed to have my son help me here as a second set of hands was needed, the ribbon cable is short.  Replace the cover, be careful not to damage the ribbon cable.  Install the three screws and snap the boittom tray back  in place.  Re-install the black cover at the bottom.  Works great."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1526418-Frigidaire-241685703-Water-Dispenser-Actuator.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1526418-Frigidaire-241685703-Water-Dispenser-Actuator.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}