{
  "title": "Caloric Dishwasher Heating Element Brass Nut",
  "partUrl": "https://www.partselect.com/PS1524878-Frigidaire-154106202-Heating-Element-Brass-Nut.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$7.82",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1524878",
  "manufacturerPartNumber": "154106202",
  "description": "Caloric Dishwasher Heating Element Brass Nut ★★★★★ ★★★★★ 8 Reviews PartSelect Number PS1524878 Manufacturer Part Number 154106202 The heating element nut is used to connect the heating element to the dishwasher tub. If water is leaking from underneath your dishwasher, you may need to tighten or replace the heating element nut. Replacing the nut is an easy job, does not require any specialty tools, and should not take you more than 10 minutes. For our step by step guide, click the video below. The brass nut measures 7 inches in length x 1 inch in width x 5 inches in height, and fits most dishwashers. To see if this part is compatible with your dishwasher, check the list of compatible brands below.",
  "rating": 5,
  "reviewCount": 8,
  "symptoms": [],
  "installationInstructions": {
    "author": "Dennis from Tryon, NC",
    "title": "Water leaking under the dishwasher",
    "content": "I looked under and found that 2 brass nuts that secured the heater element through the base housing of the dishwasher has split down each side of the nut and no longer was tight enough to keep water from leaking around either end of the heater element.  I powered down the dishwasher at the circuit breaker and then reached under the dishwasher and pulled away the 2 wires that were attached to each side of the heater element.  I removed the two nuts and replaced them with the parts I ordered from partselect.com.  I then put the appropriate wires back at the end of the heater element and ran the dishwasher to check for leaks.  No leaks... it was fixed."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS1524878-Frigidaire-154106202-Heating-Element-Brass-Nut.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}