{
  "title": "Dishwasher Upper Dishrack Slide",
  "partUrl": "https://www.partselect.com/PS1525080-Frigidaire-154597801-Upper-Dishrack-Slide.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$49.57",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1525080",
  "manufacturerPartNumber": "154597801",
  "description": "Dishwasher Upper Dishrack Slide ★★★★★ ★★★★★ 1 Review PartSelect Number PS1525080 Manufacturer Part Number 154597801 This is an upper dishrack slide for your dishwasher. It is mounted to each side of the upper cabinet wall. The dishrack wheels roll inside this track, which guides the upper rack. The mounting screws are not included in this purchase and can be found in the related parts section below. You should purchase a new dishrack slide if your current one has been warped or damaged over time.",
  "rating": 1,
  "reviewCount": 1,
  "symptoms": [],
  "installationInstructions": {
    "author": "Terry from Pleasant View, UT",
    "title": "Top rack was dropping out of rollers/Slides",
    "content": "This was the second part of repair.  Left side was constantly falling out of the slide.  I replaced the same items as above minus the gasket and screw kit.  Once done, the right side was sloppy so I orders part for that side plus gasket which slid right in.  1. Removed stops on front end of Upper Dishrack Slide on    both sides.2. Removed Upper Dishrack3. Remove Roller and Axle/clip (4 each)4. Push Roller onto Axle on all 4 kits  5. Install all 4 roller kits on Upper Dishrack6. Remove stops from back end of Upper Dishrack Slides.7. Remove both Slides8. Remove 8 each Tub Wheels.9. Using old or new Screws and Washers, install new Tub Wheels.10. Install both Upper Dishrack Slides ensuring that small holes are toward the back.11. Install stops on the back end of Slides.12  Install Upper Dishrackinto slides13. Install front stops on slide14. Pulled out Gasket15. Install replaced Gasket"
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS1525080-Frigidaire-154597801-Upper-Dishrack-Slide.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}