{
  "title": "Refrigerator Water Dispenser Actuator",
  "partUrl": "https://www.partselect.com/PS1526383-Frigidaire-241682003-Water-Dispenser-Actuator.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$49.51",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1526383",
  "manufacturerPartNumber": "241682003",
  "description": "Refrigerator Water Dispenser Actuator ★★★★★ ★★★★★ 17 Reviews PartSelect Number PS1526383 Manufacturer Part Number 241682003 Once a glass is pressed against the actuator pad it will cause the dispenser to deliver ice or water when activated.",
  "rating": 4.82,
  "reviewCount": 17,
  "symptoms": [
    "Leaking",
    "Not dispensing water"
  ],
  "installationInstructions": {
    "author": "Jonathan from Universal City, TX",
    "title": "Water actuator broke",
    "content": "If you think you probably can't do this, you're like me... but you just had to try because you needed the part anyway right?  This really was quite simple, a lot easier than it sounds from the description and saved me probably $75 I'd have had to pay a tech to do it.  Just unplug fridge, yank that water spill tray out, yes yank, it's a bit hard to do that if you've not done it before.  After that remove the 3 phillips head screws you just gained access to.  Lift panel frame up then out.  Disconnect wire harness plug and set that frame aside.  Take out next screws exposed  to free the unit.  Tilt unit out and remove the two little screws and shims holding actuator in place.  Remove broken one.  Put new one in.  Reverse all actions taken thus far.  Plug fridge back in and have a drink of water like nothing ever happened. : )  You can do this!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1526383-Frigidaire-241682003-Water-Dispenser-Actuator.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1526383-Frigidaire-241682003-Water-Dispenser-Actuator.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}