{
  "title": "Magic Chef Refrigerator ICEMAKER",
  "partUrl": "https://www.partselect.com/PS16660327-Whirlpool-W11510803-ICEMAKER.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$127.05",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS16660327",
  "manufacturerPartNumber": "W11510803",
  "description": "Magic Chef Refrigerator ICEMAKER ★★★★★ ★★★★★ 26 Reviews PartSelect Number PS16660327 Manufacturer Part Number W11510803 This genuine OEM ice maker kit is designed to fit refrigerators that did not originally come with an ice maker. This kit contains everything needed to install the new ice maker on your refrigerator including: the ice maker, ice bin, inlet valve, fill tube, and hardware. If your new ice maker does not function properly after being installed, check the freezer temperature. The freezer must to be around zero degrees Fahrenheit. Remember to disconnect the power and water supply to your refrigerator before beginning this installation. Make sure to check that your model is compatible with this part before ordering. Note: The manufacturer has updated this part. It may differ in appearance but will function the same as the original.",
  "rating": 4.85,
  "reviewCount": 26,
  "symptoms": [
    "Ice maker not making ice",
    "Ice maker won’t dispense ice",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Donald A. from ORLANDO, FL",
    "title": "Wanted to install ice maker in my freezer",
    "content": "I was clening my uprght freezer and noticed that it was preped for an icemaker. I first went to the Whilpool website and could not find my part as my freezer was a 2008 model.I saw PartSelect on the search page and went to thier site.I put in my modle number of the Whilpool Ice maker kit that was on the back of my freezer. PartSelect had the part in stock and approx $18.00 less than the other kits listed on the Whilpool site (that did not match my kit number).  I orderd the kit on Sunday and it arrived on Wednesday.  It took less than and hour to install.  Every part I needed was included.  The following day I installed the water line and now I have an extra icemaker."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16660327-Whirlpool-W11510803-ICEMAKER.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16660327-Whirlpool-W11510803-ICEMAKER.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}