{
  "title": "Crosley Dishwasher WHEEL & BUSHING ASS",
  "partUrl": "https://www.partselect.com/PS16745479-Frigidaire-5304532229-WHEEL-BUSHING-ASS.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$6.88",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS16745479",
  "manufacturerPartNumber": "5304532229",
  "description": "Crosley Dishwasher WHEEL & BUSHING ASS ★★★★★ ★★★★★ 6 Reviews PartSelect Number PS16745479 Manufacturer Part Number 5304532229 The single rack roller kit comes with one axle/clip and one wheel/roller. The rack wheel is designed to allow the rack of your dishwasher to roll in and out. If the rack will not complete this task, or you notice that your dishwasher is not cleaning dishes properly, you may need to replace the rack wheel. The single rack roller kit is made of white plastic, and clips to the dishwasher rack with the included axle/clip. Many of our customers have described this repair as easy, and you will not require any tools to complete it. Lower rack roller and bracket assembly, grey. Wheel has been updated. If wheel pictured is not like old one, you may need to replace all wheels.",
  "rating": 4.5,
  "reviewCount": 6,
  "symptoms": [
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "CHRIS from ROANOKE, VA",
    "title": "Water leaking from Inlet Valve",
    "content": "Remove the bottom cover plate.  Disconnect the water inlet and black rubber hose.  Remove 2 mounting screws.  Pull out electrical connector.  Reverse order.  Be sure to get the brass inlet connector really tight so it won't leak.  I did the final tightning after the part is mounted.  Not a bad repair at all.  The only problem was that it leaked in the first place and messed up my subfloor and laminate flooring."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16745479-Frigidaire-5304532229-WHEEL-BUSHING-ASS.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16745479-Frigidaire-5304532229-WHEEL-BUSHING-ASS.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}