{
  "title": "Dishwasher INSULATING PART",
  "partUrl": "https://www.partselect.com/PS16746079-Bosch-11050210-INSULATING-PART.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$25.00",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS16746079",
  "manufacturerPartNumber": "11050210",
  "description": "Dishwasher INSULATING PART ★★★★★ ★★★★★ 3 Reviews PartSelect Number PS16746079 Manufacturer Part Number 11050210",
  "rating": 5,
  "reviewCount": 3,
  "symptoms": [],
  "installationInstructions": {
    "author": "Scott from MOUNT JULIET, TN",
    "title": "Pressure washer would not maintain pressure",
    "content": "Determined that the unloader valve was leaking.Removed the unloader valve from valve body.I could see a crack in the nylon portion of the valve. This would not let the relief valve operate.Went to the internet (Part Select) and found the replacement valve. There are a lot of different sizes of unloader valve. Partselect help me select the correct valve.The key was the valve body, the unloader valve inserts into the valve body. There are two types of valve bodies, a 4 bolt and a 5 bolt. They look the same but do not interchange. I needed the 4 bolt.I was nervous as the new unloader valve was a different construction than my old valve. It worked perfectly.Replacement was easy.Locate the unloader valve. It is part of the pump body. You can recognize it by the spring extending out from the valve body.Remove the “U” shaped clip that holds the unloader valve in the valve body. I used pliers to grab the spring and pulled the unloader valve from the valve body. It took a little pulling pressure to remove.Note the orientation of the unloader valve I. The valve body. You want to install the unloader valve with the same orientation.It may take a little force to seat the valve. I used a little silicone grease to lube the valve. A small tap on the end of the valve to insure it is fully seated. It has to be seated so the “U” shaped retaining clip can be inserted to hold the unloader valve in place. Again, a light tap was necessary to fully seat the clip.That was it, I was back operating my pressure washer"
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS16746079-Bosch-11050210-INSULATING-PART.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}