{
  "title": "Haier Dishwasher Rack Carrier Kit - Right or Left side",
  "partUrl": "https://www.partselect.com/PS16219735-GE-WD28X27241-Rack-Carrier-Kit-Right-or-Left-side.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$14.70",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS16219735",
  "manufacturerPartNumber": "WD28X27241",
  "description": "Haier Dishwasher Rack Carrier Kit - Right or Left side ★★★★★ ★★★★★ 6 Reviews PartSelect Number PS16219735 Manufacturer Part Number WD28X27241 This part is the replacement carrier roller for your dishwasher. It is also known as the wheel support. It is made of gray plastic and is approximately 5 inches by 2 inches. The carrier roller supports the wheels on your upper dish rack so it can slide in and out of the dishwasher efficiently. This part has been redesigned by the manufacturer. This part can now be used on the right or left side of the rack. Because it is made of plastic, the roller can occasionally crack and break, and when this occurs, it will need to be replaced. If you notice that your dish rack is having difficulty sliding in and out, you should check to see if the roller is damaged. This is an OEM part from the manufacturer and it is sold individually. The roller itself, is replacement part number WD12X26146. The cover is no longer needed when replacing the rack carrier kit.",
  "rating": 4.5,
  "reviewCount": 6,
  "symptoms": [],
  "installationInstructions": {
    "author": "Teri from LAGUNA NIGUEL, CA",
    "title": "order #16343054 Complete service rack",
    "content": "this was ordered 4-9-21 and I have yet to receive it. Its difficult to explain the installation when you haven't received the main part. I paid for this but you have not shipped it. Very poor customer service."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS16219735-GE-WD28X27241-Rack-Carrier-Kit-Right-or-Left-side.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}