{
  "title": "Amana Dishwasher Circulation Pump",
  "partUrl": "https://www.partselect.com/PS16744934-Whirlpool-W11612326-Circulation-Pump.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$69.99",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS16744934",
  "manufacturerPartNumber": "W11612326",
  "description": "Amana Dishwasher Circulation Pump ★★★★★ ★★★★★ 5 Reviews PartSelect Number PS16744934 Manufacturer Part Number W11612326 This circulation pump is a genuine OEM replacement part designed for use in dishwashers. It is responsible for circulating water throughout the dishwasher during the wash and rinse cycles. The circulation pump draws water from the dishwasher tub, pressurizes it, and then distributes it to the spray arms, which spray the water onto the dishes to remove food particles and debris. The circulation pump may fail due to several reasons such as an electrical fault, a blockage in the pump impeller, motor failure, or physical damage. A faulty pump will result in water leakages, unusually loud noises during use, reduced water circulation, and poor cleaning performance.",
  "rating": 4.8,
  "reviewCount": 5,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Will not fill with water"
  ],
  "installationInstructions": {
    "author": "Samoil from COOPER CITY, FL",
    "title": "The dish washer wasn’t cleaning dishes",
    "content": "The circulation pump is a super easy fix and the installation video parts select has on its website is accurate. I felt the most difficult part of the repair was removing the dishwasher from the kitchen counter to make the repairs. After you get the dishwasher out, you pretty much just pop the old pump out with your hands and a flat head screwdriver. (The supplied video is spot on ) Installing the new pump will require a pinch plier or a hose clamp. I chose a new hose clamp as it is cheaper and I would never use the pinch pliers after this job."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16744934-Whirlpool-W11612326-Circulation-Pump.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16744934-Whirlpool-W11612326-Circulation-Pump.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}