{
  "title": "Dishwasher Single Speed Drain Pump Kit",
  "partUrl": "https://www.partselect.com/PS16219695-GE-WD19X25187-Single-Speed-Drain-Pump-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$113.63",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS16219695",
  "manufacturerPartNumber": "WD19X25187",
  "description": "Dishwasher Single Speed Drain Pump Kit ★★★★★ ★★★★★ 30 Reviews PartSelect Number PS16219695 Manufacturer Part Number WD19X25187 This drain pump kit is for dishwashers. The drain pump kit removes the water from the dishwasher tub during the drain phase of the dishwashing cycle. The kit may include multiple parts; refer to your parts diagram for a complete list of parts included. Unplug the dishwasher and shut off the water supply before installing this part. Wear work gloves to protect your hands.",
  "rating": 4.53,
  "reviewCount": 30,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "dennis from GRAHAM, WA",
    "title": "Pump would not drain tub",
    "content": "Repair went fine, getting the right pump was the problem.  I started with my local appliance parts house, they ordered part came in 3 days.  Upon picking it up I noticed that the pump was shaped slightly different and the electrical hook up was totally different.  Asking the parts guy what happened he said they must have sent the wrong pump.  Returned it for credit and ordered it again.  Four days later the same exact thing occurs.   Parts guy credits my account and says better go directly to GE.  Wait 10 days for GE, for this part and once again same odd looking pump with wrong electrical plug. My son who is a welder by trade asks me if there is a packet of parts in carton and yes there is.  He says that perhaps there is a converter for the electrical.  That was the solution no one told us that pump was universal and needed the adapter.  Not even the 2 different tecks at first house.  Perhaps that should be stated in the part would have saved us tons of time.   Thanks   D"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16219695-GE-WD19X25187-Single-Speed-Drain-Pump-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16219695-GE-WD19X25187-Single-Speed-Drain-Pump-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}