{
  "title": "Hotpoint Refrigerator WATER VALVE WITH GUARD",
  "partUrl": "https://www.partselect.com/PS16226572-GE-WR57X33326-WATER-VALVE-WITH-GUARD.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$88.98",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS16226572",
  "manufacturerPartNumber": "WR57X33326",
  "description": "Hotpoint Refrigerator WATER VALVE WITH GUARD ★★★★★ ★★★★★ 80 Reviews PartSelect Number PS16226572 Manufacturer Part Number WR57X33326 This water inlet valve (Refrigerator Water Inlet Valve Assembly) supplies water to the ice maker and the water dispenser in your refrigerator. It is located at the back of the fridge, beneath the bottom panel. It is connected directly to 2 water supplies, a wiring harness, and your inlet water tube. This part is located at the back of the fridge, beneath the bottom panel. It is connected directly to 2 water supplies, a wiring harness, and your inlet water tube. Minerals and sediments can build up over time and cause a blockage in your inlet valve. They can also cause the valve to stick open, leading to an overflow of water. If this part is malfunctioning, water flow to your appliance could be compromised. Check for small ice cubes or a lack of ice cubes/water, as this is an obvious sign the part is damaged. The water inlet valve must be replaced if the solenoids no longer have continuity or the valve has internal blockage. Test your water inlet valve with a multimeter. You can test both the water dispenser side and the ice maker side. The part measures approximately 3 inches long and 2.75 inches wide and is constructed of plastic and metal. This replacement part features 1 dual inlet water valve with quick connections. It also has 1/4 and 5/16 John Guest fittings for the outlet lines and a 1/4 compression fitting for the inlet line.",
  "rating": 4.6,
  "reviewCount": 80,
  "symptoms": [
    "Ice maker not making ice",
    "Ice maker won’t dispense ice",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "ralph from bristow, VA",
    "title": "Refrigertor water dispenser not working BUT ice machine is working",
    "content": "The very first symptom here is important!  The door water dispenser is not working but the ice macine is working.  You may only have a frozen water tube in the door so do the following before diagnosing that your solenoid valve is bad: 1) the tube usually runs under the front of the refrigerator and usually has a quick disconnect.  Undo the connection and press the dispenser.  If water comes out of the tube you have a frozen or blocked tube in the door.  2) Immediately adjust the temperature in the freezer and warm the freezer compartment as much as you can without destroying the freezer contents.  Wait 24 hours.  This will usually unfreeze the line.  Do not waste your time with a hair dryer.  NOW, if this doesn't work and you are convinced you need to order and replace the solenoid, follow these steps. Assemble your tools first.  I needed a good ratchet set and a screwdriver.  A shop towel is helpful for spilled water.  A light is handy.  Pull out the refreigerator to gain access to the rear of the unit.  Unplug the power and close the water valve (older homes, you may need to actually shut the house water supply).  Remove the screws which hold the cover over the lower half of the refrigerator.  On the left you will see the solenoid.  It's always good to see that your new part matches the one you feel needs replaced.  They may not match perfectly due to changing design but they should be very similar.  One screw holds this part in place and access is very simple.  Now simply unplug the electrical connections.  In my case, one blue \"blade\" type connection (powering the water)  and one red \"blade\" type connection powering the ice maker.  They are not the same size and this coupled with the coloring means you will not accidently switch them.  pull the tubes clear of the solenoid.  This is simple and needs no explantion.  Grab your new solenoid and reattach both the electrical and water lines (two, remember, ice maker and drink dispencer).  Replace the single screw.  Re-attach the rear, lower refrigerator cover and go to the front of the unit to check the water.  You can listen carefully and hear the power engage from the new part bringing you water.  Clean up, replace the refrigerator back to its place and  look really tired when your wife sees that you worked \"so hard\"!  You probably saved at least $50-$80 from a service call which can now be used to take the family to dinner after your \"exhausting\" 15 minute workout of removing about 10 screws and wheeling the unit in and out of place.  Writing this article took longer!  My 4 year old worked harder holding the flash light!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16226572-GE-WR57X33326-WATER-VALVE-WITH-GUARD.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16226572-GE-WR57X33326-WATER-VALVE-WITH-GUARD.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}