{
  "title": "Refrigerator Electronic Control Board",
  "partUrl": "https://www.partselect.com/PS16619572-GE-WR55X38248-Electronic-Control-Board.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$212.75",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS16619572",
  "manufacturerPartNumber": "WR55X38248",
  "description": "Refrigerator Electronic Control Board ★★★★★ ★★★★★ 8 Reviews PartSelect Number PS16619572 Manufacturer Part Number WR55X38248 The main board assembly, also known as an electronic control board, is an authentic OEM replacement part used in refrigerators. It has dimensions of approximately 10 inches in by 6 inches. It controls the various features and function of the refrigerator such as temperature regulation, ice production, defrost control, and energy usage. If the control board is malfunctioning, you may notice temperature fluctuations, difficulties dispensing ice, a blank or unresponsive display panel and unusual noises such as clicking or humming. You can visually inspect the board for signs of damage or use a multimeter to test for continuity.",
  "rating": 5,
  "reviewCount": 8,
  "symptoms": [
    "Fridge and Freezer are too warm",
    "Fridge too warm",
    "Light not working"
  ],
  "installationInstructions": {
    "author": "Richard from CHEBOYGAN, MI",
    "title": "Refrigerator would warm up while freezer got colder",
    "content": "Repair man thought it was the control board and an issue with a relay on the board. Purchased the new board but found out the board was fine, and it was the recirculating fan that would go out intermediately.Tried ordering that part from Part Select since they have been great, but GE discontinued the part and their was not a replacement available.  After much research, found the new replacement part number and ordered that, it went in quickly and for now seems to have solved the problem."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16619572-GE-WR55X38248-Electronic-Control-Board.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16619572-GE-WR55X38248-Electronic-Control-Board.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}