{
  "title": "Dishwasher HEATER",
  "partUrl": "https://www.partselect.com/PS16555270-Whirlpool-W11537778-HEATER.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$64.04",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS16555270",
  "manufacturerPartNumber": "W11537778",
  "description": "Dishwasher HEATER ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS16555270 Manufacturer Part Number W11537778 This heating element is a genuine OEM replacement sourced directly from the original manufacturer for use in various models of dishwashers. The element is designed to heat water inside the dishwasher during the wash and rinse cycles to enhance the efficiency of the cleaning process. It is positioned at the bottom of the dishwasher tub, beneath the lower rack. The heating element includes a bushing, which is a protective covering that prevents water from coming into contact with the electric terminals, and two plastic nuts.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [
    "Leaking",
    "Not drying dishes properly"
  ],
  "installationInstructions": {
    "author": "Scott from ISLE, MN",
    "title": "Leaking Dishwasher",
    "content": "After pulling the dishwasher out, I was able to determine the leak was occurring around the plastic nuts on the end of the heating element. I removed the heating element and saw that even though there were washers on the ends that protruded through the backside of the machine, they really weren't sealing the holes the element was sticking through.  Looking at YouTube videos on the installation procedure, I noticed the element being installed had a sort of metal grommet permanently affixed to each end and the rubber washers were between the grommet and the dishwasher body.  I ordered the new part and saw this to be when I received the new part.  This grommet allowed the washer to seal the hole, once the plastic nuts were installed on the backside of the dishwasher.  This seems to have stopped the leak.  I don't know how the original part ever worked correctly, since the washers freely sat on the element with nothing to force them up against the body of the dishwasher and seal the holes. It may have been leaking long before I discovered the problem."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16555270-Whirlpool-W11537778-HEATER.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16555270-Whirlpool-W11537778-HEATER.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}