{
  "title": "LG Dishwasher Hose Drain Assembly",
  "partUrl": "https://www.partselect.com/PS16621806-LG-AEM74333104-Hose-Drain-Assembly.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$44.59",
  "originalPrice": "$68.17",
  "inStock": true,
  "partSelectNumber": "PS16621806",
  "manufacturerPartNumber": "AEM74333104",
  "description": "LG Dishwasher Hose Drain Assembly ★★★★★ ★★★★★ 3 Reviews PartSelect Number PS16621806 Manufacturer Part Number AEM74333104 This LG drain hose assembly is a genuine OEM replacement that is compatible with various LG washers. The assembly includes the hose and plastic connectors. The flexible rubber hose transports used water from the washer tub out into a dedicated drainage system such as a laundry sink or standpipe. The drain hose may become clogged, dislodged, or damaged by loose items like coins in the laundry or by hard impacts from outside. If the hose is faulty, you will likely notice standing water in the washer tub after a cycle, mold growth, leaking, or water overflow. It is recommended to replace the drain hose promptly if it is faulty to ensure the proper functioning of your washer.",
  "rating": 4.67,
  "reviewCount": 3,
  "symptoms": [
    "Leaking",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "Glen from LINESVILLE, PA",
    "title": "Dishwasher gave the Ne code",
    "content": "When I turned the dishwasher over I discovered the PS3579323 diverter motor had failed due to a leak around the PS3536016  valve, check. No use replacing the diverter motor without fixing the leak so I turned the machine back over and disassembled the spray arms and top of the pump cover which reveled the case assy and the valve, check. Upon removal of the valve, check I discovered hair wrapped around it which compromised the MO31 packing and caused the leak. I probably could have just cleaned out the hair and reassembled it but because my installation is a bit of a pain I elected to change the case assy (because of a slight depression where the packing sets) the M031 packing, the MO25 valve, check, and the MO35 pump gasket. After that was accomplished I turned the machine upside down and replaced the MO26 diverter motor and reinstalled the dishwasher. End result: Ne code cleared, no leaks and now the dishes are clean on the top shelf and the wife is happy. There are great instruction videos on YouTube. Good luck!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16621806-LG-AEM74333104-Hose-Drain-Assembly.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16621806-LG-AEM74333104-Hose-Drain-Assembly.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}