{
  "title": "Refrigerator Ice Maker Assembly",
  "partUrl": "https://www.partselect.com/PS16221322-Frigidaire-243297613-Ice-Maker-Assembly.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$99.21",
  "originalPrice": "$124.01",
  "inStock": true,
  "partSelectNumber": "PS16221322",
  "manufacturerPartNumber": "243297613",
  "description": "Refrigerator Ice Maker Assembly ★★★★★ ★★★★★ 31 Reviews PartSelect Number PS16221322 Manufacturer Part Number 243297613 This is a genuine Frigidaire part for your refrigerator. This is an ice maker, which connects to the water lines to provide fresh ice. The most common reason to replace this part is if your refrigerator is leaking, or it will not produce ice cubes. Be sure to disconnect the power to your refrigerator before beginning this repair.",
  "rating": 4.55,
  "reviewCount": 31,
  "symptoms": [
    "Ice maker not making ice",
    "Ice maker won’t dispense ice",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Richard from N CALDWELL, NJ",
    "title": "Ice maker was not working",
    "content": "Simple three steps... 1) There's an front section to the ice-maker to take off. One Phillips screw is on the side, one screw is underneath near the inside of the refrigerator wall.  Just unscrew and store.  2) There's a small plastic unit just inside the ice maker to take out. It's held in by a small nut that requires about a 4\" extension to reach. (You may be able to unscrew the nut with small needle-nose pliers). Just unscrew and take out the unit - the unit functions just to keep the ice maker wiring in place. 3) The wiring looks a mess, but there's just one wiring connector to the ice maker assembly. Unsnap it. The ice maker is not screwed in, it just slides in -- reach in and pull the assembly straight out; when it stops, lower it a bit and it will come free.   Reverse the instructions to install the new unit."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS16221322-Frigidaire-243297613-Ice-Maker-Assembly.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS16221322-Frigidaire-243297613-Ice-Maker-Assembly.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}