{
  "title": "Dishwasher DISPENSER ASM-IGD,BLUE WILLOW",
  "partUrl": "https://www.partselect.com/PS17629315-Whirlpool-W11705150-DISPENSER-ASM-IGD-BLUE-WILLOW.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$93.04",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS17629315",
  "manufacturerPartNumber": "W11705150",
  "description": "Dishwasher DISPENSER ASM-IGD,BLUE WILLOW ★★★★★ ★★★★★ 6 Reviews PartSelect Number PS17629315 Manufacturer Part Number W11705150 This detergent dispenser is an authentic replacement part sourced directly from the manufacturer to ensure compatibility with your dishwasher. The dispenser holds and releases detergent during the wash cycle. It has a lid that opens at the appropriate time in the wash cycle to release the detergent into the dishwasher. If the dispenser is faulty, it may be unable to open during the wash cycle, resulting in dishes not being properly cleaned or detergent residue remaining in the dispenser after the cycle has been completed. You may also notice leakage of detergent around the dispenser area. It is important to replace the dispenser promptly to avoid inefficient cleaning and detergent wastage",
  "rating": 4.83,
  "reviewCount": 6,
  "symptoms": [
    "Door latch failure",
    "Not cleaning dishes properly",
    "Will not dispense detergent"
  ],
  "installationInstructions": {
    "author": "Gloria from OCEAN CITY, NJ",
    "title": "Soap Dispenser door is broken",
    "content": "Open door and remove 12 T15 torx screws. Note that the 4 along the top edge are longer than the 8 along the sides. Lift the door panel upwards to remove the panel. Remove 6 screws securing the soap dispenser and metal bracket. Unplug the cable on the right side by pressing down on the locking tab. Note the position of the black plastic sheet that covers the back of the dispenser, and the white insulator on the right side. open the door part way and press down on the release for the dispenser on the outside of the door. The dispenser can now be removed from the inside of the door. Install the new dispenser and snap in place. Put the metal bracket back in place with the insulators and secure with the 6 screws. Re-install the shorter screws first, then the longer ones across the top."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS17629315-Whirlpool-W11705150-DISPENSER-ASM-IGD-BLUE-WILLOW.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS17629315-Whirlpool-W11705150-DISPENSER-ASM-IGD-BLUE-WILLOW.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}