{
  "title": "Frigidaire Dishwasher WHEEL&BUSHING ASY, UPPER,BLACK",
  "partUrl": "https://www.partselect.com/PS17219660-Frigidaire-5304535381-WHEEL-BUSHING-ASY-UPPER-BLACK.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$4.99",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS17219660",
  "manufacturerPartNumber": "5304535381",
  "description": "Frigidaire Dishwasher WHEEL&BUSHING ASY, UPPER,BLACK ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS17219660 Manufacturer Part Number 5304535381 The upper dishrack roller and axel kit comes with two pieces, a wheel and an axle. This kit is made for your dishwasher. Both pieces measure to be roughly one square inch each, they are made entirely of plastic, and are white in color. The purpose of these parts is to allow your dishrack to roll easily on the support rails. This kit is sold individually and contains only one wheel and one axle. Please order the required quantity for your repair. If your dishrack is having trouble rolling in and out you may need replace your rollers and axles.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [],
  "installationInstructions": {
    "author": "Terry from Pleasant View, UT",
    "title": "Top rack was dropping out of rollers/Slides",
    "content": "This was the second part of repair.  Left side was constantly falling out of the slide.  I replaced the same items as above minus the gasket and screw kit.  Once done, the right side was sloppy so I orders part for that side plus gasket which slid right in.  1. Removed stops on front end of Upper Dishrack Slide on    both sides.2. Removed Upper Dishrack3. Remove Roller and Axle/clip (4 each)4. Push Roller onto Axle on all 4 kits  5. Install all 4 roller kits on Upper Dishrack6. Remove stops from back end of Upper Dishrack Slides.7. Remove both Slides8. Remove 8 each Tub Wheels.9. Using old or new Screws and Washers, install new Tub Wheels.10. Install both Upper Dishrack Slides ensuring that small holes are toward the back.11. Install stops on the back end of Slides.12  Install Upper Dishrackinto slides13. Install front stops on slide14. Pulled out Gasket15. Install replaced Gasket"
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS17219660-Frigidaire-5304535381-WHEEL-BUSHING-ASY-UPPER-BLACK.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}