{
  "title": "Refrigerator Temperature Sensor",
  "partUrl": "https://www.partselect.com/PS1765215-Frigidaire-240597203-Temperature-Sensor.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$40.47",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS1765215",
  "manufacturerPartNumber": "240597203",
  "description": "Refrigerator Temperature Sensor ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS1765215 Manufacturer Part Number 240597203 This temperature sensor, also known as a thermistor, is responsible for preventing the evaporator within your refrigerator from overheating during its defrosting cycle. This sensor is compatible with various makes and models of refrigerator and is sold as an individual part. This sensor works with the electronic control board within your refrigerator to control the temperature by turning the compressor on or off. If your fridge is too warm or too cold, consider changing the thermistor with this genuine OEM part, and make sure to disconnect the power to the refrigerator before doing any repairs.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [
    "Freezer section too warm",
    "Fridge too cold",
    "Fridge too warm"
  ],
  "installationInstructions": {
    "author": "Cindy from AMARILLO, TX",
    "title": "My fridge temp was warm. Freezer temp was ok, but fluctuated some.",
    "content": "I checked the dampener, it worked. The compressor and fan worked. I knew because my freezer was still hovering around 10 degrees. Coils were clean. Thermistor was the only thing it could be. Took all my shelves out. Removed four screws. Took the back panel off. The thermistor sits tucked in on the side. I piped it out, in clipped it. Used my multimeter to test the numbers. Numbers were off just a bit. Ordered the part. Crossed my fingers.,took less then 5 minutes to put the part in. Plugged in the fridge. It was sitting at 33 degrees in about an hour and a half. I can’t believe I fixed it. I knew NOTHING about refrigerators. For how big my fridge is, it would have cost 3,000 and up to get a new one with the same cu ft size. Instead, it cost me $44. That includes shipping. Thank you Parts Select!! Made it so easy to pick the correct part for my model fridge!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1765215-Frigidaire-240597203-Temperature-Sensor.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1765215-Frigidaire-240597203-Temperature-Sensor.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}