{
  "title": "General Electric Refrigerator BUCKET AUGER",
  "partUrl": "https://www.partselect.com/PS17626595-GE-WR29X43990-BUCKET-AUGER.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$63.72",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS17626595",
  "manufacturerPartNumber": "WR29X43990",
  "description": "General Electric Refrigerator BUCKET AUGER ★★★★★ ★★★★★ 212 Reviews PartSelect Number PS17626595 Manufacturer Part Number WR29X43990 The ice bucket auger is located within the ice bucket assembly in your freezer. It stirs and dispenses the ice in the bucket. You may need to replace the auger if your ice maker is noisy, or not dispensing ice. Disassembly of the ice bucket assembly is necessary to replace this part. Turn off power to the appliance before removing the ice bucket assembly to do this repair.",
  "rating": 4.8,
  "reviewCount": 212,
  "symptoms": [
    "Engine revs but auger will not turn",
    "Engine runs but cutters do not turn",
    "Ice maker dispenses too little ice"
  ],
  "installationInstructions": {
    "author": "Tim from Newport News, VA",
    "title": "Plastic Auger blades broke in ice tray",
    "content": "I used a digital camera and photographed the assembled unit and the metal blades before I started the repair. Then, I removed the top screw on the clear shield. Flip over ice tray and removed two Phillips screws on bottom. Exterior plastic white cover comes off next. The cover sides have hard push-in white plastic tabs. Push them in; pry up top cover with small flathead screwdriver. Slide white top cover up and you will now see the metal blades and assembly. Auger is held in place with a metal c-clip and washer on the end. Use flat head screwdriver to pry off c-clip. Then you will see a nylon round slotted nut. The threads are reverse, use pliers and loosen nut. It is not that tight but pliers are needed. Then it all is loose and ready for removal. I slid all the blades off at one time and kept them stacked together. Slide out auger and clear flat shield cover. Install new auger, clear shield, and metal blade stack. When you put it all back together take a look at the long metal J-hook on the bottom make sure it is in the slot before you make everything tight. Failing to do this will prevent cubed ice from dispensing. It is not that hard to do the repair it just takes some patience and paying attention to details."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS17626595-GE-WR29X43990-BUCKET-AUGER.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS17626595-GE-WR29X43990-BUCKET-AUGER.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}