{
  "title": "General Electric Dishwasher MID SPRAY ARM",
  "partUrl": "https://www.partselect.com/PS17137080-GE-WD22X33498-MID-SPRAY-ARM.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$22.49",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS17137080",
  "manufacturerPartNumber": "WD22X33498",
  "description": "General Electric Dishwasher MID SPRAY ARM ★★★★★ ★★★★★ 10 Reviews PartSelect Number PS17137080 Manufacturer Part Number WD22X33498 This OEM mid spray or center wash arm assembly distributes water and detergent in your dishwasher during the wash cycle. It has small nozzles that spray water onto your dishes and is located between the lower and upper rack. A broken assembly will result in weak water flow and ineffective dishwashing. It may also display signs of damage such as cracks, breaks, or missing nozzles. Additionally, a malfunctioning assembly can cause imbalanced water flow, potentially leading to damage to other dishwasher components such as filters or pumps. Prompt replacement is necessary to ensure proper dishwashing performance and prevent further damage. To install this to your appliance, you will need to snap its mounting bracket onto the rack before attaching the arms onto it. This replacement part is sold individually.",
  "rating": 5,
  "reviewCount": 10,
  "symptoms": [
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "James from DELAND, FL",
    "title": "Knocking sound during wash cycle",
    "content": "Replace all three spray arms and knocking sound disappeared.Unscrewed counter clockwise old sprayer arms and lifted.  Replaced with new sprayer arms and noise disappeared."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS17137080-GE-WD22X33498-MID-SPRAY-ARM.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS17137080-GE-WD22X33498-MID-SPRAY-ARM.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}