{
  "title": "Dishwasher LOWER SPRAY ARM",
  "partUrl": "https://www.partselect.com/PS17137081-GE-WD22X33499-LOWER-SPRAY-ARM.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$19.70",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS17137081",
  "manufacturerPartNumber": "WD22X33499",
  "description": "Dishwasher LOWER SPRAY ARM ★★★★★ ★★★★★ 31 Reviews PartSelect Number PS17137081 Manufacturer Part Number WD22X33499 This lower spray arm assembly in your dishwasher distributes water and detergent during the washing cycle by spinning around and spraying water in different directions. You can usually find it attached to a support or hub at the bottom of the dishwasher. If this part is broken, you might notice some signs. You might hear a knocking or banging sound coming from the dishwasher. The spray arm may not rotate properly or might seem wobbly. It is important to replace a damaged arm assembly as your dishes will not get cleaned properly, and they will still have dirt on them even after a wash cycle. It can also cause the dishwasher to have a bad smell because of leftover food residue. To remove your existing arm assembly, you will need to release its locking mechanism before lifting it out of your appliance. Please be informed that this OEM-verified part is sold individually.",
  "rating": 4.81,
  "reviewCount": 31,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Mark De from BRONX, NY",
    "title": "Spray arm had become unattached and burned by the heat element",
    "content": "It was a simple as: attach and done! There is a ring on the part that tightens clockwise to the nipple that sprays out the water that it rests on. Twist clockwise and you are done! It is a mystery how it was unattached to begin with but not a problem in the end, it was easy to fix!Thanks for sending genuine GE parts!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS17137081-GE-WD22X33499-LOWER-SPRAY-ARM.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS17137081-GE-WD22X33499-LOWER-SPRAY-ARM.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}