{
  "title": "Refrigerator Condenser Fan Motor",
  "partUrl": "https://www.partselect.com/PS1766247-GE-WR60X10220-Condenser-Fan-Motor.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$51.98",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1766247",
  "manufacturerPartNumber": "WR60X10220",
  "description": "Refrigerator Condenser Fan Motor ★★★★★ ★★★★★ 44 Reviews PartSelect Number PS1766247 Manufacturer Part Number WR60X10220 This fan motor is most times used with frost-free refrigerators with a condenser coil. When the compressor runs, so does this fan, circulating air through the refrigerator grille, cooling the compressor and condenser coils. This fan motor also helps to evaporate excess water in the drain pan.",
  "rating": 4.91,
  "reviewCount": 44,
  "symptoms": [
    "Clicking sound",
    "Freezer section too warm",
    "Fridge and Freezer are too warm"
  ],
  "installationInstructions": {
    "author": "Jeffrey from Tampa, FL",
    "title": "My refrigerator began to overheat and the everything was thawing!!",
    "content": "My refrigerator began to overheat and the everything was thawing!! The condenser fan motor had seized and I thought this is something even I can replace.I did a Google search on the refrigerator model number. The link to your site looked promising and I clicked on it. I was taken to your web page for my refrigerator and I clicked on the schematic for the condenser assembly.The schematic had the parts I needed labeled clearly so this layman could be sure to get the right ones.I ordered the parts at 12:45PM Monday and selected overnight shipping. The parts arrived at 8:35AM Tuesday (Thank you FedEx). I installed the parts and my refrigerator is up and running again.To get to the condenser fan motor I took off the back panel on the fridge that covers the condenser, fan and coil. The fan/motor assembly is attached to a bracket I removed with two screws. Pulled the bracket assembly out of the back of the fridge, removed the fan blade and then the motor, and put the new motor on the bracket and stuck the new fan blade on the motor spindle. The trickiest part was getting the complete assembly back in. Just went slowly and took my time. Reconnected the wires,  no problems. I took pictures of everything that I disassembled BEFORE I disassembled it in case I wasn't sure how something went back in but this job was so simple I didn't need the pictures.I’m not sure how I could improve on this except maybe you could ship a refrigerator technician, too, to do the install.Thank you PartSelect everything worked out better than I could have hoped and I saved $220.00 compared to what a repair service was quoting."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1766247-GE-WR60X10220-Condenser-Fan-Motor.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1766247-GE-WR60X10220-Condenser-Fan-Motor.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}