{
  "title": "Refrigerator Condenser Fan Motor Kit",
  "partUrl": "https://www.partselect.com/PS1957416-Whirlpool-W10124096-Condenser-Fan-Motor-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$127.42",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1957416",
  "manufacturerPartNumber": "W10124096",
  "description": "Refrigerator Condenser Fan Motor Kit ★★★★★ ★★★★★ 45 Reviews PartSelect Number PS1957416 Manufacturer Part Number W10124096 This condenser fan motor kit includes a motor, fan blade, wire harness, and screws. Used in a refrigerator, the condenser fan motor moves the condenser fan blade to direct and move air across the condenser coil. Please note: The manufacturer has changed the appearance of the product from the original. The kit still functions the same as the original part. It is an OEM factory replacement. Make sure to unplug the refrigerator from the power source and wear gloves to protect your hands. Also, a helpful tip is to store food to prevent deterioration when the power is off.",
  "rating": 4.87,
  "reviewCount": 45,
  "symptoms": [
    "Clicking sound",
    "Freezer section too warm",
    "Fridge and Freezer are too warm"
  ],
  "installationInstructions": {
    "author": "Josue from Jacksonville, NC",
    "title": "Seven year old condenser fan was making noise when it was running.",
    "content": "The process to repair was very simple, I removed the back of the refrigerator to expose the motor area. I then removed three screws that held the condenser motor in place. once it was loose I detactched the electrical harness and removed the old motor. I then placed the new motor in place and secured it with the screws and reattached the new electrical harness that came with the new part. Once completed I reviewed it to make sure I didn't miss anything. I then replaced the cover over the motor area and enjoyed my success in repairing my own appliance with no added cost for labor, which would have been expensive I'm sure. The part purchased came with clear and consice instructions very easy to follow."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1957416-Whirlpool-W10124096-Condenser-Fan-Motor-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1957416-Whirlpool-W10124096-Condenser-Fan-Motor-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}