{
  "title": "Electrolux Refrigerator Air Filter",
  "partUrl": "https://www.partselect.com/PS1993820-Frigidaire-EAFCBF-Air-Filter.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$23.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS1993820",
  "manufacturerPartNumber": "EAFCBF",
  "description": "Electrolux Refrigerator Air Filter ★★★★★ ★★★★★ 19 Reviews PartSelect Number PS1993820 Manufacturer Part Number EAFCBF This manufacturer-approved air filter system for refrigerators eliminates odors and any impurities. It does this by neutralizing and removing odor-causing molecules. For best results, it is important to change the filter every 6 months to ensure that food is kept fresh, and the humidity is controlled. This part measures about 7 inches wide and 5 inches deep. Follow installation instructions provided by the manufacturer when installing this part to ensure accurate results and further guidance. Remember to unplug the refrigerator from the power source before starting this project. The air filter may be located in different places depending on your appliance, but is usually on the inner right or left side. See your manual for exact location. Our customers rated this as a very easy repair that takes only a few minutes; just locate and remove the old air filter and insert the new one to complete the repair, which requires no tools.",
  "rating": 4.63,
  "reviewCount": 19,
  "symptoms": [
    "Fridge too cold",
    "Fridge too warm",
    "Ice maker dispenses too little ice"
  ],
  "installationInstructions": {
    "author": "melvin from BASKING RIDGE, NJ",
    "title": "you r label (this end in arrow is wrong",
    "content": "placed filter in sideways"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1993820-Frigidaire-EAFCBF-Air-Filter.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1993820-Frigidaire-EAFCBF-Air-Filter.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}