{
  "title": "Dishwasher Water Inlet Valve - 120V 60Hz",
  "partUrl": "https://www.partselect.com/PS1990907-Frigidaire-154637401-Water-Inlet-Valve-120V-60Hz.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$25.69",
  "originalPrice": "$56.98",
  "inStock": true,
  "partSelectNumber": "PS1990907",
  "manufacturerPartNumber": "154637401",
  "description": "Dishwasher Water Inlet Valve - 120V 60Hz ★★★★★ ★★★★★ 45 Reviews PartSelect Number PS1990907 Manufacturer Part Number 154637401 This water inlet valve is usually located behind the lower kickplate panel in either the right or left corner of the dishwasher. The attaching solenoids on the valve open and close according to the desired amount of water needed. The water inlet valve on your dishwasher supplies water to the dishwasher. If your dishwasher is leaking because it has overflowed, the water inlet valve may be the cause. If your dishwasher continues to fill above the heating element, try opening the door latch to see if it stops filling. If it continues to fill, you have a defective inlet valve that will need to be replaced.",
  "rating": 4.44,
  "reviewCount": 45,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "CHRIS from ROANOKE, VA",
    "title": "Water leaking from Inlet Valve",
    "content": "Remove the bottom cover plate.  Disconnect the water inlet and black rubber hose.  Remove 2 mounting screws.  Pull out electrical connector.  Reverse order.  Be sure to get the brass inlet connector really tight so it won't leak.  I did the final tightning after the part is mounted.  Not a bad repair at all.  The only problem was that it leaked in the first place and messed up my subfloor and laminate flooring."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS1990907-Frigidaire-154637401-Water-Inlet-Valve-120V-60Hz.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS1990907-Frigidaire-154637401-Water-Inlet-Valve-120V-60Hz.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}