{
  "title": "Sharp Refrigerator Ice Dispenser Solenoid and Door Kit",
  "partUrl": "https://www.partselect.com/PS2003478-Whirlpool-12001991-Ice-Dispenser-Solenoid-and-Door-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$158.58",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS2003478",
  "manufacturerPartNumber": "12001991",
  "description": "Sharp Refrigerator Ice Dispenser Solenoid and Door Kit ★★★★★ ★★★★★ 13 Reviews PartSelect Number PS2003478 Manufacturer Part Number 12001991 In addition to the solenoid (115V), this kit also comes with a door strike and an ice door assembly. Please be advised the spring and roll pin are not included with this kit.",
  "rating": 4.31,
  "reviewCount": 13,
  "symptoms": [
    "Door Sweating",
    "Door won’t open or close",
    "Ice maker not making ice"
  ],
  "installationInstructions": {
    "author": "Scott from Walker, LA",
    "title": "Ice Dispenser \"round chute\" broken side tab, ice/water fountain not working",
    "content": "I could see that a tab was broken from the round chute that opens for ice dispensing and closes to seal off freezer ice chute when not in use. With the tab broken, the round door would not shut to seal the freezer chute and dispensing water would spatter everywhere.  I looked for just the round door part, but is only sold in the \"Ice dispenser solenoid and door kit\"  I only had to use the round chute/flap from the kit.  The instructions were easy to follow and I had the fridge back working in about 10 minutes.  It took me longer to find the right star headed screwdriver that I needed to remove the Maytag star screws (5) total.  Because I didn't have to replace the solenoid or the spring mechanism, this was especially easy, and now I have those parts on hand if one day I need them!!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2003478-Whirlpool-12001991-Ice-Dispenser-Solenoid-and-Door-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2003478-Whirlpool-12001991-Ice-Dispenser-Solenoid-and-Door-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}