{
  "title": "Caloric Refrigerator Replacement Ice Maker",
  "partUrl": "https://www.partselect.com/PS2121513-Whirlpool-D7824706Q-Replacement-Ice-Maker.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$89.89",
  "originalPrice": "$115.96",
  "inStock": true,
  "partSelectNumber": "PS2121513",
  "manufacturerPartNumber": "D7824706Q",
  "description": "Caloric Refrigerator Replacement Ice Maker ★★★★★ ★★★★★ 154 Reviews PartSelect Number PS2121513 Manufacturer Part Number D7824706Q This ice maker (Ice Maker Assembly, Refrigerator Ice Maker) produces ice cubes that are ejected into the storage bucket. It is located in the freezer section of your appliance, mounted on the freezer wall. The ice maker can break from normal wear and accidental damage. If this happens, your refrigerator may no longer make ice cubes, or may not make enough cubes, and the part should be replaced. This model measures approximately 11 inches long and 5 inches wide. It’s constructed of plastic and metal, and comes in black/white/silver. This assembly includes the ice mold and the control device.",
  "rating": 4.73,
  "reviewCount": 154,
  "symptoms": [
    "Clicking sound",
    "Doesn’t stop running",
    "Ice maker dispenses too little ice"
  ],
  "installationInstructions": {
    "author": "Bernie from Diamond Bar, CA",
    "title": "Icemaker producing few or no cubes and often leaving \"kling-ons\" on ice tray",
    "content": "Interior surface of ice tray felt rough & flaky (coating deteriorated) so cubes would not release.Unplug appliance.Remove timer cover by hand pressure @ edge.Remove single attachment screw & bracket at lower front of icemaker.Disconnect wiring harness from socket @ rear of compartment.Tricky part was determining what type of connection held the other two attachment points along the long edge of the icemaker. I did not have repair manual or useful drawing but looked @ PartsDirect pic of side brackets & used a small mirror to confirm that mine were also some sort of \"snap in\" attachment.Remove icemaker unit by pushing upward and outward on the unit. I takes a good bit of pressure and will pop loose, but be careful not to break attachment bracket from freezer wall.Scavenge shut off bar and wiring harness from old icemaker once you have it out & attach to new one before installing it back in freezer.Again, you might find a mirror useful to align those pesky snap-in brackets with the new unit.Since you probably kept your freezer running while waiting for the part, the plastic snap-ins will be cold and brittle. I warmed them up first by applying a dampened cloth heated in the microwave to make them a little more pliable.A good push of the new unit towards the snap-ins along with some upward force will get it stable.Reattach the metal screw in bracket & connect the wiring harness to rear plug... and don't forget to plug the whole thing back in.It will take awhile for the first batch of cubes dump as the timer may need to cycle completely around to get to the fill cycle... be patient.Dump the first couple of batches of cubes just to make sure you're free of any residue."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2121513-Whirlpool-D7824706Q-Replacement-Ice-Maker.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2121513-Whirlpool-D7824706Q-Replacement-Ice-Maker.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}