{
  "title": "Litton Refrigerator Door Closure Cam Kit",
  "partUrl": "https://www.partselect.com/PS2168612-Whirlpool-R0181181-Door-Closure-Cam-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$11.09",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS2168612",
  "manufacturerPartNumber": "R0181181",
  "description": "Litton Refrigerator Door Closure Cam Kit ★★★★★ ★★★★★ 17 Reviews PartSelect Number PS2168612 Manufacturer Part Number R0181181 This door closing cam kit is intended for use on the bottom of your refrigerator and freezer door hinges. The cam helps close the doors and to lifts them slightly when opened. If your door will not open or close, or will not stay closed, there could be an issue with the door close cam. Other common symptoms associated with the door close cam are: the door is sweating, the fridge is too warm, or a clicking sound can be heard coming from the door. If your refrigerator has an ice and water dispenser, you will need to disconnect the power and water to the unit before you begin the repair.",
  "rating": 4.18,
  "reviewCount": 17,
  "symptoms": [
    "Clicking sound",
    "Door Sweating",
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Russ from Asheville, NC",
    "title": "Door would not close",
    "content": "After emptying the refrig. door,  I unscrewed the plate on the top of the refrigerator that covered the door bolts. Then off with the three bolts. I removed the door by lifting it up a few inches. The two parts of the door cam were easily removed and replaced with the new part. BEFORE REPLACING the door spread vasoline on both cam parts. (Not after as I did. The second time you do any of these repairs go SO much better :o)After putting the door back on, adjust the tension of the screws holding the door in place if needed to align the door on the cams so that it shuts completely. Failure to do this will require taking the top off the door again. (see comment above on \"... second time...\") If all is properly aligned, the door should swing completely shut. Even with the mistakes that required removing the door to lubricate the cams, and removing it AGAIN to readjust the screws on the top to properly align the door on the cams, this was a twenty minute job. My wife and I were still speaking to one another at the end of it- a sure sign of an easy repair."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2168612-Whirlpool-R0181181-Door-Closure-Cam-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2168612-Whirlpool-R0181181-Door-Closure-Cam-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}