{
  "title": "Refrigerator Defrost Timer",
  "partUrl": "https://www.partselect.com/PS2168038-Whirlpool-R0168027-Defrost-Timer.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$101.62",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS2168038",
  "manufacturerPartNumber": "R0168027",
  "description": "Refrigerator Defrost Timer PartSelect Number PS2168038 Manufacturer Part Number R0168027 This refrigerator defrost timer will cycle for twenty-seven minutes after every ten hours of run time. It comes with 2 screws and 2 nuts.",
  "rating": 0,
  "reviewCount": 0,
  "symptoms": [
    "Fridge too warm",
    "Will Not Start"
  ],
  "installationInstructions": {
    "author": "John from Navarre, FL",
    "title": "Freezer on side by side fridge would freeze up and stop refrigerator from working",
    "content": "The defrost timer was mounted in refridgerator by the temp. control. Just two mounting screws to remove. Tested this part as discribed in trouble shooting section. It needed to be replaced. Also found the defrost elements behind the rear wall of freezer, they were the glass tube type one was clearly blown. The freezer coils were a solid block of ice. No way the air could flow into refridgerator part. used a hair dryer to defrost also used a thicker wire ot unclog the drian that leads to pan under fridge. this one had two glass tube heaters that wear held in with two screws each. just unplug wires. I also replaced the thermostat since it was right there and it was the only other part listed that could cause the freeze up. bottom line its like i have a brand new side by side fridge. These kind are like $1500 to replace. So for $99 in parts and and hour or work I got my fridge back. Thanks for your help and getting the right parts here in just a couple of days."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2168038-Whirlpool-R0168027-Defrost-Timer.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2168038-Whirlpool-R0168027-Defrost-Timer.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}