{
  "title": "Crosley Refrigerator Crisper Cover Support - Front",
  "partUrl": "https://www.partselect.com/PS2358880-Frigidaire-241993101-Crisper-Cover-Support-Front.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$3.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS2358880",
  "manufacturerPartNumber": "241993101",
  "description": "Crosley Refrigerator Crisper Cover Support - Front ★★★★★ ★★★★★ 79 Reviews PartSelect Number PS2358880 Manufacturer Part Number 241993101 This crisper cover front support is used to keep the crisper shelf in place and may need replacing if the door will not open or close. This white, OEM part measures roughly 1 inch in diameter and can be used for the front and the rear support, as designed by the manufacturer, and mounts to the inside cabinet wall. Replacing this part is an easy repair, and will require a small flat blade screwdriver, a putty knife, and a soft hammer. Remove the crisper and shelf from the refrigerator before replacing the support. The crisper cover front support is held in place with a locking pin. To remove the old part, you will first need to push the pin into the interior of the cabinet using the screwdriver, and then you can pull the support out with a putty knife. If you cannot get the pin out you can use a flat-blade screwdriver to push it down and out of sight and it will not harm anything in your refrigerator After removing the pin and attaching the new support, simply use the soft hammer to lock the new pin in place.",
  "rating": 4.78,
  "reviewCount": 79,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Peter from Amherst, NY",
    "title": "Support studs were broken",
    "content": "Used pliers to remove the residual broken stud that was still attached to the wall of the refrigerator, and then just  pushed the new part in place.  The longest time was spent in removing the food and crisper drawers."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2358880-Frigidaire-241993101-Crisper-Cover-Support-Front.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2358880-Frigidaire-241993101-Crisper-Cover-Support-Front.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}