{
  "title": "Crosley Refrigerator Water Filter",
  "partUrl": "https://www.partselect.com/PS2364646-Frigidaire-ULTRAWF-Refrigerator-Water-Filter.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$64.97",
  "originalPrice": "$84.19",
  "inStock": true,
  "partSelectNumber": "PS2364646",
  "manufacturerPartNumber": "ULTRAWF",
  "description": "Crosley Refrigerator Water Filter ★★★★★ ★★★★★ 69 Reviews PartSelect Number PS2364646 Manufacturer Part Number ULTRAWF This genuine PureSource Ultra water filter will fit most Frigidaire french door and side by side refrigerators. You will find this filter located in the back, top right of the appliance. It is white in color and the filter has a polypropylene plastic housing and extruded carbon block filter media. Certified by NSF/ANSI to reduce contaminants that may be in your household water supply by 99.8 percent. The operating temperature for this filter is 33-100 degrees Fahrenheit, the flow rate is 0.5 GPM, the working pressure is 30-100 PSI, and it has a micron rating of 1. This filter should be replaced every six months or when the indicator lights up red. Installation is quick and easy. Push on the end face of the older filter to allow it to release. Remove and discard the old filter. Slide the new filter into the housing and press it down until it locks into place. Be sure to run water through the dispenser for about three minutes to prime the filter before use. Discard this water or use it to water plants. Do not forget to reset the indicator by pressing it down for 3-10 seconds. Review the use and care guide before you install for more detailed instructions.",
  "rating": 4.42,
  "reviewCount": 69,
  "symptoms": [
    "Ice maker dispenses too little ice",
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "Wayne from Homosassa, FL",
    "title": "needed to replace filter",
    "content": "push in old filter, turned to the left and filter came out. Pushed in new filter and it clicked into place. Very easy to do."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2364646-Frigidaire-ULTRAWF-Refrigerator-Water-Filter.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2364646-Frigidaire-ULTRAWF-Refrigerator-Water-Filter.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}