{
  "title": "Dishwasher Door Handle Actuator",
  "partUrl": "https://www.partselect.com/PS2337860-GE-WD13X10045-Door-Handle-Actuator.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$39.29",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS2337860",
  "manufacturerPartNumber": "WD13X10045",
  "description": "Dishwasher Door Handle Actuator ★★★★★ ★★★★★ 7 Reviews PartSelect Number PS2337860 Manufacturer Part Number WD13X10045 This is a handle actuator for your dishwasher. It is made of black plastic, and is sold individually. The handle actuator is found in the control panel, and it releases the door latch when you lift the handle. If your current handle actuator is cracked or broken, you may not be able to open your dishwasher door, or the door will not close properly. The dishwasher also may not be able to start, and if this is the case, you will need to replace this part.",
  "rating": 4.57,
  "reviewCount": 7,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Will Not Start"
  ],
  "installationInstructions": {
    "author": "Stephen from Houston, TX",
    "title": "Door handle actuator was broken.",
    "content": "I removed the screws on the inside of the door assembly, which allows the inside of the door to seperate from the outside. The escuchen (control panel) was easy to remove - the handle actuator is inside the control panel. The handle assembly was easy to take apart and re-assemble with the new handle and spring. I then inserted the control panel back into the outside door and reattached all of the screws with a power drill.  This was a repair that a GE-authorized service tech told me was going to be over $540 - he claimed the control panel and door handle/actuator was a single assembly. In the end this repair cost me $14 in parts and 15 minutes of time.  I complained to GE Consumer Affairs and they rebated the tech house call back to me in 5 business days."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2337860-GE-WD13X10045-Door-Handle-Actuator.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2337860-GE-WD13X10045-Door-Handle-Actuator.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}