{
  "title": "Tappan Refrigerator Defrost Thermostat",
  "partUrl": "https://www.partselect.com/PS2350702-Frigidaire-297216600-Defrost-Thermostat.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$23.12",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS2350702",
  "manufacturerPartNumber": "297216600",
  "description": "Tappan Refrigerator Defrost Thermostat ★★★★★ ★★★★★ 33 Reviews PartSelect Number PS2350702 Manufacturer Part Number 297216600 This refrigerator defrost thermostat is a genuine OEM part and is sourced directly from the manufacturer. Located on the back wall of the freezer section in the refrigerator, the defrost thermostat is used to regulate the appliances temperature to keep the refrigerator cold and constant. The part is made of plastic, and has a 4 inch terminal on the white lead and a 6 inch terminal on the red lead. A refrigerator defrost thermostat may need to be replaced if the appliance is experiencing temperature related issues such as: too cold, too warm, frost buildup, not running, or running too long.",
  "rating": 4.73,
  "reviewCount": 33,
  "symptoms": [
    "Doesn’t stop running",
    "Freezer not defrosting",
    "Freezer section too warm"
  ],
  "installationInstructions": {
    "author": "Roger from Orangevale, CA",
    "title": "freezer would not defrost",
    "content": "My freezer would freeze up and not allow cold air to refrigerator side. First I took off bottom face plate, located the timer on left side bottom, removed the two screws and unpluged the timer. Replaced the timer with new one. Second I removed all food from freezer. Took of back of freezer wall with nut driver. Located the thermostat which was very easy to remove. Just one clip holding thermostat. Unplugged the two wires from the old thermostat and plugged in new wires. Thanks to Partselect.com, the parts were an exact match. Very easy to do. Saved my tons of money. Freezer and refer works like new."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2350702-Frigidaire-297216600-Defrost-Thermostat.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2350702-Frigidaire-297216600-Defrost-Thermostat.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}