{
  "title": "Hotpoint Dishwasher RACK SLIDE END CAP",
  "partUrl": "https://www.partselect.com/PS2370502-GE-WD12X10304-RACK-SLIDE-END-CAP.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$12.61",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS2370502",
  "manufacturerPartNumber": "WD12X10304",
  "description": "Hotpoint Dishwasher RACK SLIDE END CAP ★★★★★ ★★★★★ 52 Reviews PartSelect Number PS2370502 Manufacturer Part Number WD12X10304 The Rack Slide End Cap is a white one-inch plastic part which replaces the end cap for your dishwasher rack, preventing your rack from sliding too far. If you find the dish rack is causing the door to not close properly, it may be due to the part being worn out or damaged. All you need to complete this repair is a small flat blade screw driver. Simply pop out the cap with a smaller flat-blade screwdriver and snap the new one into place. If the rear cap needs to be replaced you will need to remove both front caps and slide the rack completely off for full access. It is important to note that this part is sold individually, and more than one may be required, depending on your repair. An inexpensive part, it can be a good idea to purchase several at a time to have on-hand when needed.",
  "rating": 4.67,
  "reviewCount": 52,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Joseph from Haymarket, VA",
    "title": "Worn/broken plastic parts were causing misery",
    "content": "Order arrived two days after being placed.  Super easy to remove the old, worn, broken plastic parts and replace with new.   Everything popped right on just as shown in the diagram.   Our happiness with our dishwasher has increased 100%.     BTW, thanks to the very helpful, friendly and knowledgeable staff at PartSelect.com -- next job, replace the ice maker in the freezer!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2370502-GE-WD12X10304-RACK-SLIDE-END-CAP.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2370502-GE-WD12X10304-RACK-SLIDE-END-CAP.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}