{
  "title": "Electrolux Refrigerator Upper or Lower Mullion Hinge Pin",
  "partUrl": "https://www.partselect.com/PS2358752-Frigidaire-241779401-Upper-or-Lower-Mullion-Hinge-Pin.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$21.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS2358752",
  "manufacturerPartNumber": "241779401",
  "description": "Electrolux Refrigerator Upper or Lower Mullion Hinge Pin ★★★★★ ★★★★★ 4 Reviews PartSelect Number PS2358752 Manufacturer Part Number 241779401 This mullion hinge pin is a genuine OEM replacement part, measuring 1.5 inches by 1.25 inches by 0.85 inches. It is specially designed to secure the mullion in refrigerators, allowing it to pivot and ensure smooth door movement. The mullion acts as a barrier between the refrigerator and freezer to maintain the desired temperatures for each section. A damaged or loose hinge pin will result in temperature fluctuations, frost buildup along the door edges, and difficulties opening and closing the door. Therefore, it is important that you replace the pin as soon as it is no longer functioning. Note that your appliance may require two hinge pins, one near the top of the mullion and one near the bottom. Remove the mullion cover, detach the hinge pin, and install a the new one into the hinge assembly. Place the cover back on and verify that the hinge assembly is working by carefully opening and closing the refrigerator doors to check that they are moving smoothly. Each sold individually.",
  "rating": 2.75,
  "reviewCount": 4,
  "symptoms": [
    "Door Sweating",
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Bernard from NEW WINDSOR, NY",
    "title": "1 Broken plastic mullion hinge. Mullion was not operating correctly.",
    "content": "Removed screw on Mullion so that the replacement hinge can slide onto the small plastic bracket on the door. Slid the mullion on the hinges and screwed in muliion (1 screw)."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2358752-Frigidaire-241779401-Upper-or-Lower-Mullion-Hinge-Pin.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2358752-Frigidaire-241779401-Upper-or-Lower-Mullion-Hinge-Pin.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}