{
  "title": "Kelvinator Refrigerator Door Gasket",
  "partUrl": "https://www.partselect.com/PS2331952-Frigidaire-241872513-Refrigerator-Door-Gasket.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$113.89",
  "originalPrice": "$142.36",
  "inStock": false,
  "partSelectNumber": "PS2331952",
  "manufacturerPartNumber": "241872513",
  "description": "Kelvinator Refrigerator Door Gasket ★★★★★ ★★★★★ 66 Reviews PartSelect Number PS2331952 Manufacturer Part Number 241872513 This fresh food door gasket is used to seal the refrigerator door when closed to keep the cool air inside and the room air outside.",
  "rating": 4.64,
  "reviewCount": 66,
  "symptoms": [
    "Door Sweating",
    "Door won’t open or close",
    "Fridge and Freezer are too warm"
  ],
  "installationInstructions": {
    "author": "Matthew from Washington, DC",
    "title": "Refrigerator door gasket torn",
    "content": "No instructions included, so it took a little bit of staring at the new part to figure out how it works. The barbed ridge on the gasket fits into a slot on the door. The flat face of the gasket has an internal magnetic strip that helps keep the seal tight against the steel face of the refrigerator. Installation requires no tools. This is the basic process:1) Unbox the new gasket and get it ready to install so you don't have to leave the fridge open too long.2) Open the door and grab the old gasket at one of the corners and pull away. This will unseat the barbed ridge I mentioned above. Work your way around the door until the whole gasket is free.3) Set aside the old gasket4) Grab a moistened paper towel and wipe down the (now exposed) sealing surface of the fridge and door. 5) Align the new gasket in the door and start pushing the barb into place. I found that the new gasket seemed slightly oversize compared to the original, so it took a little tweaking. What worked for me was to get all the corners seated, then work my way around the door making sure the gasket is fully seated.6) Once you have the new gasket installed, close the door to make sure everything fits OK.7) Open the door again and run your finger along the inside edge of the gasket seal. What you want to do is fold the edge of the gasket down so it lays flat against the outer wall of the door. 8) Shut the door and look from the sides and top to try to spot any gaps. You should be able to poke the gasket from the side and get the magnet strips to click into place. It seems like after a day or so the gasket 'relaxed' and I didn't have to worry about this anymore.9) Dispose of the old gasket. I was able to pull the gasket into four pieces (separating at the corners) so it would fit in my city trash can..."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS2331952-Frigidaire-241872513-Refrigerator-Door-Gasket.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS2331952-Frigidaire-241872513-Refrigerator-Door-Gasket.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}