{
  "title": "Dishwasher Hinge Arm Link",
  "partUrl": "https://www.partselect.com/PS259336-GE-WD14X10009-Hinge-Arm-Link.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$8.54",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS259336",
  "manufacturerPartNumber": "WD14X10009",
  "description": "Dishwasher Hinge Arm Link ★★★★★ ★★★★★ 9 Reviews PartSelect Number PS259336 Manufacturer Part Number WD14X10009 The hinge link on your dishwasher connects the spring to the dishwasher door hinge. If the hinge link becomes cracked or damaged, you may not be able to shut or lock your dishwasher door properly. In this case, you will need to replace the hinge link. Pull out your dishwasher to inspect the hinge and spring, if the link is broken, it may be disconnected and on the ground already. If not, you can remove the hinge arm link by simply disconnecting it from the hinge and spring, then replacing it with the new part. The hinge arm link is a small piece of white plastic about an inch and a half long. It is sold individually, and is an OEM part from the manufacturer.",
  "rating": 4.67,
  "reviewCount": 9,
  "symptoms": [
    "Door latch failure",
    "Door won’t close"
  ],
  "installationInstructions": {
    "author": "Margaret from Meridian, MS",
    "title": "plastic hinge arm link broke causing door to flop open",
    "content": "First I had to unscrew screws under the counter then pulled built in dishwasher out from under the counter, attached hing arm link to right side bracket on door, and the other end I attatched to a spring at the back of the unit.  Thats it! and pushed the dishwasher back into place. All back to normal....by the way Im a 67 yr old great grandmother..."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS259336-GE-WD14X10009-Hinge-Arm-Link.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS259336-GE-WD14X10009-Hinge-Arm-Link.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}