{
  "title": "Dishwasher Motor and Pump Kit",
  "partUrl": "https://www.partselect.com/PS260801-GE-WD26X10013-Motor-and-Pump-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$216.84",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS260801",
  "manufacturerPartNumber": "WD26X10013",
  "description": "Dishwasher Motor and Pump Kit ★★★★★ ★★★★★ 9 Reviews PartSelect Number PS260801 Manufacturer Part Number WD26X10013 This is a pump and motor kit for your dishwasher. This assembly replaces many old-style pump and motor kits that were manufactured since 1970. The instructions are included with this kit in to assist you. Take note that this is a completely redesigned kit by the manufacturer and now includes the drain solenoid. You may need to replace this part is if your appliance is leaking, not draining properly, noisy, or will not start or clean your dishes properly.",
  "rating": 4.33,
  "reviewCount": 9,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Mark from Morgan Hill, CA",
    "title": "Water not draining from dishwasher",
    "content": "I had never done work on my dishwasher - I was a rookie in this area. Turns out the work itself was quite simple. Pulled the dishwasher out, turned it over, and was able to easily replace the motor and pump assembly. The drain tube was also an easy replace. A couple key notes:1. I also purchased a new drain solenoid and impeller kit. Note that both of these items are already included in the Motor and Pump kit replacement. There is no need to by both, now I have extras.2. The end of the drain tube has to be trimmed if you are routing the drain tube to an air gap mounted on your kitchen sink. You have to cut the large diameter end of the tube to get to the narrow portion that will fit on your air gap.3. The first cycle you run with the new motor/pump assembly is noisy. When you first fire it up the components in the pump are all dry, and they squeal until the water gets to them. I initially thought I had done something wrong, but once the water started flowing all the peculiar sounds cleared up."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS260801-GE-WD26X10013-Motor-and-Pump-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS260801-GE-WD26X10013-Motor-and-Pump-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}