{
  "title": "Refrigerator Defrost Heater",
  "partUrl": "https://www.partselect.com/PS303768-GE-WR51X10038-Defrost-Heater.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$75.70",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS303768",
  "manufacturerPartNumber": "WR51X10038",
  "description": "Refrigerator Defrost Heater ★★★★★ ★★★★★ 3 Reviews PartSelect Number PS303768 Manufacturer Part Number WR51X10038 Also known as Heater Conduction.",
  "rating": 5,
  "reviewCount": 3,
  "symptoms": [
    "Freezer not defrosting",
    "Freezer section too warm",
    "Fridge too warm"
  ],
  "installationInstructions": {
    "author": "Scott from Pratt, KS",
    "title": "Freezer cold, but Refrigerator not cooling.  Iced up coils.",
    "content": "After determining that it was the defrost system, I ordered the thermostat.  Make sure you look closely.  Mine had two thermostats, and so I had to wait a couple of days for the extra part.1.  Remove ice maker if installed.2.  Remove center casing on ceiling and back wall.  There may be two screws that need removed.3.  Locate and remove two screws on upper back wall.4.  Remove back wall carefully, revealing coil system.5.  If this was the problem, the coils will be iced over and need thawed.  Either time or a hair dryer...6.  The thermostats clip onto the copper tubing, simply pull them off, keeping close attention to the color of the wires.7.  Be very careful touching the bottom of the coils as the defrost conductor coils are along the bottom and encased in easily breakable glass.  If you need to replace this as well, remove the center brace (wire)by pulling towards you and then down.  remove wire attachments at both ends and rotate coil out of end braces.8.  Replacing thermostats...you must CUT the wires, and attach new thermostats with wire couplers or wire nuts and then wrap with electrical tape that is rated for the cold.9.  Re-attach all parts and replace back wall and coverings.10.  Enjoy!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS303768-GE-WR51X10038-Defrost-Heater.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS303768-GE-WR51X10038-Defrost-Heater.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}