{
  "title": "RCA Refrigerator Defrost Timer - 120V 60Hz",
  "partUrl": "https://www.partselect.com/PS310869-GE-WR9X502-Defrost-Timer-120V-60Hz.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$93.21",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS310869",
  "manufacturerPartNumber": "WR9X502",
  "description": "RCA Refrigerator Defrost Timer - 120V 60Hz ★★★★★ ★★★★★ 7 Reviews PartSelect Number PS310869 Manufacturer Part Number WR9X502 This defrost timer will cycle for 25 minutes after every six hours of run time. The timer itself is made of plastic, and its terminals are bent, the leads are internal, and the label is orange. If you notice that your fridge is too warm, the fridge is running for a long time or is leaking, it could be due to the defrost timer becoming inactive. The defrost timer is found underneath the light cover (may need to remove lightbulb) and will need to be removed along with the air inlet assembly and housing.",
  "rating": 4.14,
  "reviewCount": 7,
  "symptoms": [
    "Freezer not defrosting",
    "Freezer section too warm",
    "Freezer too cold"
  ],
  "installationInstructions": {
    "author": "Wanda from Cabins, WV",
    "title": "refrigerator was not cooling but the freezer worked fine.",
    "content": "My husband put on the defrost timer.  At first I thought  the part was not going to fix the problem.   After about 5 hours my refrigerator was still warm.  I went to work and when I got home that evening my refrigerator was cooling and down to 28 degrees.  So if you replace this part wait at least 12-24 hours.  Give it time to stablize.  My husband says it has to go through its cycle.  It works on a 24 hour timer.  My refrigerator is working fine and this has saved me alot of money.  My husband says, once you put on the timer you may have to use a flat screwdriver and turn the small dial clockwise one click to start it.  He removed the kick grill and replaced the part.  Dont forget to shut breaker off to replace this part. Turn power back on and start the timer.  We are so happy that we now have a working refrigerator."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS310869-GE-WR9X502-Defrost-Timer-120V-60Hz.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS310869-GE-WR9X502-Defrost-Timer-120V-60Hz.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}