{
  "title": "Refrigerator Defrost Timer",
  "partUrl": "https://www.partselect.com/PS310858-GE-WR9X489-Defrost-Timer.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$50.67",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS310858",
  "manufacturerPartNumber": "WR9X489",
  "description": "Refrigerator Defrost Timer ★★★★★ ★★★★★ 13 Reviews PartSelect Number PS310858 Manufacturer Part Number WR9X489 This device acts like a clock. It continually advances and alternates between activating the cooling cycle and the defrost heater.",
  "rating": 4.54,
  "reviewCount": 13,
  "symptoms": [
    "Freezer not defrosting",
    "Freezer section too warm",
    "Freezer too cold"
  ],
  "installationInstructions": {
    "author": "Richard from West Alton, MO",
    "title": "Freezer was still simi-cold but refrigerator was not.",
    "content": "Called a friend that lead me down the right path so i did a search for the part's and found this site. The trouble shooting that outher's had done was the same as mine, I descovered that the coil's in the freezer had frozen up complety. They are located behind a plasic cover in the freezer area, it had frozen up due to the Defrost heater element being defective, when i took it out it was black and burnt looking,It is located at the bottom edge of the coils,2 bolt's and a plug in on each side. That is probally the only part i needed but i went ahead and replaced the sensor and timer also.The sensor wires in the freezer( located on the very top of the coils) had to be cut and the new ones spliced in, only 2 wires and easy access. I also put shrink wrap on the splices to protect them from mosisture. The timer was located in the fridge area by the temp. control knobs. 2 small bolts and a plug in was all on it. It's been 5 day's and so far so good. The worst part was defrosting the frozen coils. This was done with the wife's hair dryer and a couple towel's to soak up the water. Don't just let the water go down the drain hole because the tray that catches it will not hold all the water from the frozen coil's. Just a reminder, don't forget to unplug the unit when working on it. Hope this help's and was very easy install, Cost about $125 in part's and a couple hours of labor(did a good cleaning while it was eampty for the repair) Good luck."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS310858-GE-WR9X489-Defrost-Timer.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS310858-GE-WR9X489-Defrost-Timer.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}