{
  "title": "Dishwasher Door Catch Kit",
  "partUrl": "https://www.partselect.com/PS334230-Whirlpool-279570-Door-Catch-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$5.04",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS334230",
  "manufacturerPartNumber": "279570",
  "description": "Dishwasher Door Catch Kit ★★★★★ ★★★★★ 125 Reviews PartSelect Number PS334230 Manufacturer Part Number 279570 This part replaces your appliances latch (Door Latch Kit, Door Catch, Dryer Door Latch Kit). On your appliance you will find both a strike and a catch. The strike is mounted on the body of the dryer, while the catch is mounted on the dryer door. These two parts work together to keep your dryer door closed. The catch holds the door strike to keep the door closed during the drying cycle. If the door does not latch closed, you won’t be able to start a drying cycle. If this part is malfunctioning, you may not be able to open or close your door. In some instances, it may seem like your door is closing, but if it is not latching properly you won’t be able to start your drying cycle. You should replace this part as soon as it’s malfunctioning. Your dryer may run even though the latch is malfunctioning, but it is unsafe if the dryer continues to run while the door is open. This replacement part features 1 door latch kit which includes 2 strikes, 3 catches, and a set of instructions. This model is constructed of plastic and metal, and comes in white/silver.",
  "rating": 4.79,
  "reviewCount": 125,
  "symptoms": [
    "Door Pops Open",
    "Door won’t close",
    "Lid or door won’t close"
  ],
  "installationInstructions": {
    "author": "Terri from Saint Augustine, FL",
    "title": "Door Catch part had fallen out,/ was missing",
    "content": "Received your parts, Popped them both right into place, Even though only one side needed to be replaced, I wanted them to match up. It was amazing how easy this was. My husband was quite impressed I had ordered these rather then look for either a new or used dryer from some other source."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS334230-Whirlpool-279570-Door-Catch-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS334230-Whirlpool-279570-Door-Catch-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}