{
  "title": "Speed Queen Dishwasher M Series New Style Coil Kit",
  "partUrl": "https://www.partselect.com/PS334310-Whirlpool-279834-M-Series-New-Style-Coil-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$30.86",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS334310",
  "manufacturerPartNumber": "279834",
  "description": "Speed Queen Dishwasher M Series New Style Coil Kit ★★★★★ ★★★★★ 149 Reviews PartSelect Number PS334310 Manufacturer Part Number 279834 When the igniter reaches a high enough temperature, these coils (Coil Valve, Dryer Gas Valve Coil Kit, Dryer Valve Coil Kit, Gas Valve Solenoid) work together to open the gas valve and allow the gas to enter the burner. This is a safety mechanism to ensure that there are no unsafe buildups of gas inside your appliance. The coils are attached to the dryer gas valve. If the dryer does not heat or heats intermittently, the coil may not be opening the gas valve. Both coils must be operational for the valve to open. No continuity would indicate a defective coil, but they can be intermittent and fail when they get hot. Both coils should be replaced when one of them is broken. This part can break as a result of material fatigue from normal use. This part measures approximately 1 inch in diameter and 1 inch in height, and is constructed of plastic and metal. It comes in black/beige. This part features a 3-terminal boost/hold coil and a 2-terminal secondary coil",
  "rating": 4.8,
  "reviewCount": 149,
  "symptoms": [
    "Noisy",
    "Not Heating"
  ],
  "installationInstructions": {
    "author": "Michael from Kirkwood, MO",
    "title": "Gas Dryer would not ignite",
    "content": "1. Removed lint screen and holder frame. Unplugged the electrical cord and closed the gas valve in the line before it goes into the dryer.2. Removed two bolts at bottom front of machine and took off the bottom front panel.3. Removed three bolts from black plastic exit vent and took it out to give more room to access everything.4. removed two wires and  screws on the limit thermostat. Did the reverse to place the new one.5. Removed wires (remembering placement), then holder screw. rotated the Gas Dryer Sensor counter clockwise to release the bottom tab so the sensor can be taken off the flame tube. Did the reverse to place the new one on.6. Removed the one screw on the gas/flame tube that holds the bracket and igniter inside the flame tube. Removed the wires fro the igniter (remember placement) Slid the whole assembly toward the back of the machine to get the tube off the gas valve then rotated the whole assembly counter-clocwise to release the tab on the left side of the bracket. This was a little tight and had to work with it a bit to get the tab out and slide the whole piece out of the flame tube.7. Once the tube and igniter were out i removed the scree that holds the igniter and replaced with the new one. Made sure no dust, etc. was in the piece.8. Did the reverse to place the tube/igniter back into the flame tube.9. Carefully  and forcefully removed the wire connectors to the two coils. These were tough to get off. Removed the two screws that hold the bracket that holds the two coils in place. Slid the coils off the spindles remembering which one has the two wire connection and which one has the three wire connection and the way they went on. Replaced the old with the new. Placed the bracket onto the new coils and made sure the little bumps on the top are in the holes in the bracket. Tightened the screws to hold the coil bracket. Reattached the wire connectors to the coils making sure they go ALL the way back on. 10. Vaccumed everything I could to get lint, dust, etc. out. 11.Replaced the black vent plastic.12 Made sure the exit vent on the back was not crimped or clogged. Checked the little flap door where the vent goes outside to make sure it opens and closes super easy to no air flow is restricted.13. For testing I left the bottom panel open. Make sure you closed the door, reconnect the plug and turn the gas valve back on. Hit the go button on autodry or timed dry. The door must be closed to create the closed circulation of the system so the fan sucks the flame into the tube otherwise the flame will not fire deep  into the tube and will set off one fo the overheat sensors. After hitting the go button your drum will start to rotate, then a few seconds later you'll hear a click and your igniter will start to burn bright orange. Another click and the gas should flow and ignite. 14. This shows that you've fixed the ignition problem. I just replaced everything I thought that could be wrong in stead of hunting and trial and error. All the parts were about $137 so I thought it was worth making sure. 15. IMPORTANT: If during your test the flame turns off after a little while then turns back on only to turn off again, don't panic. This happened to me as well. I found that you need to run the dryer with wet clothes in the dryer. The wetness in the clothes will keep the autodry sensor from shutting off the dryer since there will be moisture in the exhaust. If it's on timed dry the wet clothes will cool the exhaust air and keep the overheat sensors from turning the heat off. So no heating of dry clothes to get out wrinkles. Just dry the wet clothes. This is all I did and it's been working great so far. Good Luck!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS334310-Whirlpool-279834-M-Series-New-Style-Coil-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS334310-Whirlpool-279834-M-Series-New-Style-Coil-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}