{
  "title": "Roper Refrigerator Water Inlet Valve",
  "partUrl": "https://www.partselect.com/PS3497634-Whirlpool-W10408179-Water-Inlet-Valve.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$79.62",
  "originalPrice": "$99.53",
  "inStock": true,
  "partSelectNumber": "PS3497634",
  "manufacturerPartNumber": "W10408179",
  "description": "Roper Refrigerator Water Inlet Valve ★★★★★ ★★★★★ 81 Reviews PartSelect Number PS3497634 Manufacturer Part Number W10408179 The water inlet valve (Refrigerator Water Inlet Valve Kit) provides water for the ice maker and water dispenser. This part is located at the back of the refrigerator, and connects to the water supply. If your water inlet valve is malfunctioning, you could be getting a lack of water to the inside of your refrigerator. Your ice maker may not produce cubes or your water dispenser may not work. This breakage can occur from material fatigue or normal use, and is a sign the part should be replaced soon. The water inlet valve must be replaced if the solenoids no longer have continuity or the valve has internal blockage. The part measures approximately 6.5 inches long and 3 inches wide and is constructed of plastic and metal. It comes in blue/green/red.",
  "rating": 4.73,
  "reviewCount": 81,
  "symptoms": [
    "Ice maker dispenses too little ice",
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "GLENN from ORLAND PARK, IL",
    "title": "was not making ice",
    "content": "take out ice bucket, just loosen the top 2 screws, remove the bottom screw, slide ice maker up & out, srewdriver to release wiring harness clip, reverse to put back in. was very simple. did not install water inlet kit yet. water under fridge stopped after i changed the ice maker."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS3497634-Whirlpool-W10408179-Water-Inlet-Valve.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS3497634-Whirlpool-W10408179-Water-Inlet-Valve.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}