{
  "title": "Refrigerator Evaporator Fan Motor Kit - 120V 60Hz",
  "partUrl": "https://www.partselect.com/PS3419839-Frigidaire-5303918549-Evaporator-Fan-Motor-Kit-120V-60Hz.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$76.34",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS3419839",
  "manufacturerPartNumber": "5303918549",
  "description": "Refrigerator Evaporator Fan Motor Kit - 120V 60Hz ★★★★★ ★★★★★ 25 Reviews PartSelect Number PS3419839 Manufacturer Part Number 5303918549 The evaporator fan motor (Motor Evaporator Fan, Evaporator Fan Motor Kit, Evaporator Fan Motor, Refrigerator Evaporator Fan Motor) circulates air through the food compartment for efficient cooling in refrigerators. The evaporator fan motor can squeal as its bearing dries out. The motor bearings can totally seize, preventing any movement. The motor coil can also burn out, preventing any fan movement. If this motor fails, the refrigerator compartment will warm up and eventually the freezer will reduce cooling as well. Excessive frost can build up on the evaporator coil due to lack of air movement. The motor can make a squealing noise when it is beginning to fail or will not operate at all when powered, and this is a sign it should be replaced. The evaporator is located in the rear of the freezer compartment. This part measures 2-1/2 inches wide by 3 inches tall by 1 inch thick, at its widest point. It is constructed of plastic and metal, and comes in black/silver. This kit includes the evaporator fan motor and harness.",
  "rating": 4.28,
  "reviewCount": 25,
  "symptoms": [
    "Freezer section too warm",
    "Fridge and Freezer are too warm",
    "Fridge too warm"
  ],
  "installationInstructions": {
    "author": "Larry from Carthage, NC",
    "title": "bottom of fridg. would not get cool. Temp was 50-60degrees. The freezer compartment worked so I knew it was not the compressor.",
    "content": "I removed the fan housing in the freezer section by removing all the screws. (7)  There are two screws behind the vents. I did not have an ice maker to contend with so this was very easy. There is only two wires to disconnect....the ground wire and the electricity supply. Then you remove the unit from the back of the housing cover  by removing two screws. Then the motor is removed from it's housing by removing 2 more screws.  1...2...3 and you're ready to reverse the procedure. I am not mechanically inclined and this was easy. Saved myself perhaps $120.00. Repair folks wanted mininum of $60.00 just to come out. Part and shipping cost me 33 bucks.OH, DON'T FORGET TO UNPLUG THE FRIDGE. :>)"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS3419839-Frigidaire-5303918549-Evaporator-Fan-Motor-Kit-120V-60Hz.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS3419839-Frigidaire-5303918549-Evaporator-Fan-Motor-Kit-120V-60Hz.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}