{
  "title": "LG Dishwasher Door Gasket - Black",
  "partUrl": "https://www.partselect.com/PS3522654-LG-3920DD3005A-Door-Gasket-Black.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$53.46",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS3522654",
  "manufacturerPartNumber": "3920DD3005A",
  "description": "LG Dishwasher Door Gasket - Black ★★★★★ ★★★★★ 10 Reviews PartSelect Number PS3522654 Manufacturer Part Number 3920DD3005A This is a door gasket for a dishwasher. It creates a watertight seal between the dishwasher door and tub to prevent leaking while the appliance is in use. The gasket is approximately 76 inches long and is black in color. The gasket could become dry and brittle over time which can cause a leak, forcing you to replace it. After removing the old door gasket, clean the empty crevice to ensure a proper seal when you install the replacement gasket. To install the replacement gasket after cleaning the area, simply push the new part into place around the door.",
  "rating": 4.8,
  "reviewCount": 10,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Bruce from Katy, TX",
    "title": "Dishwasher leaking; got AE error almost every other wash",
    "content": "The inside gasket deteriorates over time - However replacement is easy. the main thing you have to remember is after you remove the old gasket, install the new one starting at the middle top of the tub and work your way down both sides. Also, don't push the gasket all the way in...only enough to hold in place. When you close the door the gasket will form a better seal around the door."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS3522654-LG-3920DD3005A-Door-Gasket-Black.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS3522654-LG-3920DD3005A-Door-Gasket-Black.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}