{
  "title": "Estate Refrigerator Replacement Ice Maker",
  "partUrl": "https://www.partselect.com/PS358591-Whirlpool-4317943-Replacement-Ice-Maker.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$111.89",
  "originalPrice": "$131.03",
  "inStock": true,
  "partSelectNumber": "PS358591",
  "manufacturerPartNumber": "4317943",
  "description": "Estate Refrigerator Replacement Ice Maker ★★★★★ ★★★★★ 224 Reviews PartSelect Number PS358591 Manufacturer Part Number 4317943 This ice maker (Complete Icemaker Assembly, Whirlpool Icemaker Kit, Ice Maker Assembly, Refrigerator Ice Maker, Icemaker) receives water from the water inlet valve, freezes it, and dispenses it into the ice bucket until the bucket is full. Ice makers will need to be replaced every 3-10 years depending on the frequency of usage, and water quality. You can perform a voltage test with a multimeter or perform an inlet valve test. If you’re unable to make ice, or notice leaks then it may be a sign your ice maker is damaged and could be in need of a replacement. This model measures approximately 11x5 inches, is constructed of plastic and metal, and comes in black/silver. This ice maker is a complete assembly; the whole assembly attaches to the wall of your freezer. ***NOTE: Ice maker does NOT come with the bail or shut off arm. You must order them separately if required. It does come complete with flat and round plug wiring harness, the mounting hardware, and the instructions. The harness can be reused. The ice maker will not fit refrigerators that have the ice auger mounted on the door.",
  "rating": 4.76,
  "reviewCount": 224,
  "symptoms": [
    "Ice maker dispenses too little ice",
    "Ice maker dispenses too much ice",
    "Ice maker not making ice"
  ],
  "installationInstructions": {
    "author": "GLENN from ORLAND PARK, IL",
    "title": "was not making ice",
    "content": "take out ice bucket, just loosen the top 2 screws, remove the bottom screw, slide ice maker up & out, srewdriver to release wiring harness clip, reverse to put back in. was very simple. did not install water inlet kit yet. water under fridge stopped after i changed the ice maker."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS358591-Whirlpool-4317943-Replacement-Ice-Maker.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS358591-Whirlpool-4317943-Replacement-Ice-Maker.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}