{
  "title": "LG Dishwasher Spring,Hinge",
  "partUrl": "https://www.partselect.com/PS3524564-LG-4970ED4004G-Spring-Hinge.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$17.38",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS3524564",
  "manufacturerPartNumber": "4970ED4004G",
  "description": "LG Dishwasher Spring,Hinge ★★★★★ ★★★★★ 2 Reviews PartSelect Number PS3524564 Manufacturer Part Number 4970ED4004G The door spring, used in dishwashers, adds tension to the door through the door hinge to keep it from opening too fast. If you have a door latch failure or your washer door drops too quickly when opened, it is best you replace this part to fix the problem. Refer to the manual provided by the manufacturer for installation instructions and further repair guidance. Unplug your dishwasher from the power source before you begin this repair project as a safety precaution.",
  "rating": 5,
  "reviewCount": 2,
  "symptoms": [
    "Door latch failure",
    "Door won’t close"
  ],
  "installationInstructions": {
    "author": "Gregory L from INDEPENDENCE, OH",
    "title": "Broken door spring allows the door to overextend to the floor if not propped.",
    "content": "Simple, removed screws securing machine in the cabinet, then pull the unit out of the cabinet space about 10 inches. Springs are accessible within this extension. You need strong hands to extend the springs and attach them. Once attached, push machine back in place and re-install the anchor screws. In my situation, only one spring was broken, so the attached side revealed the correct slot to place the hook on the top position, the bottom position has a plastic lead for the spring, and that lead is attached to a rope to the door hinge. Note: Replace BOTH springs, even if only one is broken."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS3524564-LG-4970ED4004G-Spring-Hinge.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS3524564-LG-4970ED4004G-Spring-Hinge.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}