{
  "title": "Refrigerator FAN MOTOR EVAP 115V",
  "partUrl": "https://www.partselect.com/PS3502361-Frigidaire-297309000-FAN-MOTOR-EVAP-115V.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$32.97",
  "originalPrice": "$93.29",
  "inStock": true,
  "partSelectNumber": "PS3502361",
  "manufacturerPartNumber": "297309000",
  "description": "Refrigerator FAN MOTOR EVAP 115V ★★★★★ ★★★★★ 7 Reviews PartSelect Number PS3502361 Manufacturer Part Number 297309000 This evaporator fan motor is 115V. If you notice that your freezer is noisy or is too warm, you may need to replace the evaporator fan motor. This package comes with the evaporator fan motor itself, as well as a wire harness. The evaporator fan motor is in the back of the freezer, so you will need to remove your freezer shelves and the back panel before you can access it. The function of the evaporator fan motor is to circulate air over the coils. The coils convert the heat into cool air, which is then circulated. Be sure to remove the power source from the freezer before you begin this repair.",
  "rating": 5,
  "reviewCount": 7,
  "symptoms": [
    "Fridge too warm",
    "Frost buildup",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Nathan M. from Bunnell, FL",
    "title": "Freezer thawing at about 20 degrees",
    "content": "Turned freezer off at themostat and unplugged freezer. Removed 2 screws at front 2 at the back and 2 at the top.  Lowered top cover and removed evaporator fan bracket (2 more screws) removed themostat capulary tube( 1 screw and bracket) then unplug fan motor.  Removed motor from bracket (2 screws).  Put on new fan motor then removed fan blade from old motor and put on the new motor.  Remounted fan motor bracket and thermostat capulary tube. Remounted top cover, plugged freezer in the set the thermostat to 4 and freezer is working fine and doing its job.  I orderedmotor on a Sunday and it was shipped on Monday and I received said part at 7:pm on Wednesday."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS3502361-Frigidaire-297309000-FAN-MOTOR-EVAP-115V.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS3502361-Frigidaire-297309000-FAN-MOTOR-EVAP-115V.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}