{
  "title": "Refrigerator Door Switch",
  "partUrl": "https://www.partselect.com/PS3529268-LG-6600JB1010A-Refrigerator-Door-Switch.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$31.51",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS3529268",
  "manufacturerPartNumber": "6600JB1010A",
  "description": "Refrigerator Door Switch ★★★★★ ★★★★★ 87 Reviews PartSelect Number PS3529268 Manufacturer Part Number 6600JB1010A The interior light in your refrigerator is controlled by a switch that is activated when the door is opened and closed. If your refrigerator light will not turn on, or stays on when the door is closed, you could have a faulty switch. The switch is spring-loaded and is a generally closed type of switch meaning there should be no continuity when the button is pushed, and continuity through the switch when it is no longer engaged. This plastic, white, OEM switch is sourced directly from the manufacturer, is sold individually and is easy to replace. The repair usually takes less than 15 minutes and requires a flat-blade screwdriver and needle-nose pliers.",
  "rating": 4.82,
  "reviewCount": 87,
  "symptoms": [
    "Light not working"
  ],
  "installationInstructions": {
    "author": "Debbie from Waltham, MA",
    "title": "Remove and replace light switch",
    "content": "Video makes it look easy. Kenmore refrigerator does not have \"groove\" along the right hand side of switch that allows for pushing down on release.  Used a thin screwdriver to get under to push while holding switch edge with pliers.  Kept slipping.  Tape sides to avoid scratching inside of refrigerator."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS3529268-LG-6600JB1010A-Refrigerator-Door-Switch.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS3529268-LG-6600JB1010A-Refrigerator-Door-Switch.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}