{
  "title": "Dishwasher Diverter Motor - 120V 60Hz",
  "partUrl": "https://www.partselect.com/PS3579323-LG-4681ED3001D-Diverter-Motor-120V-60Hz.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$40.39",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS3579323",
  "manufacturerPartNumber": "4681ED3001D",
  "description": "Dishwasher Diverter Motor - 120V 60Hz ★★★★★ ★★★★★ 6 Reviews PartSelect Number PS3579323 Manufacturer Part Number 4681ED3001D This diverter motor, or stepper motor, controls the movement of the spray arms in your dishwasher. It directs water between the drain pump and the spray arms by turning a check valve inside the pump, managing the flow of water to these spray arms. This diverter motor runs on 120 volts and 60 Hz. When this motor fails, the dishwasher will not wash or drain properly. Please keep in mind that this genuine OEM replacement part is sold separately from the spray arms.",
  "rating": 4.5,
  "reviewCount": 6,
  "symptoms": [
    "Noisy",
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Glen from LINESVILLE, PA",
    "title": "Dishwasher gave the Ne code",
    "content": "When I turned the dishwasher over I discovered the PS3579323 diverter motor had failed due to a leak around the PS3536016  valve, check. No use replacing the diverter motor without fixing the leak so I turned the machine back over and disassembled the spray arms and top of the pump cover which reveled the case assy and the valve, check. Upon removal of the valve, check I discovered hair wrapped around it which compromised the MO31 packing and caused the leak. I probably could have just cleaned out the hair and reassembled it but because my installation is a bit of a pain I elected to change the case assy (because of a slight depression where the packing sets) the M031 packing, the MO25 valve, check, and the MO35 pump gasket. After that was accomplished I turned the machine upside down and replaced the MO26 diverter motor and reinstalled the dishwasher. End result: Ne code cleared, no leaks and now the dishes are clean on the top shelf and the wife is happy. There are great instruction videos on YouTube. Good luck!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS3579323-LG-4681ED3001D-Diverter-Motor-120V-60Hz.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS3579323-LG-4681ED3001D-Diverter-Motor-120V-60Hz.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}