{
  "title": "Dishwasher Water Inlet Valve",
  "partUrl": "https://www.partselect.com/PS3654179-GE-WD15X10014-Water-Inlet-Valve.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$43.78",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS3654179",
  "manufacturerPartNumber": "WD15X10014",
  "description": "Dishwasher Water Inlet Valve ★★★★★ ★★★★★ 54 Reviews PartSelect Number PS3654179 Manufacturer Part Number WD15X10014 This water inlet valve should be located behind the lower kickplate panel in either the right or left corner. The attaching solenoid on the valve open and close according to the desired amount of water needed.",
  "rating": 4.72,
  "reviewCount": 54,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "Greg from Burlington, VT",
    "title": "Water leak, small puddle to front left of dishwasher",
    "content": "You'll need to remove the front toe kick and (if installed, the GE Profile baffling for additional silencing action).  You will need to disconnect the right wire connection to access the right screw (and may need to use a flat head screwdriver).  You can then remove the 2 screws that hold the Valve Water Inlet on.  You will then need to loosen and the hose clamp that attaches the water line to the Valve Water Inlet.  You may need to force it undone since the rubber connection is pretty secure around the water tube inlet.  Disconnect the plastic wire housing from the Valve Water Inlet and you should now have the Valve Water Inlet disconnected.Reverse the order and reconnect everything and you should be good to go!  Double-check for any leaks prior to pushing everything back in :)"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS3654179-GE-WD15X10014-Water-Inlet-Valve.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS3654179-GE-WD15X10014-Water-Inlet-Valve.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}