{
  "title": "Caloric Refrigerator Condenser Fan Motor Kit",
  "partUrl": "https://www.partselect.com/PS395284-Whirlpool-833697-Condenser-Fan-Motor-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$63.12",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS395284",
  "manufacturerPartNumber": "833697",
  "description": "Caloric Refrigerator Condenser Fan Motor Kit ★★★★★ ★★★★★ 34 Reviews PartSelect Number PS395284 Manufacturer Part Number 833697 This condenser fan motor kit is designed for use with refrigerators. This fan draws air through the condenser coils and over the compressor. It does this with the goal of cooling the warm refrigerant before it enters the evaporator. When your fan or fan motor is not working your refrigerator will not cool properly. This is a 2-Watt, 115 Volt motor that rotates the fan in a counter clockwise direction. This kit includes the hardware needed for installation, and a set of instructions. Before you begin any repair work make sure to unplug your appliance.",
  "rating": 4.74,
  "reviewCount": 34,
  "symptoms": [
    "Freezer section too warm",
    "Fridge and Freezer are too warm",
    "Fridge runs too long"
  ],
  "installationInstructions": {
    "author": "Tom from Franklin, WI",
    "title": "Sometimes the condenser fan would start causing the refrigerator to overheat.",
    "content": "Unplug the appliance.Removed the screws holding the back panel.Removed the fan blade.removed 3 screws holding the condenser fan.Remove the 3 metal brackets attached to the fan.(First note which studs the brackets are attached to. Attach the 3 metal brackets to the new fan. (New screws were supplied)Cut and strip the wire about two inches from the fan.Cut and strip the new wire. I cut the new wire in half (about 6 inches.) Connect the two wires, twist and used 2 wire nuts. Tie wrap the wire to the wire harness. Mount the new fan (three screws)Screw the back panel back on.Mount the new"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS395284-Whirlpool-833697-Condenser-Fan-Motor-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS395284-Whirlpool-833697-Condenser-Fan-Motor-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}