{
  "title": "Samsung Refrigerator Door Mullion Spring",
  "partUrl": "https://www.partselect.com/PS4163672-Samsung-DA81-01345B-Door-Mullion-Spring.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$9.44",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS4163672",
  "manufacturerPartNumber": "DA81-01345B",
  "description": "Samsung Refrigerator Door Mullion Spring ★★★★★ ★★★★★ 57 Reviews PartSelect Number PS4163672 Manufacturer Part Number DA81-01345B The French door divider spring fits most Samsung French door style refrigerators. The spring applies tension between components in the refrigerator, which engages and retracts the door flap. This will allow the door to close properly. If the spring is broken, damaged, or faulty the door flap will swing open and block the door from closing, and you should look to replace the part straight away to prevent further damage to the door. The spring is a genuine OEM part, is made of metal, and measures at 1 1/2\" long. This part is also known as a refrigerator door mullion spring.",
  "rating": 4.7,
  "reviewCount": 57,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "HOLLIE from FORT WAYNE, IN",
    "title": "Left side French Door flap on Samsung refrigerator didn't retract when closing.",
    "content": "OMG seriously! I stopped into my go-to appliance repair shop to ask about what might be needed to repair the problem with my refrigerator door. They said you will need to replace the Mullion Flap piece. Cost would be $250-300 with  part, labor and service. I went on line to see if I could handle the repair process myself. I found a How to - U Tube video and turns out I only needed to replace a little spring and pin not the whole Mullion Flap. Went to Parts select, ordered the spring and pin and did the repair myself in about 5 minutes. Shipping was $7 so I ended up paying $13 total."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS4163672-Samsung-DA81-01345B-Door-Mullion-Spring.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS4163672-Samsung-DA81-01345B-Door-Mullion-Spring.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}