{
  "title": "Samsung Refrigerator Spring PIN - French",
  "partUrl": "https://www.partselect.com/PS4163673-Samsung-DA81-01346A-Spring-PIN-French.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$4.66",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS4163673",
  "manufacturerPartNumber": "DA81-01346A",
  "description": "Samsung Refrigerator Spring PIN - French ★★★★★ ★★★★★ 14 Reviews PartSelect Number PS4163673 Manufacturer Part Number DA81-01346A This pin acts as a sleeve for the French door spring in a refrigerator. This is a genuine OEM part that is sold individually and works with the spring within the door mullion to seal the door shut. If you need to replace the sleeve, check whether the spring in the door is still intact as well. You will only need to replace one spring sleeve pin per door, as there is only one sleeve on the upper part of the spring. To remove the spring and replace the mullion, do so with a set of needle-nose pliers and lift the lower side of the spring to easily pull it out, then you can replace the sleeve.?",
  "rating": 4.57,
  "reviewCount": 14,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "HOLLIE from FORT WAYNE, IN",
    "title": "Left side French Door flap on Samsung refrigerator didn't retract when closing.",
    "content": "OMG seriously! I stopped into my go-to appliance repair shop to ask about what might be needed to repair the problem with my refrigerator door. They said you will need to replace the Mullion Flap piece. Cost would be $250-300 with  part, labor and service. I went on line to see if I could handle the repair process myself. I found a How to - U Tube video and turns out I only needed to replace a little spring and pin not the whole Mullion Flap. Went to Parts select, ordered the spring and pin and did the repair myself in about 5 minutes. Shipping was $7 so I ended up paying $13 total."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS4163673-Samsung-DA81-01346A-Spring-PIN-French.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS4163673-Samsung-DA81-01346A-Spring-PIN-French.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}