{
  "title": "Samsung Refrigerator Hinge - French Door",
  "partUrl": "https://www.partselect.com/PS4143931-Samsung-DA61-03230B-Hinge-French-Door.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$8.25",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS4143931",
  "manufacturerPartNumber": "DA61-03230B",
  "description": "Samsung Refrigerator Hinge - French Door ★★★★★ ★★★★★ 5 Reviews PartSelect Number PS4143931 Manufacturer Part Number DA61-03230B This is a French door hinge that is compatible with various models of refrigerators and is used to control the mullion (long plastic strips) on the inside portion of the French doors. If you notice that your doors open and the mullion either moves freely or is stuck, this hinge needs to be replaced immediately to prevent issues with frost buildup, energy efficiency and temperature fluctuations. Replacing this hinge is quite simple, and you will only need a flathead and Philips-head screwdriver to do it. First, remove the screw covers from the securing screws for the mullion. Unscrew and remove the securing screws with your Philips-head screwdriver, and then pull the mullion up and out carefully to dislodge it from the fridge door. Near the middle of the mullion, disconnect the wire harness to remove the mullion completely. Remove the hinge cover with a flathead screwdriver to expose the hinge, and then carefully remove and replace the old hinge onto its attaching spring. Then you can simply reassemble the rest of the door assembly, along with the hinge cover and wire harness.",
  "rating": 4.6,
  "reviewCount": 5,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "",
    "title": "",
    "content": ""
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS4143931-Samsung-DA61-03230B-Hinge-French-Door.htm?SourceCode=18#Troubleshooting"
  },
  "context": "refrigerator"
}