{
  "title": "Tappan Refrigerator Defrost Timer - 60Hz 120V",
  "partUrl": "https://www.partselect.com/PS423801-Frigidaire-215846602-Defrost-Timer-60Hz-120V.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$38.60",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS423801",
  "manufacturerPartNumber": "215846602",
  "description": "Tappan Refrigerator Defrost Timer - 60Hz 120V ★★★★★ ★★★★★ 40 Reviews PartSelect Number PS423801 Manufacturer Part Number 215846602 This Defrost Timer works like a clock by switching on the defrost heater circuit after a predetermined amount of compressor run time. This allows the defrost circuit to clear the evaporator of ice or frost to maintain proper airflow. The defrost timer is located in the control housing which is in the refrigerator section of your appliance. If this part is not working, it can lead to temperature increases in your refrigerator. If the compressor circuit fails, no cooling will take place; if the defrost circuit isn't activated, ice will quickly build up on the evaporator coils and reduce airflow and efficiency. If the timer doesn't advance or if the contacts have no continuity, the timer will need to be replaced. This timer measures approximately 3 inches long and 2.5 inches wide, and is constructed of plastic and metal. It comes in black/white/silver and is sold individually. This replacement part features 1 defrost timer.",
  "rating": 4.48,
  "reviewCount": 40,
  "symptoms": [
    "Freezer not defrosting",
    "Freezer section too warm",
    "Freezer too cold"
  ],
  "installationInstructions": {
    "author": "Stephen from Warrington, PA",
    "title": "Fridge got warm and freezer coils were frosted",
    "content": "Fridge is a side by side.  The freezer is pretty narrow for a guy with wide shoulders.  Pulled plug.Had to remove bottom drawers then used nut driver to remove screws closest to back wall in drawer runners.  Once the back screws were removed the runners could be swung up or down out of way so back cover could be removed.Once back cover was removed thermostat was  located attached to top pipe going into coil using a spring clamp.Cut the wires just outside the crimp connectors going into thermostat.  Released the spring clamp buy squeezing botton together.Removed old badly corroded thermostat.I wish I had attached the crimp connectors to the new thermostat wires before mounting it.  Reaching way in the back, while turning shoulders verticly and trying to get the wire connectors set from both sides was awkward and uncomfortable...The biggest PIA of the whole task.Once connected I let the fridge (thermostat) cool for 10 min.  Turned the dial defrost timer to get it into defrost mode.  Stupidly touched the heating element to see if it was getting warm...it was very hot.  Coils steamed...every looked like it was working.  Unplugged, put back cover back on and retattached drawer mounts.Plugged back in and everying is working great!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS423801-Frigidaire-215846602-Defrost-Timer-60Hz-120V.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS423801-Frigidaire-215846602-Defrost-Timer-60Hz-120V.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}