{
  "title": "Tappan Refrigerator Door Shelf End Cap - Left or Right Side",
  "partUrl": "https://www.partselect.com/PS422925-Frigidaire-215473602-Door-Shelf-End-Cap-Left-or-Right-Side.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$9.22",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS422925",
  "manufacturerPartNumber": "215473602",
  "description": "Tappan Refrigerator Door Shelf End Cap - Left or Right Side ★★★★★ ★★★★★ 12 Reviews PartSelect Number PS422925 Manufacturer Part Number 215473602 The door shelf end cap, or door bin support, secures the rack in a refrigerator or freezer door. Note that this fits on either the left or right hand side. If the end caps of your refrigerator or freezer are broken or cracked, or if your food retainer bar is not staying in place, then replacing the door support can solve this problem. No tools are needed for this repair project. To repair, first remove the end cap by pushing upward or downwards to slide it out the end of the rail. Next, replace with new end cap and line it up to clip it back onto the rail. It comes in white and measures about two inches high. Remember to wear gloves for safety.",
  "rating": 4.67,
  "reviewCount": 12,
  "symptoms": [],
  "installationInstructions": {
    "author": "Lynn from New York,, NY",
    "title": "My electric bill was super high.  $450 for 1 month for a 1bdrm apt in NY city",
    "content": "I took a look at the web site where I purchased the parts, then I took a look at the paper enclosed with the order.  Thankfully, I have a battery operated screw driver since there are so many screws.  There are plenty of screws in my refrigerator and freezer doors.  I thought that since my old door gaskets were all chewed up looking, if I changed them, the 10 year old air conditioners and the old fashioned light bulbs to instant on energy saver light bulbs, the electric bill would become more manageable.  The refrigerator and freezer door gaskets were the first step.  They were easy to swap out.  You just need to empty the door of all food items, then pull back the old gasket to see the screws.  There are alot of them.  You should leave 2 loosened screws on each side of the refrigerator door to hold the panel in place while you work and remove the rest.  Then you can remove the old gasket and slide the new one into place.  Make sure as you tighten the screws and replace the ones you removed, the new gasket fits into the door panel groove securely and is in place as you tighen the screws.  Make sure it is in place all the way around the door as you work.  You repeat the procedure for the freezer using only one loosened screw on each side to keep the interior panel in place while you work. It takes some time due to the number of screws, but the work is pretty easy.  I never even broke a nail.  The end caps for the shelf bars just snap into place just as the old ones can be snapped out with a bit of pressure.  They do not have to be wrestled and you need to work carefully so that you do not break them.  (I ordered an extra just in case, but I didn't need it.  I will have it in case I need it in the future)My electric bill dropped from $450 to $110 a month with all the improvements I made.  Thank you Part Select for taking the fear of screwing it up, out of the repair process and making it manageable.  I can afford my electric bill now.  Thanks for your help."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS422925-Frigidaire-215473602-Door-Shelf-End-Cap-Left-or-Right-Side.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}