{
  "title": "Frigidaire Refrigerator Door Bin",
  "partUrl": "https://www.partselect.com/PS429724-Frigidaire-240323001-Refrigerator-Door-Bin.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$29.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS429724",
  "manufacturerPartNumber": "240323001",
  "description": "Frigidaire Refrigerator Door Bin ★★★★★ ★★★★★ 223 Reviews PartSelect Number PS429724 Manufacturer Part Number 240323001 This door bin (Bottom Door Bin, Refrigerator Door Bin, Door Shelf Bin, Refrigerator Door Bin) is a movable bin mounted on the inner door to hold food items, bottles, and jars. Over time, a cold refrigerator can cause plastic to become fragile and break down. This can lead to other issues in the refrigerator. When the door bin will not hold securely onto the inner door panel, it must be replaced. This door bin measures 5.75 inches high, 16 inches wide, by 4.25 inches deep and is made of white plastic. Sold individually.",
  "rating": 4.62,
  "reviewCount": 223,
  "symptoms": [
    "Clicking sound",
    "Door won’t open or close",
    "Ice maker not making ice"
  ],
  "installationInstructions": {
    "author": "Erik from Evans, GA",
    "title": "Aged parts broken",
    "content": "After sitting in a cold refrigerator for year after year, plastic becomes brittle and breaks. This is what started happening to my shelves and door bins. The problem a lot of times is getting the right part since some of the parts do not have numbers. This website gives a accurate description and best of all photos on an inch grid, so I can measure what I have and find what I need. This time everything was perfect and fit easily. took no time and just like that I have almost double the space again. Funny how that works. Once before I didn't get the right piece so just pay attention to the dimensions."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS429724-Frigidaire-240323001-Refrigerator-Door-Bin.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS429724-Frigidaire-240323001-Refrigerator-Door-Bin.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}