{
  "title": "Tappan Refrigerator Door Shelf End Cap - Left or Right Side",
  "partUrl": "https://www.partselect.com/PS422444-Frigidaire-215267701-Door-Shelf-End-Cap-Left-or-Right-Side.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$5.25",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS422444",
  "manufacturerPartNumber": "215267701",
  "description": "Tappan Refrigerator Door Shelf End Cap - Left or Right Side ★★★★★ ★★★★★ 10 Reviews PartSelect Number PS422444 Manufacturer Part Number 215267701 This end cap can be used for the right or left side of the refrigerator door shelf or the freezer door shelf. It is white in color, made of plastic material and measures about 2 inches high by 3 inches deep. This might need to be replaced if it has broken or worn over time. This repair requires no tools. You will need to open your fridge, pull upwards on the existing end cap, and pull outwards. There is a locking tab on either end so it does not matter if the top or bottom comes out first. Slide the new end cap onto the rail and it is installed.",
  "rating": 5,
  "reviewCount": 10,
  "symptoms": [],
  "installationInstructions": {
    "author": "David from Fleetwood, PA",
    "title": "Freezer / refrigerator warm (not defrosting)",
    "content": "I checked the defrost timer (bottom front of the freezer / outside). I advanced it to send it into the defrost cycle. The heating elements in the freezer (behind the panel) did not heat up. I cut the wires going to the defrost thermostat. Turned the power back on, made sure the defrost timer was still in the defrost cycle and checked the voltage at the wires to the defrost thermostat (before the heating elements). There was power / voltage there. I jumped out / bypassed the defrost thermostat turned the power back on and the heating elements came on. The problem was the defrost thermostat. So I replaced it with a new one from PartSelect.com. How it works...When the defrost timer is advanced to the defrost cycle the switch closes sending power to the defrost thermostat. If the temperature is low enough, the defrost thermostat switch will close and sends power to the heating elements. When the temperature rises high enough about 55 degrees the switch at the thermostat will open and the heating elements will turn off (not allowing the freezer temperature to get too high, just enough to defrost the coil). The refrigerator will turn back on when the timer advances. The defrost timer will defrost every 8-12 hours."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS422444-Frigidaire-215267701-Door-Shelf-End-Cap-Left-or-Right-Side.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}