{
  "title": "Refrigerator Defrost Timer - 120V 60Hz",
  "partUrl": "https://www.partselect.com/PS423802-Frigidaire-215846604-Defrost-Timer-120V-60Hz.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$32.51",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS423802",
  "manufacturerPartNumber": "215846604",
  "description": "Refrigerator Defrost Timer - 120V 60Hz ★★★★★ ★★★★★ 11 Reviews PartSelect Number PS423802 Manufacturer Part Number 215846604 This defrost timer is designed for use in your refrigerator. The defrost timer acts as a clock, that switches the refrigerator from the freezing cycle to the defrost cycle and back. If your refrigerator is running non-stop, or is not running at all, you may need to check and replace the defrost timer. This is a 6 hour and 21 minute defrost timer. This part is made of white plastic, with 4 metal prongs protruding from one end. To complete this repair, you will need to access the old defrost timer which is located inside the console on the roof of your refrigerator. To complete this repair, you will need a 1/4-inch nut driver, a flat blade screwdriver, and a Phillips screwdriver. Be sure to disconnect power from your refrigerator before you begin this repair.",
  "rating": 3.82,
  "reviewCount": 11,
  "symptoms": [
    "Freezer not defrosting",
    "Freezer section too warm",
    "Fridge and Freezer are too warm"
  ],
  "installationInstructions": {
    "author": "Dennis from BEAUMONT, TX",
    "title": "Freezer Freezing up and blocking the vent for refrigerator, not cooling the fridge.",
    "content": "Went pretty straight forward, except the heat shrink tubing was about 2 sizes too big. Would not shrink small enough to seal the connections. Even with a heat gun it would not shrink small enough. OH, another think is when I plugged the fridge back in the defrost timer was in defrost mode. Took me a few minutes to figure that out and use a screwdriver to turn the timer back to the on position. Other than that, install was pretty simple."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS423802-Frigidaire-215846604-Defrost-Timer-120V-60Hz.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS423802-Frigidaire-215846604-Defrost-Timer-120V-60Hz.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}