{
  "title": "Caloric Dishwasher Element Grommet",
  "partUrl": "https://www.partselect.com/PS451462-Frigidaire-5300806833-Element-Grommet.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$5.86",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS451462",
  "manufacturerPartNumber": "5300806833",
  "description": "Caloric Dishwasher Element Grommet PartSelect Number PS451462 Manufacturer Part Number 5300806833 This grommet is used in a number of household appliances. Most often it is used in the dishwasher as part of the assembly that mounts and holds the heating element in place. This replacement part is made out of rubber, which helps create a seal between the element and the appliance. This grommet is sold individually. If you are replacing the heating element, or the brass nut that holds it in place, we recommend you replace the grommet at the same time. Before you begin any repair work on your dishwasher, make sure you have unplugged it and shut off the water supply.",
  "rating": 0,
  "reviewCount": 0,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Eric from Holly, MI",
    "title": "Water leaking from under dishwasher",
    "content": "Removed lower trim covers (2 Phillips screws) disconnected power supply at breaker box. Removed wire from heating element, removed (broken) brass nut, unclipped heating element and removed. Removed flat washers and replaced with new grommets. Kind of tricky getting them in there. Also had to lube them with silicone to get the element back through. Installed new brass nuts and installed wire connectors. Reset breaker and started diswasher to verify repair.  No leaks, working just fine, reinstalled lower trim covers"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS451462-Frigidaire-5300806833-Element-Grommet.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS451462-Frigidaire-5300806833-Element-Grommet.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}