{
  "title": "Refrigerator Defrost Thermostat",
  "partUrl": "https://www.partselect.com/PS469510-Frigidaire-5303918202-Defrost-Thermostat.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$10.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS469510",
  "manufacturerPartNumber": "5303918202",
  "description": "Refrigerator Defrost Thermostat ★★★★★ ★★★★★ 18 Reviews PartSelect Number PS469510 Manufacturer Part Number 5303918202 This defrost thermostat is also known as a refrigerator defrost bi-metal thermostat kit. The function of the defrost bi-metal thermostat is to prevent overheating during the defrost cycle in your refrigerator by protecting the evaporator. The most common sign that there is a problem with your refrigerator defrost thermostat kit is if your freezer is cold but your refrigerator is warm. If your evaporator coils are icy then your defrost bi-metal thermostat kit could be defective. To do this installation the tools you will need include a 1/4 inch nut driver, a pair of wire strippers and crimpers, and a heat gun.",
  "rating": 4.33,
  "reviewCount": 18,
  "symptoms": [
    "Freezer not defrosting",
    "Freezer section too warm",
    "Freezer too cold"
  ],
  "installationInstructions": {
    "author": "Greg from Hanover Township, PA",
    "title": "evaporator coil kept freezing up, refridgerator warm.",
    "content": "This was the second part I tried. The defrost timer was first, but that did not fix it. To do this I had to remove the ice maker and the back plate of the freezer. Then I defrosted the coil and cut the wires. stripped them back and installed the new thermostat. re-assembled and tested. has been working great ever since."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS469510-Frigidaire-5303918202-Defrost-Thermostat.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS469510-Frigidaire-5303918202-Defrost-Thermostat.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}