{
  "title": "Refrigerator Defrost Thermostat Kit",
  "partUrl": "https://www.partselect.com/PS469522-Frigidaire-5303918214-Defrost-Thermostat-Kit.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$20.60",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS469522",
  "manufacturerPartNumber": "5303918214",
  "description": "Refrigerator Defrost Thermostat Kit ★★★★★ ★★★★★ 25 Reviews PartSelect Number PS469522 Manufacturer Part Number 5303918214 If you find that there is excessive frost in your freezer, or the freezer will not defrost, you may need to replace the defrost thermostat. The defrost thermostat kit comes with the clip, leads, and heat shrink. To access the defrost thermostat for this repair, you will need to remove your freezer shelves, as well as the back panel of your freezer. To complete this repair, you will need a 1/4-inch nut driver, a set of wire strippers and crimpers, and a heat gun or blow dryer. Before you begin this repair, be sure to disconnect the power source from the appliance.",
  "rating": 4.28,
  "reviewCount": 25,
  "symptoms": [
    "Doesn’t stop running",
    "Freezer not defrosting",
    "Freezer section too warm"
  ],
  "installationInstructions": {
    "author": "Leo from Bentonville, AR",
    "title": "Running but not cooling off and frost in the back of the freezer",
    "content": "Unplugged the refrigerator.  Removed the 4 hex head screws on the lower back panel at the back of the freezer.  Used a blow dryer to defrost the pipes and area surrounding the thermostat.  Unplug the connection from the back of the freezer, unplug the 2 wires, one that goes to the heater, one that comes from power.  Unclip the thermostat from the pipe and note which pipe you unclipped it from.  Cut the wires on the old thermostat midway between the plugs and the sensor.  Using the supplied butt connectors, strip the wire ends on   color matched wires (should be a dark blue or black) and crimp them together.  Repeat with the other wire.  Discard the white shrink wrapping.  I wasn't able to get it small enough with a hair dryer or lighter.  Plug the thermostat back into it's respective plugs.  Clip the thermostat back onto the pipe you removed it from.  Replace the back panel with the four screws.  Ensure the bottom of the panel is set inside of the drip tray.  Replace any shelving you removed.  Plug the refrigerator back into the wall.  Your done!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS469522-Frigidaire-5303918214-Defrost-Thermostat-Kit.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS469522-Frigidaire-5303918214-Defrost-Thermostat-Kit.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}