{
  "title": "Refrigerator Evaporator Fan Blade",
  "partUrl": "https://www.partselect.com/PS473177-Frigidaire-5308000010-Evaporator-Fan-Blade.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$47.79",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS473177",
  "manufacturerPartNumber": "5308000010",
  "description": "Refrigerator Evaporator Fan Blade ★★★★★ ★★★★★ 5 Reviews PartSelect Number PS473177 Manufacturer Part Number 5308000010 This evaporator fan blade is a genuine OEM part that is sourced directly from the manufacturer. The evaporator fan blade circulates air through the refrigerator to control the amount of cold air goes that goes to internal compartments of the unit. It may need to be replaced if the fridge is noisy or not cold enough. This part is made of plastic and is sold individually. It will be necessary to disconnect power to the refrigerator and empty the freezer compartment of the refrigerator. The tools needed to complete this repair are a 1/4 inch nut driver and a pair of needle nose pliers.",
  "rating": 4.8,
  "reviewCount": 5,
  "symptoms": [
    "Fridge too warm",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "Jordan from Maumee, OH",
    "title": "Noisy fan",
    "content": "1. Removed the 7 nuts using the nut driver from the freezer back panel inside the freezer.2. Remove the back panel. The evaporator motor and fan are located above the coils.3. Unplug the wiring harness.4. Remove the two gold mounting screws holding the motor and fan in place.5. Remove the motor and fan including the brackets.6. Install the new motor and fan onto the mounting bracket.6a. Attach the green ground to the mounting bracket.7. Screw the two gold screws back into the freezer.8. Attach the new wiring harness.  Note, the old harness had a mounting hole/space for it to connect to the wiring harness of the freezer.  The new motor's harness was not long enough for this, so it is connected freely to the freezer harness.9. Use the hair dryer to melt any ice that may have formed on the coils and hole where the fan goes.10. Turn the freezer on to see if the fan turns on.11. Reinstall the back panel.All done!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS473177-Frigidaire-5308000010-Evaporator-Fan-Blade.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS473177-Frigidaire-5308000010-Evaporator-Fan-Blade.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}