{
  "title": "Estate Dishwasher Door Gasket with Strike - Black",
  "partUrl": "https://www.partselect.com/PS5136129-Whirlpool-W10542314-Dishwasher-Door-Gasket-with-Strike-Black.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$57.96",
  "originalPrice": "$72.45",
  "inStock": false,
  "partSelectNumber": "PS5136129",
  "manufacturerPartNumber": "W10542314",
  "description": "Estate Dishwasher Door Gasket with Strike - Black ★★★★★ ★★★★★ 62 Reviews PartSelect Number PS5136129 Manufacturer Part Number W10542314 This dishwasher door gasket and strike kit is an essential component for maintaining a watertight seal around the dishwasher door and ensuring proper latch operation. The gasket prevents water leakage by forming a tight seal between the door and the tub, while the strike works as a mechanical actuator for the door switch and provides tension for a secure seal. Over time, wear and tear may cause tears, gaps, or cuts in the gasket, leading to leaks. This genuine OEM replacement kit is compatible with select models of Whirlpool, KitchenAid, Maytag, Jenn-Air, Amana, Inglis, and Magic Chef dishwashers. For proper installation, unplug the dishwasher or turn off the circuit breaker to ensure safety. Refer to the installation guide or video for step-by-step instructions, and wear protective gloves while replacing the gasket and strike.",
  "rating": 4.65,
  "reviewCount": 62,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Penny from Manchester, MI",
    "title": "The door gasket stuck to the door a pulled out of place after every use",
    "content": "Worked the new gasket into the groove with a smooth screwdriver and my fingers. No leaks and it stays in place. Parts Select had the right part and I got it fast"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS5136129-Whirlpool-W10542314-Dishwasher-Door-Gasket-with-Strike-Black.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS5136129-Whirlpool-W10542314-Dishwasher-Door-Gasket-with-Strike-Black.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}