{
  "title": "General Electric Dishwasher Door Latch",
  "partUrl": "https://www.partselect.com/PS6447681-GE-WD21X10490-Door-Latch.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$44.19",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS6447681",
  "manufacturerPartNumber": "WD21X10490",
  "description": "General Electric Dishwasher Door Latch ★★★★★ ★★★★★ 49 Reviews PartSelect Number PS6447681 Manufacturer Part Number WD21X10490 This is replacement door latch for your dishwasher. The door latch is attached to the tub frame, and connects to the door strike to keep your dishwasher door closed during operation. If you have a broken or faulty door latch, your dishwasher door may not stay closed, and this can prevent the dishwasher from running. This item is sold individually, and if your door strike is also damaged, you will need to replace that part separately. This is an OEM part sourced directly from the manufacturer.",
  "rating": 4.55,
  "reviewCount": 49,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Will Not Start"
  ],
  "installationInstructions": {
    "author": "James from ALBRIGHTSVLLE, PA",
    "title": "Door latch not functioning",
    "content": "1.  Turn off breaker supplying power to dishwasher in electrical panel2.  Open dishwasher door3. Unscrew the screws that secure the dishwasher to the counter.  4. Tip dishwasher forward.  Identify the non-functioning door latch.  It looks exactly like the replacement.  Unclip the wire harness from the door latch.5. On the inside of the dishwasher, there are 2 screws directly under the door latch.  Unscrew them and carefully set aside.6. Remove old door latch.7. Set new door latch in place. Holding securely, replace screws removed in step 5.  Toward the end they get a little tougher to screw in.8. Plug wire harness into new door latch.9. Re-align dishwasher and re-secure to counter in previous position.  10. Test latch to make sure it closes properly.11.  Turn on breaker in electrical panel.The dishwasher should now function properly."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS6447681-GE-WD21X10490-Door-Latch.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS6447681-GE-WD21X10490-Door-Latch.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}