{
  "title": "Dishwasher Door Spring",
  "partUrl": "https://www.partselect.com/PS724932-Frigidaire-154430601-Door-Spring.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$43.16",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS724932",
  "manufacturerPartNumber": "154430601",
  "description": "Dishwasher Door Spring ★★★★★ ★★★★★ 8 Reviews PartSelect Number PS724932 Manufacturer Part Number 154430601 Sold individually.",
  "rating": 4.25,
  "reviewCount": 8,
  "symptoms": [
    "Door latch failure",
    "Door won’t close"
  ],
  "installationInstructions": {
    "author": "Michael from Redmond, WA",
    "title": "One of the door tension springs  and related plastic clip failed causing door to open under full weight",
    "content": "Per the recommendation from PartSelect.com, I purchased 2 new springs and 2 new clips - one set for each side.  With the bottom cover plate removed below the door, I removed the remaining spring and clip and installed the 2 new springs and clips by hand.  The door now opens with resistance and won't even stay completely opened unless the lower dishwasher tray is rolled out on it.  it's like new.This is the second repair to this dishwasher.  Last year I replaced the door latch that had broken with a replacement purchased from partselect.com.  That repair was also quite easy.PartSelect's full part brochures by model made identifying the needed parts simple, and the replacement a breeze.I even repaired my refrigerator ice maker a couple months ago after purchasing a new control module, and saving both a service fee and the probable full price for a new ice maker.I've repaired my electric clothes dryer too, and hadn't even thought about all the repairs I'd done thanks to this website, until I told the story of my dishwasher.I've probably saved $1000 already.  Wow!I love this site."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS724932-Frigidaire-154430601-Door-Spring.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS724932-Frigidaire-154430601-Door-Spring.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}