{
  "title": "Refrigerator Door Shelf Retainer Bar",
  "partUrl": "https://www.partselect.com/PS734935-Frigidaire-240534901-Door-Shelf-Retainer-Bar.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$37.89",
  "originalPrice": "$47.36",
  "inStock": true,
  "partSelectNumber": "PS734935",
  "manufacturerPartNumber": "240534901",
  "description": "Refrigerator Door Shelf Retainer Bar ★★★★★ ★★★★★ 171 Reviews PartSelect Number PS734935 Manufacturer Part Number 240534901 This door shelf retaining bar, also known as refrigerator door bar retainer or fridge door rack, is a genuine part sourced from the original manufacturer. It is a white This manufacturer-certified Door Shelf Retainer Bar, sometimes otherwise known as the door rack or bar retainer, is a white, plastic part which can be easily installed onto the inside of the refrigerator or freezer door to hold items on the door shelves. It holds items in your fridge and will show physical damage if broken or warped, at which time it should be replaced. Check your user manual and model number to see if this part is right for you. No tools are required for this installation, the part should simply snap into place. This part measures roughly 25 inches wide, 3 inches high, and 5 inches deep. This part is sold individually, and we recommend checking the other door shelf retaining bars on your refrigerator or freezer at the same time as ordering this part to ensure that no others need to be replaced, as they often wear or warp at similar speeds.",
  "rating": 4.75,
  "reviewCount": 171,
  "symptoms": [
    "Door won’t open or close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Cynthia from Long Beach, CA",
    "title": "The retainer door shelf broke 3 years ago",
    "content": "I just snapped the new shelves in place and !voila!  I should've done this years ago."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS734935-Frigidaire-240534901-Door-Shelf-Retainer-Bar.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS734935-Frigidaire-240534901-Door-Shelf-Retainer-Bar.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}