{
  "title": "Refrigerator Water Inlet Valve - 4 Coil",
  "partUrl": "https://www.partselect.com/PS7321353-Frigidaire-242253002-Water-Inlet-Valve-4-Coil.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$142.89",
  "originalPrice": "$178.61",
  "inStock": true,
  "partSelectNumber": "PS7321353",
  "manufacturerPartNumber": "242253002",
  "description": "Refrigerator Water Inlet Valve - 4 Coil ★★★★★ ★★★★★ 5 Reviews PartSelect Number PS7321353 Manufacturer Part Number 242253002 The water inlet valve supplies water to the refrigerator ice maker and water dispenser. This part works with the following brands: Frigidaire, White Westinghouse, Kelvinator, Gibson, Kenmore, Sears, Tappan, & Electrolux. Possible Repair Solution For: Leaking water, water will not dispense, ice maker does not make ice, ice maker does not dispense ice. This is an authentic water inlet valve (4 coil), which works with refrigerators.",
  "rating": 4.6,
  "reviewCount": 5,
  "symptoms": [
    "Ice maker not making ice",
    "Leaking",
    "Not dispensing water"
  ],
  "installationInstructions": {
    "author": "Neville from LITHONIA, GA",
    "title": "Not making ice in both ice maker or dispensing water",
    "content": "To confirm my diagnosis I first replace the filter still no water flow.Check water supply from the wall valve: okRemove the entire inlet valve assembly and sit it over a small bucket.Disconnect the tubing from the bottom of the 1st selenide valve: this is the one leading to the filter.Place cup under water dispenser and activate dispenser. No water discharge from inlet valve confirm valve is bad.Install the new valve matching the colored tubing with the color on each inlet valve.Re-connect the water supply place container under water dispenser and activate: There will be a large gush of air then water. Dispense aprox 1 gallon of water to confirm all the air is purged from the system. Your refrigerator is now back to dispensing water and making ice.Good luck everyone - Neville"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS7321353-Frigidaire-242253002-Water-Inlet-Valve-4-Coil.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS7321353-Frigidaire-242253002-Water-Inlet-Valve-4-Coil.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}