{
  "title": "Refrigerator Water Inlet Valve",
  "partUrl": "https://www.partselect.com/PS7784017-Frigidaire-242252603-Water-Inlet-Valve.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$49.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS7784017",
  "manufacturerPartNumber": "242252603",
  "description": "Refrigerator Water Inlet Valve ★★★★★ ★★★★★ 20 Reviews PartSelect Number PS7784017 Manufacturer Part Number 242252603 If you notice that the ice maker in your refrigerator is leaking or is not making or dispensing ice, you may need to replace the water inlet valve. When energized, the water inlet valve releases water from the supply line into the ice mold. The water inlet valve is in the back of your refrigerator so you will need to pull the fridge out from the wall before completing this repair. To complete this job, you will need a 1/2 inch wrench, a 1/4 inch nut driver and a utility knife. If your old inlet valve has a screw-in fitting, you may need to simply cut the end of the hose to fit in the new part. Be sure to disconnect both the water and power supply from the refrigerator prior to beginning this repair.",
  "rating": 4.4,
  "reviewCount": 20,
  "symptoms": [
    "Ice maker not making ice",
    "Ice maker won’t dispense ice",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Orville from Garland, TX",
    "title": "Was not filling the ice tray full.",
    "content": "I had put in a new ice maker and it still had the problem, (I needed the Ice maker anyway) I installed the vale and while I was at it I put a five year filter on the water line that went from the value to the Ice maker, it took less than one hours, the ice is making like it did when it was new, I could not be more please at theis time. Thanks for your Interest. God bless."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS7784017-Frigidaire-242252603-Water-Inlet-Valve.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS7784017-Frigidaire-242252603-Water-Inlet-Valve.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}