{
  "title": "Electrolux Refrigerator Water Inlet Valve",
  "partUrl": "https://www.partselect.com/PS7784018-Frigidaire-242252702-Refrigerator-Water-Inlet-Valve.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$56.19",
  "originalPrice": "$90.98",
  "inStock": true,
  "partSelectNumber": "PS7784018",
  "manufacturerPartNumber": "242252702",
  "description": "Electrolux Refrigerator Water Inlet Valve ★★★★★ ★★★★★ 112 Reviews PartSelect Number PS7784018 Manufacturer Part Number 242252702 The function of the Refrigerator Water Inlet Valve (Triple Solenoid Water-Valve, Water Valve, Water Inlet Valve, Refrigerator Water Inlet Valve Assembly) is to release water from the supply line when activated, and send it through to your water dispenser or ice maker in your refrigerator. The water inlet valve is located at the back of the refrigerator, and connects to the water supply. The valve can break from material fatigue or normal use. If your water inlet valve is malfunctioning, you could be getting a lack of water to the inside of your refrigerator. Your ice maker may not produce cubes or your water dispenser may not work. The water inlet valve must be replaced if the solenoids no longer have continuity or the valve has internal blockage. This valve measures approximately 7 inches long and 4.5 inches wide, and is constructed of plastic and metal. It comes in blue, and includes the valve and mounting bracket.",
  "rating": 4.63,
  "reviewCount": 112,
  "symptoms": [
    "Ice maker dispenses too little ice",
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "Jose from Alexandria, VA",
    "title": "water leaking out of refrigerator",
    "content": "In my specific appliance the water valve is located in the bottom right hand corner looking at it from the back.  To get to it I remove the thin layer of cardboard the covers the back of the fridge. I then proceeded to disconnect the 1/4\" copper tubing which is the water feed coming out of the wall. Then I removed the screws that hold the valve assembly in place. I took the water valve out and removed  the electrical connections as well as the plastic tubing which feed the water dispenser and the ice maker. To install the new water valve it was just a matter of reversing steps."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS7784018-Frigidaire-242252702-Refrigerator-Water-Inlet-Valve.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS7784018-Frigidaire-242252702-Refrigerator-Water-Inlet-Valve.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}