{
  "title": "Dishwasher Door Spring",
  "partUrl": "https://www.partselect.com/PS815938-Frigidaire-154430501-Door-Spring.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$34.99",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS815938",
  "manufacturerPartNumber": "154430501",
  "description": "Dishwasher Door Spring ★★★★★ ★★★★★ 9 Reviews PartSelect Number PS815938 Manufacturer Part Number 154430501 This door spring is manufactured for a dishwasher door. The door spring applies tension to the dishwasher door so that the door does not drop too quickly when it is opening. If the door drops too quickly, it could cause damage to the dishwasher door or dishwasher door hinges. This spring is sold individually. Check the spring on the opposite side of the dishwasher door, they often wear at the same rate so you may want to replace both springs for exact tension on either side. No tools are required for this repair. This is an OEM replacement part.",
  "rating": 4.78,
  "reviewCount": 9,
  "symptoms": [
    "Door latch failure",
    "Door won’t close"
  ],
  "installationInstructions": {
    "author": "Daniel from Fremont, NE",
    "title": "Dishwasher door practically fell open",
    "content": "All I had to do was replace the spring and retainer on the side of the dishwasher which amounted to pulling it out far enough to reach the eyelet that the hook went into and then stretching it to the retainer attached on the other end.  I really like partselect, I have done some things in the past and they are very helpful on the site and on the phone and I would recommend them to anyone and I would not normally do that unless it has been an excellent experience."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS815938-Frigidaire-154430501-Door-Spring.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS815938-Frigidaire-154430501-Door-Spring.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}