{
  "title": "Dishwasher Flood Switch",
  "partUrl": "https://www.partselect.com/PS8690623-GE-WD21X10519-Flood-Switch.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$46.89",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS8690623",
  "manufacturerPartNumber": "WD21X10519",
  "description": "Dishwasher Flood Switch ★★★★★ ★★★★★ 57 Reviews PartSelect Number PS8690623 Manufacturer Part Number WD21X10519 This is a flood switch assembly for your washer. The flood switch controls the hot and cold water filling your washer tub to ensure the proper amount of water. You may need to replace this part if your washer is overfilling or underfilling with water. It is about 5.5 inches in length, and mostly black in color with a green tip.",
  "rating": 4.82,
  "reviewCount": 57,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "Jeff from AUBURNDALE, MA",
    "title": "No water flowing into dishwasher",
    "content": "We tried cleaning out the filter and it clogged with a huge amount of gunk. We removed the gunk, scrubbed the filter, and tried running the dishwasher, but still no water. That took over an hour (not counting the time the dishwasher spent running). Then we tried your diagnosis center and it pointed to the flood switch or the water valve. I extracted the flood switch (another 30-60 minutes) to check it, and it also contained gunk and (significantly) did not rattle, which made me suspect the flood switch was the problem, so I ordered one. Once the replacement arrived, I checked it and the flood switch rattled, confirming that it should work properly. I spent 30-45 minutes installing it, plus the filter assembly and racks I had to remove to access it. Ran the dishwasher and everything came out sparkling clean. I don't know where the gunk came from, but if you aren't getting water and the filter is full of gunk, check the flood switch."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS8690623-GE-WD21X10519-Flood-Switch.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS8690623-GE-WD21X10519-Flood-Switch.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}