{
  "title": "Refrigerator Ice Maker Assembly - 8 Cube",
  "partUrl": "https://www.partselect.com/PS869316-Whirlpool-2198597-Ice-Maker-Assembly-8-Cube.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$115.89",
  "originalPrice": "$144.95",
  "inStock": true,
  "partSelectNumber": "PS869316",
  "manufacturerPartNumber": "2198597",
  "description": "Refrigerator Ice Maker Assembly - 8 Cube ★★★★★ ★★★★★ 99 Reviews PartSelect Number PS869316 Manufacturer Part Number 2198597 This Ice Maker (Icemaker Assembly, Complete Icemaker Assembly, Ice Maker Assembly, Refrigerator Ice Maker) can be used with 25-27 cubic feet refrigerators that have a vertical auger dispenser located on the freezer door. It’s used to make ice. When this part fails, no ice cubes will be made. It could prevent the icemaker from filling with water or just prevent the harvesting of the ice cubes. This is a sign the part should be replaced. The parts electrical contacts and motor can fail due to normal wear and tear. The icemaker attaches to the ceiling of the freezer compartment. This assembly measures 11 inches by 5 inches, is constructed of plastic and metal, and comes in black/white.",
  "rating": 4.75,
  "reviewCount": 99,
  "symptoms": [
    "Ice maker dispenses too little ice",
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "Phil from Auberry, CA",
    "title": "Ice maker stopped functioning",
    "content": "Remove the icemaker service door... gently pry the door pins from the hinge sockets.  Remove the 3 screws from the under side of the icemaker with a nut driver (1/4\").  Gently remove the icemaker .  It's a tight fit between the top of the compartment and the icemaker lower support tray.  Next, disconnect the electrical connector at the right side.  You're done!  Reverse procedure for installing.  Good luck.  Remember, your working with cold plastic...take your time and don't force too much."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS869316-Whirlpool-2198597-Ice-Maker-Assembly-8-Cube.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS869316-Whirlpool-2198597-Ice-Maker-Assembly-8-Cube.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}