{
  "title": "Kelvinator Dishwasher Drain Pump -120V 60Hz",
  "partUrl": "https://www.partselect.com/PS8689824-Frigidaire-A00126401-Drain-Pump-120V-60Hz.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$100.36",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS8689824",
  "manufacturerPartNumber": "A00126401",
  "description": "Kelvinator Dishwasher Drain Pump -120V 60Hz ★★★★★ ★★★★★ 16 Reviews PartSelect Number PS8689824 Manufacturer Part Number A00126401 This is a drain pump assembly for various compatible models of dishwashers, that is responsible for draining the water from the dishwasher after every cycle. This drain pump assembly is made of plastic and fits within the sump assembly, which controls the flow of water into the drain. This drain pump assembly is a genuine OEM part and is made of a high-quality plastic but is sold as an individual component without any other parts, like its drain pump check ball which works within the pump to prevent water from backwashing into the pump, as well as the drain pump cover. If you notice your dishwasher is not draining or has a lot of water buildup at the bottom of the sump assembly, this filter may be damaged, clogged or broken, and in need of a replacement. To replace this pump assembly, you will only need a Philips-head screwdriver, but should start by removing your dishwasher racks. Then, pull up on the lower spray arm, and drain trap to remove them. Next, rotate the spray arm support and pull that up to remove it, at which point you can remove the base and filter for the drain pump. With those out, you can use your Philips-head screwdriver to disconnect and remove the cover and drain pump assembly. With the pump removed, you can inspect it or install the new drain pump assembly, with the same hardware as before. Then it is as simple as reassembling the rest of your dishwasher, ensuring each connection point is fastened tightly.",
  "rating": 4.88,
  "reviewCount": 16,
  "symptoms": [
    "Leaking",
    "Noisy",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "William from FRANKLIN, TN",
    "title": "Dishwasher stopped draining",
    "content": "Under sink: Disconnected drain hose to garbage disposal, shutoff water feed, unplugged power.Under Dishwasher:Removed water feed connection.On top of Dishwasher:Removed screws anchoring it to cabinet.Pulled dishwasher out and flipped down so it’s resting on the front.Removed drain hose on drain pump.Removed 3 torx screws on pump, greased o-ring on new pump and reinstalled doing the reverse of these instructions.Took 1 hour and now it works great!"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS8689824-Frigidaire-A00126401-Drain-Pump-120V-60Hz.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS8689824-Frigidaire-A00126401-Drain-Pump-120V-60Hz.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}