{
  "title": "Dishwasher Latch Striker",
  "partUrl": "https://www.partselect.com/PS8690622-GE-WD13X10071-Latch-Striker.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$8.06",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS8690622",
  "manufacturerPartNumber": "WD13X10071",
  "description": "Dishwasher Latch Striker ★★★★★ ★★★★★ 3 Reviews PartSelect Number PS8690622 Manufacturer Part Number WD13X10071 This dishwasher latch strike is a manufacturer-approved replacement part for your appliance. The latch strike is an important component in your dishwasher door assembly, and adds an extra layer of security in keeping the door closed. This part may become damaged if the door has been opened during a wash cycle. It can also wear out over time. It is fairly easy to replace, simply pop out the old door strike using a screwdriver for leverage, and insert the new one.",
  "rating": 4.67,
  "reviewCount": 3,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Will Not Start"
  ],
  "installationInstructions": {
    "author": "Jeff from Downingtown, PA",
    "title": "Doesn't complete dry cycle, no clean light, random noises as if door was closing",
    "content": "Removed toe kick.  Removed door counter weights and placed door on soft surface.  Removed two bolts(I was able to leave hinges in place) slid door panel down and off.  Removed plastic snap fit cover and 4 bolts from UI board.  Two of the stand-offs where broken, glued them back into place.  Ensured jumpers were set to my model, snapped cover back in place and remounted door.  The dishwasher now runs through the cycle and clean light but did not dry.  That turned out to be a bad flood switch."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS8690622-GE-WD13X10071-Latch-Striker.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS8690622-GE-WD13X10071-Latch-Striker.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}