{
  "title": "Bosch Dishwasher Rack Roller Wheel",
  "partUrl": "https://www.partselect.com/PS8727423-Bosch-00611666-Rack-Roller-Wheel.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$10.28",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS8727423",
  "manufacturerPartNumber": "00611666",
  "description": "Bosch Dishwasher Rack Roller Wheel ★★★★★ ★★★★★ 11 Reviews PartSelect Number PS8727423 Manufacturer Part Number 00611666 This wheel is a dishwasher rack wheel designed for the upper rack of your appliance. The roller wheel is approximately 1.25 inches in diameters and includes the brushing you need for installation. It simply clips right on to the rack frame. After the wheel are attached to the side of the dishrack and are placed into the slides on either side of the appliance. Dishrack roller wheels allow the upper rack in a dishwasher to glide in and out of the appliance with ease. Due to the fact the roller wheel is made of plastic they tend to wear out after a period of time, also they can break. We do recommend you replace these rack wheels in pairs as they often wear out at the same rate. These wheels are sold individually.",
  "rating": 4.64,
  "reviewCount": 11,
  "symptoms": [],
  "installationInstructions": {
    "author": "Catherine from AMHERST, NY",
    "title": "The plastic clip on the roller broke",
    "content": "We let this go for a shameful amount of time before I decided I could probably fix it.  The roller broke so you could only  pull it out about halfway or it would come off the track. I looked up the part, and bought it. Actually bought two in case it happened again. When I arrived I looked at how it was put together on the other side and then just basically pushed it onto the rod and it was fixed. I am ashamed it took so long to do it. Never be afraid to try it yourself. It was a total of $10 shipped to fix it."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS8727423-Bosch-00611666-Rack-Roller-Wheel.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}