{
  "title": "Bosch Dishwasher Mounting Bracket",
  "partUrl": "https://www.partselect.com/PS8728568-Bosch-00619985-Mounting-Bracket.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$8.67",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS8728568",
  "manufacturerPartNumber": "00619985",
  "description": "Bosch Dishwasher Mounting Bracket ★★★★★ ★★★★★ 6 Reviews PartSelect Number PS8728568 Manufacturer Part Number 00619985 Sold individually.",
  "rating": 3,
  "reviewCount": 6,
  "symptoms": [
    "Door latch failure"
  ],
  "installationInstructions": {
    "author": "Raymond from GLENDALE, AZ",
    "title": "Bosch mounting bracket install",
    "content": "Hello,I received the parts 12/10/23.  Thank you for your prompt shipping.  It was exactly what I needed and the fix went quickly with no issues.I ordered two of PS8728568 (Mounting Bracket), because on your site for that part it identifies that each bracket is sold individually. (Reference: “Part Description” section).  In addition, on that same web page under the “Question and Answers” section it identifies that each bracket is sold individually. However, what I received was, two packages with each package having two brackets in it.  It’s understandable, since you need two brackets for each dishwasher.Obviously, this is completely contrary to what your web page states.  In reality, each package is sold with a pair of brackets.I have not opened the second package and as such it is completely resaleable.  As per your Return Policy , I’d like to request a refund for the second packet of brackets and have you cover the return shipping of that package.  Please advise next steps."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS8728568-Bosch-00619985-Mounting-Bracket.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS8728568-Bosch-00619985-Mounting-Bracket.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}