{
  "title": "Haier Refrigerator Light Switch",
  "partUrl": "https://www.partselect.com/PS8758429-GE-WR23X10725-Light-Switch.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$8.56",
  "originalPrice": "",
  "inStock": false,
  "partSelectNumber": "PS8758429",
  "manufacturerPartNumber": "WR23X10725",
  "description": "Haier Refrigerator Light Switch ★★★★★ ★★★★★ 62 Reviews PartSelect Number PS8758429 Manufacturer Part Number WR23X10725 The interior light of your refrigerator is controlled by a switch that is activated when the door is opened and closed. If your refrigerator light will not turn on, there could be an issue with the switch. The switch is spring loaded and is a generally closed type of switch meaning there should be no continuity when the button is depressed, and continuity through the switch when the button is not depressed. This plastic, white, OEM switch is sourced directly from the manufacturer, is sold individually and is easy to replace. The repair usually takes less than 15 minutes and requires a flat blade screwdriver and needle nose pliers.",
  "rating": 4.77,
  "reviewCount": 62,
  "symptoms": [
    "Fridge too warm",
    "Light not working"
  ],
  "installationInstructions": {
    "author": "Jonathan from Lilburn, GA",
    "title": "Sticking Light Switch",
    "content": "I applied some tips learned by reading other reviews. So before I started I grabbed my trusty vise grip pliers and a small screw driver. I locked onto the switch actuator, the part that the refrigerator door pushes in, with the vise grips and pulled on it just hard enough to get the screw driver inserted in the right side to push in the catch clip so the switch could be pulled out further each time the catch clip was depressed to the next detent. Then I used the screw driver on the left site to encourage the switch past the detents on the left and very quickly the switch was out of the mount. The wires from the refrigerator pulled out with the old switch. I unplugged the old switch from the wires and plugged in the new switch and shoved the new switch back into the mount, wiggled it a couple of times to make sure it was secure and the job was done. Once I applied the vise gripes at first, the whole job took less than a minute."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS8758429-GE-WR23X10725-Light-Switch.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS8758429-GE-WR23X10725-Light-Switch.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}