{
  "title": "Dishwasher Water Valve",
  "partUrl": "https://www.partselect.com/PS8728724-Bosch-00622058-Water-Valve.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$53.52",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS8728724",
  "manufacturerPartNumber": "00622058",
  "description": "Dishwasher Water Valve ★★★★★ ★★★★★ 16 Reviews PartSelect Number PS8728724 Manufacturer Part Number 00622058 The dishwasher water inlet valve controls the water flow into your appliance, ensuring proper fill levels for effective cleaning. This genuine OEM replacement part is compatible with select Bosch, Thermador, and Gaggenau models and meets strict quality standards. If the valve is defective, the dishwasher may fail to fill or underfill. To install, unplug the dishwasher, shut off the water supply, and wear gloves for safety. Verify compatibility before ordering.",
  "rating": 4.75,
  "reviewCount": 16,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "Bill from NORTH HALEDON, NJ",
    "title": "The valve allowed water to fill the dishwasher when not in use.",
    "content": "This was the third time I replaced a fill valve in a Bosch diswasher, twice in this unit and once in a previous unit. I read the installation hints on your web site and want to add the following suggestion.The notes on your web site say you can remove the valve from behind the toe face and pull it out to reach the hose and plug. I found that the Bosch designers called for both the hose and wire to on the short side. I found that pulling the dishwasher forward 6\" to 9\" allows you to access these connections from the side at least to hold them while making the connection. I hope this helps. Thank you, Bill"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS8728724-Bosch-00622058-Water-Valve.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS8728724-Bosch-00622058-Water-Valve.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}