{
  "title": "General Electric Refrigerator Ice and Water Filter",
  "partUrl": "https://www.partselect.com/PS8746144-GE-MWFP-Refrigerator-Ice-and-Water-Filter.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$68.37",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS8746144",
  "manufacturerPartNumber": "MWFP",
  "description": "General Electric Refrigerator Ice and Water Filter ★★★★★ ★★★★★ 77 Reviews PartSelect Number PS8746144 Manufacturer Part Number MWFP This OEM ice and water filter fits side-by-side and bottom-freezer GE models. The most common reason you would need to change this part is if you have never updated your model and it is no longer filtering your water. This also may lead to your refrigerator not dispensing water or ice properly. Manufacturers recommend you change your filter every six months to ensure it properly filters impurities. Depending on the model, a red light might also indicate that the filter is due for a replacement. Note: As per the manufacturer, this is an updated water filter. If you have never installed the updated part or your old model was made by Culligan, you may need the adapter to install the filter. See related parts. This filter is located inside the refrigerators upper right corner. It is common for water to drip from the dispenser when being changed so place a cloth underneath before you begin this repair. To remove the filter, turn it to the left until it releases without pulling down. Fill the new filter with tap water to prepare it. Position the new filter into the holder taking note of the arrows. The arrow on the front should be facing out. Gently push up on the filter and turn it to the right to secure it. Do not over-tighten. To release air in the system run 1-1/2 gallons of water through it. If your model has a reset button, press and hold this for a few seconds to reset it.",
  "rating": 4.69,
  "reviewCount": 77,
  "symptoms": [
    "Ice maker dispenses too little ice",
    "Ice maker not making ice",
    "Ice maker won’t dispense ice"
  ],
  "installationInstructions": {
    "author": "George from MIAMI, FL",
    "title": "Mostly cosmetic, ice funnel broken, not dispensing water",
    "content": "Just look at the parts diagram and follow the explanation. That easy.  Still not dispensing water, so i think i need a switch since the water filter is new but no water."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS8746144-GE-MWFP-Refrigerator-Ice-and-Water-Filter.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS8746144-GE-MWFP-Refrigerator-Ice-and-Water-Filter.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}