{
  "title": "Admiral Refrigerator Light Bulb - 40W",
  "partUrl": "https://www.partselect.com/PS884734-Whirlpool-8009-Light-Bulb-40W.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$11.72",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS884734",
  "manufacturerPartNumber": "8009",
  "description": "Admiral Refrigerator Light Bulb - 40W ★★★★★ ★★★★★ 67 Reviews PartSelect Number PS884734 Manufacturer Part Number 8009 This an authentic OEM 40-Watt replacement light bulb, used in a number of household appliances. It is specially designed to withstand extreme temperatures, which is why these replacement bulbs are most often used to light the inside of refrigerators and ranges. It features a standard socket base, which means you simply unscrew the burnt-out bulb and screw in the replacement. Depending on the appliance you may require a screwdriver or nut driver to access the light bulb. We recommend you wear work gloves while handling this replacement part. It is constructed of glass and metal and is sold individually. Depending on the appliance and location of the bulb within it, you may want to consider disconnecting power and using a flashlight for easier access to unscrewing and re-screwing in your bulb during this repair.",
  "rating": 4.66,
  "reviewCount": 67,
  "symptoms": [],
  "installationInstructions": {
    "author": "judie from mays landing, NJ",
    "title": "interior drawers were off their rollers",
    "content": "pulled the washer out and replaces the top roller system on both sides and the replaced the weels and brackets on the bottom drwaer. however i had trouble putting the dish washer back correctly and had to call a repairman to adjust the dishwasher and alighn it to open and close properly. but i did do good inside. i feel it was easy and a success. thank you for having the supplies for us to attempt to repair it on our own."
  },
  "readMoreLinks": {
    "instructions": "https://www.partselect.com/PS884734-Whirlpool-8009-Light-Bulb-40W.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}