{
  "title": "Electrolux Dishwasher Wash Arm Bearing",
  "partUrl": "https://www.partselect.com/PS9492561-Frigidaire-807035801-Wash-Arm-Bearing.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$21.56",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS9492561",
  "manufacturerPartNumber": "807035801",
  "description": "Electrolux Dishwasher Wash Arm Bearing ★★★★★ ★★★★★ 1 Review PartSelect Number PS9492561 Manufacturer Part Number 807035801 This part is the replacement wash arm bearing for your dishwasher. It is made of black plastic and is approximately 1 1/4 inches in diameter. The wash arm bearing allows the wash arm to rotate when the dishwasher is operating. A broken bearing can make the wash arm difficult to rotate, and when this occurs, your dishes may not be washed properly. This part is sold individually and is an authentic OEM part sourced directly from the manufacturer.",
  "rating": 5,
  "reviewCount": 1,
  "symptoms": [
    "Not cleaning dishes properly"
  ],
  "installationInstructions": {
    "author": "Ernest from POWELL, WY",
    "title": "Portions of the rack had the coating wear off, exposing the metal, which began to rust.",
    "content": "Removing the old rack was accomplished by removing the grey retainer clips located at the end of the silver rack guides. This allows the entire upper rack to slide out of the guide tracks. Unless you purchased all of the additional parts associated with the rack you must remove the needed old parts such as the spray arm, plate guides, wheel assemblies, etc. to complete the replacement and reassembly. Each of these pieces are \"snapped on\" by clips that are removed with moderate difficulty. Mostly due to the apprehension that you are going to break them, however, with only the pressure exerted by your fingers they will snap off and will go actually go back on easier. The order you remove and replace the various parts is your choice. The exact positioning of the parts back on the new rack is critical, so if your memory is not good, take a quick photo with your cell phone for reference. The only tool I used was a small screwdriver to separate the clip when I first removed the rack, but in retrospect I could have removed it by hand. The key thing to remember is do not apply excess force when trying to remove the old parts, just direct  pressure with your fingers. Good luck, it took me only about 15 minutes from start to finish. The best part is I probably saved $150.00 by doing it myself, figuring service time for a repairman, plus his mark-up on the parts."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS9492561-Frigidaire-807035801-Wash-Arm-Bearing.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS9492561-Frigidaire-807035801-Wash-Arm-Bearing.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}