{
  "title": "Refrigerator Door Gasket - White",
  "partUrl": "https://www.partselect.com/PS9493819-Frigidaire-242193206-Refrigerator-Door-Gasket-White.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$135.89",
  "originalPrice": "$169.86",
  "inStock": true,
  "partSelectNumber": "PS9493819",
  "manufacturerPartNumber": "242193206",
  "description": "Refrigerator Door Gasket - White ★★★★★ ★★★★★ 10 Reviews PartSelect Number PS9493819 Manufacturer Part Number 242193206 This is an OEM door gasket, also known as a door seal, for various refrigerators. A door gasket is used to create a barrier between the warmer, ambient temperature of your home, and the cooler interior of the refrigerator. But if used for a long period of time, or simply after general wear and tear, this gasket can tear, break, and/or warp. If your gasket is broken, warped, or moldy, it will need to be replaced immediately. To replace this gasket, carefully peel out the old gasket and discard it, then carefully wrap the new gasket around the frame of the fridge door to install it. This door gasket is white and rectangular and measures 28.5 inches long, .75 inches thick, and approximately 42 inches wide. This door gasket is sold individually and does not come with any other parts or accessories.",
  "rating": 4.2,
  "reviewCount": 10,
  "symptoms": [
    "Door Sweating",
    "Door won’t open or close",
    "Fridge too warm"
  ],
  "installationInstructions": {
    "author": "Lorrie from LOMPOC, CA",
    "title": "Refrigerator section wasn't chilling",
    "content": "I pulled the old gasket off and thoroughly cleaned the entire refrigerator door, including the area where the gasket would pop into.  Starting at the two upper corners, I pushed the corners into the ridge in the door and used my thumbs to press the gasket in along the top of the door.  I then went about halfway down the door using my thumbs to push in the gasket.  Then I pushed the lower corners in, taking my thumbs up either side of the door to finish installing that section then I pushed the bottom in, checking the lower corners to make sure they were secure.  Then I closed the door and made sure the seal was secure on both sides of the door."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS9493819-Frigidaire-242193206-Refrigerator-Door-Gasket-White.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS9493819-Frigidaire-242193206-Refrigerator-Door-Gasket-White.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}