{
  "title": "Gibson Dishwasher Drain Hose",
  "partUrl": "https://www.partselect.com/PS9494138-Frigidaire-807117001-Dishwasher-Drain-Hose.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$26.66",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS9494138",
  "manufacturerPartNumber": "807117001",
  "description": "Gibson Dishwasher Drain Hose ★★★★★ ★★★★★ 21 Reviews PartSelect Number PS9494138 Manufacturer Part Number 807117001 If your dishwasher is leaking or not draining properly, you may need to replace the drain hose. The drain hose connects to the pump located below the lower spray arm and aids in proper dishwasher drainage. This white and black plastic hose is 7.5 feet long. For this repair, you will need either a 1/4-inch or 5/16-inch nut driver, depending on your model. You will need to remove the lower access panel on your dishwasher to complete this repair; it is often easier to remove the dishwasher from the cabinet to do so. Be sure to disconnect the dishwasher from both the power and water supply before completing this repair.",
  "rating": 5,
  "reviewCount": 21,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Not draining"
  ],
  "installationInstructions": {
    "author": "John from Carthage, MO",
    "title": "Drain hose was missing",
    "content": "My friend bought a used dishwasher at a garage sale, the previous owner had thrown away the drain hose because it was \"nasty\" they said....remember it could have been cleaned. When I went to install it, I removed the old washer, and discovered that the old hose would not fit on the replacement dishwasher. I went to the local repair shop, armed with the model and serial #'s. they searched and searched their books and could not find the  hose part number. they said \"good luck\" when I left...I went home and looked up the model on your web site, ordered the hose, and in 3 days had the dishwasher installed and running in about 30 minutes...thanks for prompt shipping.. I couldn't believe it arrived so soon...Mowerman"
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS9494138-Frigidaire-807117001-Dishwasher-Drain-Hose.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS9494138-Frigidaire-807117001-Dishwasher-Drain-Hose.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}