{
  "title": "Dishwasher Bottom Door Gasket",
  "partUrl": "https://www.partselect.com/PS9495545-Frigidaire-809006501-Dishwasher-Bottom-Door-Gasket.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$21.06",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS9495545",
  "manufacturerPartNumber": "809006501",
  "description": "Dishwasher Bottom Door Gasket ★★★★★ ★★★★★ 184 Reviews PartSelect Number PS9495545 Manufacturer Part Number 809006501 This dishwasher door gasket (Bottom Gasket, Gasket, Door Seal, Dishwasher Door Lower Seal) helps prevent water from leaking out of the bottom edge of your dishwasher door by creating a watertight seal. This part is attached to the bottom of your dishwasher inner door panel. It is frequently exposed to water and detergent during its lifetime. The water and chemicals can eventually wear down the gasket and compromise the integrity of the seal. If the gasket is malfunctioning, the integrity of the door seal will be effected. You will notice leaking through the bottom of your dishwasher door. If your dishwasher is leaking water from the bottom of the door, first inspect the seal for food particles near the bottom and sides, and remove the buildup, as it can stop the door from closing properly and keeping a tight seal; if not, you may need to replace the bottom door gasket. Check the door gasket for tears, cuts, or wear. This part is sold individually and measures 22.5 inches by 1.25 inches. It is constructed of plastic, and comes in yellow/grey. Includes one lower door gasket.",
  "rating": 4.72,
  "reviewCount": 184,
  "symptoms": [
    "Door latch failure",
    "Door won’t close",
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Scott from Flowood, MS",
    "title": "Bottom Door Seal fell apart and started leaking.",
    "content": "First I opened the door all the way. Second I reached down to the bottom gasket then grabed it on the right end of the seal that is on the right side of the door. Then I pulled the end outward from the bottom of the door toward the heater coil in the bottom of the washer. It came out real easy. You see it just snaps into a little plastic groove under the door. I then cleaned up the area for food and soap particules. I then placed the new gasket in place by lining up the notch toward the right end with the piece of plastic that encloses the right end of the plastic notch on the bottom right end of the door. Then push it in untill it stops going into the notch. It snaps in but does not make a snaping sound. It just won't go in no more."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS9495545-Frigidaire-809006501-Dishwasher-Bottom-Door-Gasket.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS9495545-Frigidaire-809006501-Dishwasher-Bottom-Door-Gasket.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}