{
  "title": "Refrigerator Dispenser Door Assembly or Flapper",
  "partUrl": "https://www.partselect.com/PS964304-GE-WR17X11653-Dispenser-Door-Assembly-or-Flapper.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$15.57",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS964304",
  "manufacturerPartNumber": "WR17X11653",
  "description": "Refrigerator Dispenser Door Assembly or Flapper ★★★★★ ★★★★★ 88 Reviews PartSelect Number PS964304 Manufacturer Part Number WR17X11653 This “Dispenser Door Assembly” (Door Recess Assembly, Ice Door Assembly, Dispenser Door, Refrigerator Dispenser Ice Chute Door Kit, Dispenser Door Flap, Ice Chute Door, Flapper) keeps the room air from infiltrating the freezer. Once the lever is pressed, the door flap opens and allows the ice to dispense into your container. If your door flapper is broken, it could allow outside air to enter the freezer and alter the inside temperature. You may notice frost buildup surrounding the dispenser area. The door flap can disconnect from the dispenser lever, or the tabs that hold it in place may break. Frequent use may distort the sealing face and cause air leaks and frost buildup. This part mounts in the ice dispenser, and measures approximately 3.25 inches in diameter. It is constructed of plastic and rubber, and comes in white/black. This part is sold individually.",
  "rating": 4.67,
  "reviewCount": 88,
  "symptoms": [
    "Door Sweating",
    "Door won’t open or close",
    "Freezer not defrosting"
  ],
  "installationInstructions": {
    "author": "ALBERT from RALEIGH, NC",
    "title": "Our Ice Damper was warped, which let warm air into the freezer and caused frost to form.  Also, our ice and water dispensers stopped working.",
    "content": "Swapping out the ice dispenser damper door was pretty easy- just used a combination of screwdrivers to remove the dispenser assembly, popped the old damper off, put the new damper on.  Replacing the control board was only a bit more complicated- unplugged the fridge, removed the control board metal cover (beware the somewhat sharp edges), unhooked all the cables from the board, used needle-nose pliers to pinch each plastic spacer/fastener as to not damage them while removing the old board, mounted the new board where the old board was, and plugged in all the cables (they were all different enough from each other that I didn't have any trouble figuring out where they were supposed to connect).  I now have my fridge plugged into a surge protector- hopefully that will protect this new board I've installed.  Thanks a bunch,PartSelect."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS964304-GE-WR17X11653-Dispenser-Door-Assembly-or-Flapper.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS964304-GE-WR17X11653-Dispenser-Door-Assembly-or-Flapper.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}