{
  "title": "Samsung Refrigerator Evaporator Fan Motor",
  "partUrl": "https://www.partselect.com/PS9603956-Samsung-DA81-06013A-Refrigerator-Evaporator-Fan-Motor.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$131.50",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS9603956",
  "manufacturerPartNumber": "DA81-06013A",
  "description": "Samsung Refrigerator Evaporator Fan Motor ★★★★★ ★★★★★ 6 Reviews PartSelect Number PS9603956 Manufacturer Part Number DA81-06013A This is an evaporator fan motor for a wide range of Samsung refrigerators. Evaporator fans pull warm air through evaporator coils to cool and maintain the internal temperature of the refrigerator. If the evaporator fan motor in your refrigerator is not working properly, your fridge will not cool properly and may even prevent the ice maker and water dispenser from working, and it will ultimately need to be replaced. This OEM evaporator fan motor measures approximately 4 inches long by 4 inches wide and will need a screwdriver and needle nose pliers to be removed and installed.",
  "rating": 5,
  "reviewCount": 6,
  "symptoms": [
    "Fridge too warm",
    "Noisy"
  ],
  "installationInstructions": {
    "author": "James from VISALIA, CA",
    "title": "Main refrigerator was not cooling down adequately.",
    "content": "I looked up a YouTube video and it gave pretty well laid out instructions on how to replace the Twin fan assembly in the main compartment.There was also a suspicion that the sensor wasn't working properly and the fan had ice on it.Once I removed the main housing at the back of the inside of refrigerator it was relatively easy to replace the fan motor, and sensor.You have to follow the disassemble procedure closely in getting the main housing out.You have to remove the clear plate covering the water filter. Then remove the bottom shelf, which then gives you access to the large white back panel. After that its easy to replace the motor and sensor."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS9603956-Samsung-DA81-06013A-Refrigerator-Evaporator-Fan-Motor.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS9603956-Samsung-DA81-06013A-Refrigerator-Evaporator-Fan-Motor.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}