{
  "title": "Refrigerator Evaporator Drip Pan",
  "partUrl": "https://www.partselect.com/PS964475-GE-WR17X11843-Evaporator-Drip-Pan.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$42.34",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS964475",
  "manufacturerPartNumber": "WR17X11843",
  "description": "Refrigerator Evaporator Drip Pan ★★★★★ ★★★★★ 10 Reviews PartSelect Number PS964475 Manufacturer Part Number WR17X11843 This is the replacement evaporator drip pan, also known as the drain trough, for your refrigerator. You will find the drip pan in the fresh food section of the refrigerator. It collects any water that may drip off the evaporator. If your drip pan is rusted, or is leaking into the refrigerator, you may need to replace it. Before you install the new drip pan, you will want to thoroughly clean the areas around the evaporator to ensure there is no more remaining rust or debris. This part is sold individually and is an OEM part sourced directly from the manufacturer.",
  "rating": 4.7,
  "reviewCount": 10,
  "symptoms": [
    "Leaking"
  ],
  "installationInstructions": {
    "author": "Gregory from El Dorado, AR",
    "title": "Trough Drain pan was rusted",
    "content": "First I removed the shelving from the refrigerator side I then removed the cover to the refrigerator condenser which consisted of a plastic cover and a styrofoam inner chamber cover. The Condenser is held in place with two stainless phillips head screws. I removed the screws and gently pulled the condenser forward so that the Drain pan could be easily removed. The drain pan is made out of thin sheet metal with a galvanized coating that will not hold up it will start rusting in a short time. I inspected the drain pan cleaned it up with a little Muretic acid and it had too many rust holes so I couldn't repair it. I ordered a new Drain pan on Part Select and when it came in I washed it and dried it completely then I sprayed it with Cold Galvanizing compound with zinc particles. You can get this from Home Depot on the spray paint isle. Hopefully the spray Galvanizing will keep it from rusting in the future and leaking inside the refrigerator. The Trough Drain Pan should have been made of Stainless sheet metal or plastic I don't really know why they used the galvanized coated pan. Everything went back together in reverse with no problems. Hopefully this drain pan will last longer than the first drain pan because it was only 4 years old. I remember when the older refrigerators would run for decades."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS964475-GE-WR17X11843-Evaporator-Drip-Pan.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS964475-GE-WR17X11843-Evaporator-Drip-Pan.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}