{
  "title": "Refrigerator Freezer Door Handle Kit - White",
  "partUrl": "https://www.partselect.com/PS9864030-GE-WR12X22148-Refrigerator-Freezer-Door-Handle-Kit-White.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$84.54",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS9864030",
  "manufacturerPartNumber": "WR12X22148",
  "description": "Refrigerator Freezer Door Handle Kit - White ★★★★★ ★★★★★ 67 Reviews PartSelect Number PS9864030 Manufacturer Part Number WR12X22148 This door handle kit includes handles for both the refrigerator and freezer. It also includes a plug for the handle. These handles make it easy for you to open and close your appliance door. If they are cracked or damaged, it is a good idea to replace them. The refrigerator door handle is approximately 19 inches in length, and the freezer door handle is approximately 18 5/8 inches in length. These handles are white in color. You will need a screwdriver to successfully install the new handles on your appliance. This kit does not include the screws required for installation.",
  "rating": 4.49,
  "reviewCount": 67,
  "symptoms": [
    "Door won’t open or close"
  ],
  "installationInstructions": {
    "author": "Arles from RADCLIFF, KY",
    "title": "Handle Broke next to screws because improperly tightened at installation to switch handles",
    "content": "Removed the old handles with a phillips bit and 20V drill for freezer handle.  Popped out plug with screwdriver on bottom screw of refrigerator handle and used star bit for this one screw on refrigerator door handle and phillips for other 2 screws.  Positioned handles one at a time on proper door and then manually tightened all the screws with phillips screwdriver so as to not crack the handles.  Used the 20V drill set on a torque setting for the star screw.  After screws were in, i then put in the new screw cover over the one screw on refrigerator door and I was finished."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS9864030-GE-WR12X22148-Refrigerator-Freezer-Door-Handle-Kit-White.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS9864030-GE-WR12X22148-Refrigerator-Freezer-Door-Handle-Kit-White.htm?SourceCode=18#Instructions"
  },
  "context": "refrigerator"
}