{
  "title": "Dishwasher Water Inlet Valve",
  "partUrl": "https://www.partselect.com/PS9865067-Frigidaire-807047901-Water-Inlet-Valve.htm?SourceCode=18",
  "imageUrl": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
  "price": "$48.22",
  "originalPrice": "",
  "inStock": true,
  "partSelectNumber": "PS9865067",
  "manufacturerPartNumber": "807047901",
  "description": "Dishwasher Water Inlet Valve ★★★★★ ★★★★★ 14 Reviews PartSelect Number PS9865067 Manufacturer Part Number 807047901 This water inlet valve is for dishwashers. Water inlet valve supplies water to the dishwasher. Unplug the dishwasher and shut off the water supply before installing this part",
  "rating": 4.86,
  "reviewCount": 14,
  "symptoms": [
    "Leaking",
    "Not cleaning dishes properly",
    "Will not fill with water"
  ],
  "installationInstructions": {
    "author": "CHERI from CREEKSIDE, PA",
    "title": "Dishwasher was not filling up at the start of the cycle.",
    "content": "This was really easy. Have done it before on other older dishwashers in the past. Turned off the breaker for the dishwasher. Turned off the water supply valve. Unscrewed the screws in the panel that hides the parts under the dishwasher. Unscrewed the screws anchoring the dishwasher to the counter. Slid the dishwasher out about a foot. Inlet valve was located on the front left side of the dishwasher. Unclipped the wire harness. Placed a cookie sheet under the water line. Unscrewed the water line from the inlet valve. Unscrewed the two Phillips head screws holding the valve to the dishwasher frame. Got the new part. Put the screws back into the frame. Reconnected the water line and wire harness. Slid the washer back into place. Turned on the water valve. Watched for leaks. Turned the breaker back on and started the cycle. Watched for leaks. Once I saw there weren’t any replaced the screws anchoring it to the counter and replaced the cover on the bottom. That was it! Took me longer to type out the steps than it did to actually do the repair."
  },
  "readMoreLinks": {
    "symptoms": "https://www.partselect.com/PS9865067-Frigidaire-807047901-Water-Inlet-Valve.htm?SourceCode=18#Troubleshooting",
    "instructions": "https://www.partselect.com/PS9865067-Frigidaire-807047901-Water-Inlet-Valve.htm?SourceCode=18#Instructions"
  },
  "context": "dishwasher"
}